Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
/*
 * Copyright(c) 2007 - 2019 Realtek Corporation. All rights reserved.
 * SPDX-License-Identifier: Apache-2.0
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     rtl8735b_voe.h
 * @brief    CMSIS HeaderFile
 * @version  1.0
 * @date     16. September 2020
 * @note     resulted from rtl8710c.h(AmebaZ2), because both are KM4 asic
 */



/** @addtogroup Realtek Semiconductor Corp.
  * @{
  */


/** @addtogroup rtl8735b_voe
  * @{
  */


#ifndef RTL8735B_VOE_H
#define RTL8735B_VOE_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum IRQn {
/* ========================================  ARM ARMV8MML Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn     = -12,              /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                     and No Match                                                              */
  BusFault_IRQn             = -11,              /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                     related Fault                                                             */
  UsageFault_IRQn           = -10,              /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SecureFault_IRQn          =  -9,              /*!< -9 Secure Fault Handler                                                   */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn         =  -4,              /*!< -4 Debug Monitor                                                          */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* ==========================================  rtl8735B Specific Interrupt Numbers  ========================================== */
  System_IRQn				=   0,              /*!< 00 System Interrupt                                                       */
  ISP_IRQn	        		=   1,              /*!< 01 ISP Interrupt                                                          */
  TIMER_IRQn				=   2,              /*!< 02	Timer Group0 Interrupt								                   */
  TM2KM_IRQn                =   3,              /*!< 03 TM Notify KM Interrupt                                                 */
  GPIO_IRQn                 =   4,              /*!< 04 GPIO Interrupt								                           */
  Encoder_IRQn              =   5,              /*!< 05 Encoder Interrupt													   */
  PWM_IRQn                  =   6,              /*!< 06 PWM Interrupt						                                   */
  ADC_IRQn                  =   7,              /*!< 07	ADC Interrupt								                           */
  ERAC_IRQn                 =   8,              /*!< 08 ERAC Interrupt						                                   */
  UART0_IRQn                =   9,              /*!< 09	UART0 Interrupt								                           */
  I2C3_IRQn                 =  10,              /*!< 10	I2C3 Interrupt								                           */
  GDMA0_IRQn                =  11,              /*!< 11	GDMA0 Interrupt								                           */
  GDMA1_IRQn                =  12,              /*!< 12	GDMA1 Interrupt								                           */
  NN_IRQn                   =  13,              /*!< 13 NN Interrupt 									                       */
  I2C2_IRQn                 =  14,              /*!< 14	I2C2 Interrupt										                   */
  SCRYPTO_IRQn              =  15               /*!< 15 SCrypto Interrupt									                   */
}IRQn_Type;

//typedef int32_t IRQn_Type;

/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ===========================  Configuration of the ARM ARMV8MML Processor and Core Peripherals  ============================ */
#define __ARMV8MML_REV                 0x0000U  /*!< ARMV8MML Core Revision                                                    */
#define __NVIC_PRIO_BITS               4        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __VTOR_PRESENT                 1        /*!< Set to 1 if CPU supports Vector Table Offset Register                     */
#define __MPU_PRESENT                  1        /*!< MPU present or not                                                        */
#define __FPU_PRESENT                  1        /*!< FPU present or not                                                        */
#define __FPU_DP                       0        /*!< unused, Device has no FPU                                                 */
#define __ICACHE_PRESENT               1        /*!< Instruction Cache present                                                 */
#define __DCACHE_PRESENT               1        /*!< Data Cache present                                                        */
#define __ITCM_PRESENT                 1        /*!< Instruction TCM present                                                   */
#define __DTCM_PRESENT                 1        /*!< Data TCM present                                                          */
#define __SAUREGION_PRESENT            1        /*!< SAU region present                                                        */
#define __DSP_PRESENT                  1        /*!< DSP extension present                                                     */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_armv8mml.h"                      /*!< ARM ARMV8MML processor and core peripherals                               */
#include "system_rtl8735b_voe.h"                /*!< rtl8735b_voe System                                                       */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif

//#include "rtl8735b_syson_s_type.h"

/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

#define CONFIG_GPIO_EN                      1


/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/
/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                           SYSON                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief HS System Power Control (SYSON)
  */

typedef struct {                                /*!< (@ 0x40000000) SYSON Structure                                            */

  union {
    __IM  uint32_t not_exposed_reg;             /*!< (@ 0x00000000) Registers definition is not exposed                        */

