Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IM  uint32_t temp       : 32;           /*!< [31..0] temp                                                              */
    } not_exposed_reg_b;
  } ;
} SYSON_Type;                                   /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                          SYSON_S                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Secure System On (SYSON_S)
  */

typedef struct {                                /*!< (@ 0x50000800) SYSON_S Structure                                          */

  union {
    __IM  uint32_t not_exposed_reg;             /*!< (@ 0x00000000) Registers definition is not exposed                        */

    struct {
      __IM  uint32_t temp       : 32;           /*!< [31..0] temp                                                              */
    } not_exposed_reg_b;
  } ;
} SYSON_S_Type;                                 /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose I/O (GPIO)
  */

typedef struct {                                /*!< (@ 0x40001000) GPIO Structure                                             */

  union {
    __IM  uint32_t it_sts;                      /*!< (@ 0x00000000) GPIO interrupt type status Register                        */

    struct {
      __IM  uint32_t gpio_it_sts : 16;          /*!< [15..0] For each bit :0: the specific GPIO pin is configured
                                                     to edge sensitive interrupt mode1: the specific GPIO pin
                                                     is configured to levle sensitive interrupt mode.                          */
            uint32_t            : 16;
    } it_sts_b;
  } ;

  union {
    __IOM uint32_t ei_en;                       /*!< (@ 0x00000004) GPIO edge sensitive interrupt mode enable                  */

    struct {
      __IOM uint32_t ei_en      : 16;           /*!< [15..0] For each bit write: 0: No operation1: the conrtolled
                                                     GPIO pin is configured to edge sensitive interrupt mode
                                                     and also cause the corresponging bit of REG_GPIO_IT_STS
                                                     to be read as 0.                                                          */
            uint32_t            : 16;
    } ei_en_b;
  } ;

  union {
    __IOM uint32_t li_en;                       /*!< (@ 0x00000008) GPIO level sensitive interrupt mode enable                 */

    struct {
      __IOM uint32_t li_en      : 16;           /*!< [15..0] For each bit write: 0: No operation1: the conrtolled
                                                     GPIO pin is configured as level sensitive interrupt mode
                                                     and also cause the corresponging bit of REG_GPIO_IT_STS
                                                     to be read as 1.                                                          */
            uint32_t            : 16;
    } li_en_b;
  } ;

  union {
    __IM  uint32_t ip_sts;                      /*!< (@ 0x0000000C) GPIO interrupt polarity status                             */

    struct {
      __IM  uint32_t ip_sts0    : 2;            /*!< [1..0] The interrupt polarity status of GPIO0                             */
      __IM  uint32_t ip_sts1    : 2;            /*!< [3..2] The interrupt polarity status of GPIO1                             */
      __IM  uint32_t ip_sts2    : 2;            /*!< [5..4] The interrupt polarity status of GPIO2                             */
      __IM  uint32_t ip_sts3    : 2;            /*!< [7..6] The interrupt polarity status of GPIO3                             */
      __IM  uint32_t ip_sts4    : 2;            /*!< [9..8] The interrupt polarity status of GPIO4                             */
      __IM  uint32_t ip_sts5    : 2;            /*!< [11..10] The interrupt polarity status of GPIO5                           */
      __IM  uint32_t ip_sts6    : 2;            /*!< [13..12] The interrupt polarity status of GPIO6                           */
      __IM  uint32_t ip_sts7    : 2;            /*!< [15..14] The interrupt polarity status of GPIO7                           */
      __IM  uint32_t ip_sts8    : 2;            /*!< [17..16] The interrupt polarity status of GPIO8                           */
      __IM  uint32_t ip_sts9    : 2;            /*!< [19..18] The interrupt polarity status of GPIO9                           */
      __IM  uint32_t ip_sts10   : 2;            /*!< [21..20] The interrupt polarity status of GPIO10                          */
      __IM  uint32_t ip_sts11   : 2;            /*!< [23..22] The interrupt polarity status of GPIO11                          */
      __IM  uint32_t ip_sts12   : 2;            /*!< [25..24] The interrupt polarity status of GPIO12                          */
      __IM  uint32_t ip_sts13   : 2;            /*!< [27..26] The interrupt polarity status of GPIO13                          */
      __IM  uint32_t ip_sts14   : 2;            /*!< [29..28] The interrupt polarity status of GPIO14                          */
      __IM  uint32_t ip_sts15   : 2;            /*!< [31..30] The interrupt polarity status of GPIO15                          */
    } ip_sts_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t ir_en;                       /*!< (@ 0x00000014) GPIO interrupt rising-edge enable                          */

