Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t ir_en      : 16;           /*!< [15..0] For each bit write: 0: No operation;1: the conrtolled
                                                     GPIO pin is configured to rising-edge interrupt mode or
                                                     high-level mode (depends on REG_GPIO_IT_STS) and also cause
                                                     the corresponding bits of REG_GPIO_IP_STS to be read as
                                                     00b.                                                                      */
            uint32_t            : 16;
    } ir_en_b;
  } ;

  union {
    __IOM uint32_t if_en;                       /*!< (@ 0x00000018) GPIO interrupt falling-edge enable                         */

    struct {
      __IOM uint32_t if_en      : 16;           /*!< [15..0] For each bit write:0: No operation;1: the conrtolled
                                                     GPIO pin is configured to falling-edge interrupt mode or
                                                     low-level interrupt mode (depends on REG_GPIO_IT_STS) and
                                                     cause the corresponding bits of REG_GPIO_IP_STS to be read
                                                     as 01b.                                                                   */
            uint32_t            : 16;
    } if_en_b;
  } ;

  union {
    __IOM uint32_t id_en;                       /*!< (@ 0x0000001C) GPIO interrupt dual-edge enable                            */

    struct {
      __IOM uint32_t id_en      : 16;           /*!< [15..0] For each bit write:0: No operation;1: the conrtolled
                                                     GPIO pin is configured to dual-edge interrupt mode and
                                                     also cause the corresponding bits of REG_GPIO_IP_STS to
                                                     be read as 10b.                                                           */
            uint32_t            : 16;
    } id_en_b;
  } ;

  union {
    __IM  uint32_t ie_sts;                      /*!< (@ 0x00000020) GPIO interrupt enable status                               */

    struct {
      __IM  uint32_t ie_sts     : 16;           /*!< [15..0] For each bit:0: the interrupt of the specific GPIO pin
                                                     is disabled1: the interrupt of the specific GPIO pin is
                                                     enabled                                                                   */
            uint32_t            : 16;
    } ie_sts_b;
  } ;

  union {
    __IOM uint32_t int_en;                      /*!< (@ 0x00000024) GPIO interrupt enable                                      */

    struct {
      __IOM uint32_t int_en     : 16;           /*!< [15..0] For each bit write:0: No operation1: to enable the specific
                                                     GPIO INT and also cause the specified bit of REG_GPIO_IE_STS
                                                     to be read as ONE.                                                        */
            uint32_t            : 16;
    } int_en_b;
  } ;

  union {
    __IOM uint32_t int_dis;                     /*!< (@ 0x00000028) GPIO interrupt disable                                     */

    struct {
      __IOM uint32_t int_dis    : 16;           /*!< [15..0] For each bit write:0: No operation1: to disable the
                                                     specified the GPIO INT and also cause the specified bit
                                                     of REG_GPIO_IE_STS to be read as ZERO.                                    */
            uint32_t            : 16;
    } int_dis_b;
  } ;

  union {
    __IM  uint32_t int_raw_sts;                 /*!< (@ 0x0000002C) GPIO RAW interrupt status                                  */

    struct {
      __IM  uint32_t int_raw_sts : 16;          /*!< [15..0] For each bit:0: the specified GPIO pin has no pending
                                                     interrupt1: the specified GPIO pin's interrupt is pending
                                                     (permasking)                                                              */
            uint32_t            : 16;
    } int_raw_sts_b;
  } ;

  union {
    __IM  uint32_t int_sts;                     /*!< (@ 0x00000030) GPIO interrupt status                                      */

    struct {
      __IM  uint32_t int_sts    : 16;           /*!< [15..0] For each bit:0: the specified GPIO pin has no pending
                                                     interrupt1: the specified GPIO pin's interrupt is pending                 */
            uint32_t            : 16;
    } int_sts_b;
  } ;

  union {
    __IOM uint32_t int_clr;                     /*!< (@ 0x00000034) GPIO interrupt status clear                                */

    struct {
      __IOM uint32_t int_clr    : 16;           /*!< [15..0] For each bit writting:0: No operation;1: Clear edge
                                                     type pending interrupt of the conrtolled GPIO pin and clear
                                                     the specified bits of REG_GPIO_INT_STS as ZERO                            */
            uint32_t            : 16;
    } int_clr_b;
  } ;

  union {
    __IM  uint32_t int_func_en_sts;             /*!< (@ 0x00000038) GPIO interrupt function enable status                      */

    struct {
      __IM  uint32_t int_en_sts : 16;           /*!< [15..0] For each bit:0: the specified GPIO INT is Disable1:
                                                     the specified GPIO INT is Enable                                          */
            uint32_t            : 16;
    } int_func_en_sts_b;
  } ;

  union {
    __IOM uint32_t int_func_en;                 /*!< (@ 0x0000003C) GPIO interrupt function enable                             */

