Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t idm_en     : 32;           /*!< [31..0] For each bit write:0: the configuration of the conrtolled
                                                     GPIO pin is unchanged;1: the conrtolled GPIO pin is configured
                                                     to input data mode and also cause the specified bit of
                                                     REG_PORT_D_DMD_STS to be read as zero.                                    */
    } port_d_idm_en_b;
  } ;

  union {
    __IOM uint32_t port_d_odm_en;               /*!< (@ 0x000002C8) GPIO port D output data mode enable                        */

    struct {
      __IOM uint32_t odm_en     : 32;           /*!< [31..0] For each bit write:0: the configuration of the conrtolled
                                                     GPIO pin is unchanged;1: the conrtolled GPIO pin is configured
                                                     as output data mode and also cause the specified bit of
                                                     REG_PORT_D_DMD_STS to be read as one                                      */
    } port_d_odm_en_b;
  } ;

  union {
    __IM  uint32_t port_d_od_sts;               /*!< (@ 0x000002CC) GPIO port D output data status                             */

    struct {
      __IM  uint32_t od_sts     : 32;           /*!< [31..0] For each bit:0: the specified GPIO pin is configured
                                                     as output low 1: the specified GPIO pin is configured as
                                                     output high, if the specific GPIO pin is output data mode.                */
    } port_d_od_sts_b;
  } ;

  union {
    __IOM uint32_t port_d_odl_en;               /*!< (@ 0x000002D0) GPIO port D output data low enable                         */

    struct {
      __IOM uint32_t odl_en     : 32;           /*!< [31..0] For each bit write:0: No operation1: the conrtolled
                                                     GPIO pin is configured as output low and also cause the
                                                     specified bit of REG_PORT_D_OD_STS is zero.                               */
    } port_d_odl_en_b;
  } ;

  union {
    __IOM uint32_t port_d_odh_en;               /*!< (@ 0x000002D4) GPIO port D output data high enable                        */

    struct {
      __IOM uint32_t odh_en     : 32;           /*!< [31..0] For each bit write:0: No operation1: the conrtolled
                                                     GPIO pin is configured as output high and also cause the
                                                     specified bit of REG_PORT_D_OD_STS is one.                                */
    } port_d_odh_en_b;
  } ;

  union {
    __IOM uint32_t port_d_odt_en;               /*!< (@ 0x000002D8) GPIO port D output data toggle enable                      */

    struct {
      __IOM uint32_t odt_en     : 32;           /*!< [31..0] For each bit write:0: No operation1: Toggle output of
                                                     the conrtolled GPIO pin and the specified bit of REG_PORT_D_OD_STS
                                                     also will be toggled.                                                     */
    } port_d_odt_en_b;
  } ;

  union {
    __IM  uint32_t port_d_dp_sts;               /*!< (@ 0x000002DC) GPIO port D data pin status                                */

    struct {
      __IM  uint32_t dp_sts     : 32;           /*!< [31..0] For each bit reading:If the direction of the specified
                                                     bit is input then read the signal level of the input pin.If
                                                     the direction of the specified bit is output then reads
                                                     the output data register for port D.                                      */
    } port_d_dp_sts_b;
  } ;
} GPIO_Type;                                    /*!< Size = 736 (0x2e0)                                                        */



/* =========================================================================================================================== */
/* ================                                           COMP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief 4-channel comparator (COMP)
  */

typedef struct {                                /*!< (@ 0x4000AC00) COMP Structure                                             */

  union {
    __IOM uint32_t ref_ch0;                     /*!< (@ 0x00000000) Comparator Channel 0 Reference Volatage Register           */

    struct {
      __IOM uint32_t ref0       : 8;            /*!< [7..0] This bit controls the comparator channel 0 internal reference
                                                     voltage 0.Vref0 is equal to (the value of BIT_COMP_REF0)
                                                     * 0.1V.Therefore, when BIT_COMP_REF0 is 5, Vref0 is 0.5V.
                                                     When BIT_COMP_REF0 is 30, Vref0 is 3.0V.0x00: Vref0 is
                                                     0V.0x01: Vref0 is 0.1V.0x02: Vref0 is 0.2V . . .                          */
            uint32_t            : 8;
      __IOM uint32_t ref1       : 8;            /*!< [23..16] This bit controls the comparator channel 0 internal
                                                     reference voltage 1.Vref1 is equal to (the value of BIT_COMP_REF1)
                                                     * 0.1V.Therefore, when BIT_COMP_REF1 is 5, Vref1 is 0.5V.
                                                     When BIT_COMP_REF1 is 30, Vref1 is 3.0V.0x00: Vref1 is
                                                     0V.0x01: Vref1 is 0.1V.0x02: Vref1 is 0.2V . . .                          */
            uint32_t            : 8;
    } ref_ch0_b;
  } ;

  union {
    __IOM uint32_t ref_ch1;                     /*!< (@ 0x00000004) Comparator Channel 1 Reference Volatage Register           */

