Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t ref0       : 8;            /*!< [7..0] This bit controls the comparator channel 1 internal reference
                                                     voltage 0.Vref0 is equal to (the value of BIT_COMP_REF0)
                                                     * 0.1V.Therefore, when BIT_COMP_REF0 is 5, Vref0 is 0.5V.
                                                     When BIT_COMP_REF0 is 30, Vref0 is 3.0V.0x00: Vref0 is
                                                     0V.0x01: Vref0 is 0.1V.0x02: Vref0 is 0.2V . . .                          */
            uint32_t            : 8;
      __IOM uint32_t ref1       : 8;            /*!< [23..16] This bit controls the comparator channel 1 internal
                                                     reference voltage 1.Vref1 is equal to (the value of BIT_COMP_REF1)
                                                     * 0.1V.Therefore, when BIT_COMP_REF1 is 5, Vref1 is 0.5V.
                                                     When BIT_COMP_REF1 is 30, Vref1 is 3.0V.0x00: Vref1 is
                                                     0V.0x01: Vref1 is 0.1V.0x02: Vref1 is 0.2V . . .                          */
            uint32_t            : 8;
    } ref_ch1_b;
  } ;

  union {
    __IOM uint32_t ref_ch2;                     /*!< (@ 0x00000008) Comparator Channel 2 Reference Volatage Register           */

    struct {
      __IOM uint32_t ref0       : 8;            /*!< [7..0] This bit controls the comparator channel 2 internal reference
                                                     voltage 0.Vref0 is equal to (the value of BIT_COMP_REF0)
                                                     * 0.1V.Therefore, when BIT_COMP_REF0 is 5, Vref0 is 0.5V.
                                                     When BIT_COMP_REF0 is 30, Vref0 is 3.0V.0x00: Vref0 is
                                                     0V.0x01: Vref0 is 0.1V.0x02: Vref0 is 0.2V . . .                          */
            uint32_t            : 8;
      __IOM uint32_t ref1       : 8;            /*!< [23..16] This bit controls the comparator channel 2 internal
                                                     reference voltage 1.Vref1 is equal to (the value of BIT_COMP_REF1)
                                                     * 0.1V.Therefore, when BIT_COMP_REF1 is 5, Vref1 is 0.5V.
                                                     When BIT_COMP_REF1 is 30, Vref1 is 3.0V.0x00: Vref1 is
                                                     0V.0x01: Vref1 is 0.1V.0x02: Vref1 is 0.2V . . .                          */
            uint32_t            : 8;
    } ref_ch2_b;
  } ;

  union {
    __IOM uint32_t ref_ch3;                     /*!< (@ 0x0000000C) Comparator Channel 3 Reference Volatage Register           */

    struct {
      __IOM uint32_t ref0       : 8;            /*!< [7..0] This bit controls the comparator channel 3 internal reference
                                                     voltage 0.Vref0 is equal to (the value of BIT_COMP_REF0)
                                                     * 0.1V.Therefore, when BIT_COMP_REF0 is 5, Vref0 is 0.5V.
                                                     When BIT_COMP_REF0 is 30, Vref0 is 3.0V.0x00: Vref0 is
                                                     0V.0x01: Vref0 is 0.1V.0x02: Vref0 is 0.2V . . .                          */
            uint32_t            : 8;
      __IOM uint32_t ref1       : 8;            /*!< [23..16] This bit controls the comparator channel 3 internal
                                                     reference voltage 1.Vref1 is equal to (the value of BIT_COMP_REF1)
                                                     * 0.1V.Therefore, when BIT_COMP_REF1 is 5, Vref1 is 0.5V.
                                                     When BIT_COMP_REF1 is 30, Vref1 is 3.0V.0x00: Vref1 is
                                                     0V.0x01: Vref1 is 0.1V.0x02: Vref1 is 0.2V . . .                          */
            uint32_t            : 8;
    } ref_ch3_b;
  } ;

  union {
    __IOM uint32_t intr_ctrl;                   /*!< (@ 0x00000010) Comparator Interrupt Control Register                      */

    struct {
      __IOM uint32_t wk_sys_en_0 : 1;           /*!< [0..0] This bit controls whether the comparator channel 0 sends
                                                     wakeup signal or not when the criterion of BIT_COMP_WK_SYS_CTRL
                                                     matches.0: Disable comparator interrupt (wake up) system.1:
                                                     Enable comparator interrupt (wake up) system.                             */
      __IOM uint32_t wk_sys_ctrl_0 : 2;         /*!< [2..1] This bit defines the criterion of when comparator channel
                                                     0 should interrupt (wake up) system. The comparator should
                                                     send wakeup signal only when BIT_COMP_WK_SYS_EN is 1, if
                                                     the criterion matches.0: When Vin < Vref0, the comparator
                                                     interrupts (wake up) system.1: When Vin > Vref1, the Comparator
                                                     interrupts (wake up) system.2: When Vin > Vref0 and Vin
                                                     < Vref1, the Comparator interrupts (wake up) system.3:
                                                     When Vin < Vref0 or Vin > Vref1, the Comparator interrupts
                                                     (wake up) system.                                                         */
      __IOM uint32_t wk_sys_en_1 : 1;           /*!< [3..3] This bit controls whether the comparator channel 1 sends
                                                     interrupt (wake up) signal or not when the criterion of
                                                     BIT_COMP_WK_SYS_CTRL matches.0: Disable comparator interrupt
                                                     (wake up) system.1: Enable comparator interrupt (wake up)
                                                     system.                                                                   */
      __IOM uint32_t wk_sys_ctrl_1 : 2;         /*!< [5..4] This bit defines the criterion of when comparator channel
                                                     1 should interrupt (wake up) system. The comparator should
                                                     send wakeup signal only when BIT_COMP_WK_SYS_EN is 1, if
                                                     the criterion matches.0: When Vin < Vref0, the comparator
                                                     interrupt (wake up) system.1: When Vin > Vref1, the Comparator
                                                     interrupt (wake up) system.2: When Vin > Vref0 and Vin
                                                     < Vref1, the Comparator interrupts (wake up) system.3:
                                                     When Vin < Vref0 or Vin > Vref1, the Comparator interrupts
                                                     (wake up) system.                                                         */
      __IOM uint32_t wk_sys_en_2 : 1;           /*!< [6..6] This bit controls whether the comparator channel 2 sends
                                                     interrupt (wake up) signal or not when the criterion of
                                                     BIT_COMP_WK_SYS_CTRL matches.0: Disable comparator interrupt
                                                     (wake up) system.1: Enable comparator interrupt (wake up)
                                                     system.                                                                   */
      __IOM uint32_t wk_sys_ctrl_2 : 2;         /*!< [8..7] This bit defines the criterion of when comparator channel
                                                     2 should interrupt (wake up) system. The comparator should
                                                     send wakeup signal only when BIT_COMP_WK_SYS_EN is 1, if
                                                     the criterion matches.0: When Vin < Vref0, the comparator
                                                     interrupts (wake up) system.1: When Vin >= Vref1, the Comparator
                                                     interrupts (wake up) system.2: When Vin > Vref0 and Vin
                                                     < Vref1, the Comparator interrupts (wake up) system.3:
                                                     When Vin < Vref0 or Vin > Vref1, the Comparator interrupts
                                                     (wake up) system.                                                         */
      __IOM uint32_t wk_sys_en_3 : 1;           /*!< [9..9] This bit controls whether the comparator channel 3 sends
                                                     interrupt (wake up) signal or not when the criterion of
                                                     BIT_COMP_WK_SYS_CTRL matches.0: Disable comparator interrupt
                                                     (wake up) system.1: Enable comparator interrupt (wake up)
                                                     system.                                                                   */
      __IOM uint32_t wk_sys_ctrl_3 : 2;         /*!< [11..10] This bit defines the criterion of when comparator channel
                                                     3 should interrupts (wake up) system. The comparator should
                                                     send wakeup signal only when BIT_COMP_WK_SYS_EN is 1, if
                                                     the criterion matches.0: When Vin < Vref0, the comparator
                                                     interrupts (wake up) system.1: When Vin > Vref1, the Comparator
                                                     interrupts (wake up) system.2: When Vin > Vref0 and Vin
                                                     < Vref1, the Comparator interrupts (wake up) system.3:
                                                     When Vin < Vref0 or Vin > Vref1, the Comparator interrupts
                                                     (wake up) system.                                                         */
            uint32_t            : 20;
    } intr_ctrl_b;
  } ;

  union {
    __IOM uint32_t intr_sts;                    /*!< (@ 0x00000014) Comparator Interrupt Status Register                       */

