Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t wk_sys_sts_0 : 1;          /*!< [0..0] This bit reflects if channle 0 of comparator module sent
                                                     a interrupt (wake-up) signal to system or not.0: Channel
                                                     0 did NOT send an interrupt (wake-up) signal to system.1:
                                                     Channel 0 has sent an interrupt (wake-up) signal to system.               */
            uint32_t            : 2;
      __IOM uint32_t wk_sys_sts_1 : 1;          /*!< [3..3] This bit reflects if channle 1 of comparator module sent
                                                     a interrupt (wake-up) signal to system or not.0: Channel
                                                     1 did NOT send an interrupt (wake-up) signal to system.1:
                                                     Channel 1 has sent an interrupt (wake-up) signal to system.               */
            uint32_t            : 2;
      __IOM uint32_t wk_sys_sts_2 : 1;          /*!< [6..6] This bit reflects if channle 2 of comparator module sent
                                                     a interrupt (wake-up) signal to system or not.0: Channel
                                                     2 did NOT send an interrupt (wake-up) signal to system.1:
                                                     Channel 2 has sent an interrupt (wake-up) signal to system.               */
            uint32_t            : 2;
      __IOM uint32_t wk_sys_sts_3 : 1;          /*!< [9..9] This bit reflects if channle 3 of comparator module sent
                                                     a interrupt (wake-up) signal to system or not.0: Channel
                                                     3 did NOT send an interrupt (wake-up) signal to system.1:
                                                     Channel 3 has sent an interrupt (wake-up) signal to system.               */
            uint32_t            : 22;
    } intr_sts_b;
  } ;

  union {
    __IM  uint32_t intr_raw_sts;                /*!< (@ 0x00000018) Comparator Interrupt RAW Status Register                   */

    struct {
      __IM  uint32_t wk_sys_sts_0 : 1;          /*!< [0..0] This bit reflects if channle 0 of comparator module sent
                                                     a interrupt (wake-up) signal to system or not.0: Channel
                                                     0 did NOT send an interrupt (wake-up) signal to system.1:
                                                     Channel 0 has sent an interrupt (wake-up) signal to system.               */
            uint32_t            : 2;
      __IM  uint32_t wk_sys_sts_1 : 1;          /*!< [3..3] This bit reflects if channle 1 of comparator module sent
                                                     a interrupt (wake-up) signal to system or not.0: Channel
                                                     1 did NOT send an interrupt (wake-up) signal to system.1:
                                                     Channel 1 has sent an interrupt (wake-up) signal to system.               */
            uint32_t            : 2;
      __IM  uint32_t wk_sys_sts_2 : 1;          /*!< [6..6] This bit reflects if channle 2 of comparator module sent
                                                     a interrupt (wake-up) signal to system or not.0: Channel
                                                     2 did NOT send an interrupt (wake-up) signal to system.1:
                                                     Channel 2 has sent an interrupt (wake-up) signal to system.               */
            uint32_t            : 2;
      __IM  uint32_t wk_sys_sts_3 : 1;          /*!< [9..9] This bit reflects if channle 3 of comparator module sent
                                                     a interrupt (wake-up) signal to system or not.0: Channel
                                                     3 did NOT send an interrupt (wake-up) signal to system.1:
                                                     Channel 3 has sent an interrupt (wake-up) signal to system.               */
            uint32_t            : 22;
    } intr_raw_sts_b;
  } ;

  union {
    __IOM uint32_t chsw_list;                   /*!< (@ 0x0000001C) Comparator Channel Switch List Register                    */

    struct {
      __IOM uint32_t chsw_0     : 4;            /*!< [3..0] These bits defines the 1st channel to do a comparison
                                                     when the start-compare event takes place.                                 */
      __IOM uint32_t chsw_1     : 4;            /*!< [7..4] These bits defines the 2nd channel to do a comparison
                                                     when the start-compare event takes place.                                 */
      __IOM uint32_t chsw_2     : 4;            /*!< [11..8] These bits defines the 3rd channel to do a comparison
                                                     when the start-compare event takes place.                                 */
      __IOM uint32_t chsw_3     : 4;            /*!< [15..12] These bits defines the 4th channel to do a comparison
                                                     when the start-compare event takes place.                                 */
            uint32_t            : 16;
    } chsw_list_b;
  } ;

  union {
    __IOM uint32_t last_ch;                     /*!< (@ 0x00000020) Comparator Last Channel Register                           */

    struct {
      __IOM uint32_t last_ch    : 2;            /*!< [1..0] These bits reflects the last used channel.                         */
            uint32_t            : 30;
    } last_ch_b;
  } ;

  union {
    __IM  uint32_t busy;                        /*!< (@ 0x00000024) Comparator Busy Status Register                            */

    struct {
      __IM  uint32_t busy       : 1;            /*!< [0..0] This bit reflects the comparator is busy or not. If the
                                                     comparator is processing a comparison of a channel, this
                                                     bit remains 1 which indicates it's busy. Once a comparison
                                                     is done, this bit becomes 0 which indicates its' ready
                                                     to do another comparison.0: The comparator is ready.1:
                                                     The comparator is busy.                                                   */
            uint32_t            : 31;
    } busy_b;
  } ;

  union {
    __IM  uint32_t ch_sts;                      /*!< (@ 0x00000028) Comparator Channel Status Register                         */

