Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IM  uint32_t ch_sts_0   : 2;            /*!< [1..0] This bit reflects the channel 0 comparison result.0:
                                                     When Vin < Vref0, the bits should be set to 0.1: When Vin
                                                     >= Vref1, the bits should be set to 1.2:When Vin > Vref0
                                                     and Vin < Vref1, the bits should be set to 2.                             */
      __IM  uint32_t ch_sts_1   : 2;            /*!< [3..2] This bit reflects the channel 1 comparison result.0:
                                                     When Vin < Vref0, the bits should be set to 0.1: When Vin
                                                     >= Vref1, the bits should be set to 1.2:When Vin > Vref0
                                                     and Vin < Vref1, the bits should be set to 2.                             */
      __IM  uint32_t ch_sts_2   : 2;            /*!< [5..4] This bit reflects the channel 2 comparison result.0:
                                                     When Vin < Vref0, the bits should be set to 0.1: When Vin
                                                     >= Vref1, the bits should be set to 1.2:When Vin > Vref0
                                                     and Vin < Vref1, the bits should be set to 2.                             */
      __IM  uint32_t ch_sts_3   : 2;            /*!< [7..6] This bit reflects the channel 3 comparison result.0:
                                                     When Vin < Vref0, the bits should be set to 0.1: When Vin
                                                     >= Vref1, the bits should be set to 1.2:When Vin > Vref0
                                                     and Vin < Vref1, the bits should be set to 2.                             */
            uint32_t            : 24;
    } ch_sts_b;
  } ;

  union {
    __IOM uint32_t auto_shut;                   /*!< (@ 0x0000002C) Comparator Auto Shutdown Register                          */

    struct {
      __IOM uint32_t auto_shut  : 1;            /*!< [0..0] This bit controls the comparator to disable the analog
                                                     module and mux automatically or not after the analog conversion
                                                     is done.0: The analog module and mux will NOT be disabled.The
                                                     comparator module is always enabled.1: The analog module
                                                     and mux will be disabled automatically after the analog
                                                     conversion is done.                                                       */
            uint32_t            : 31;
    } auto_shut_b;
  } ;

  union {
    __IOM uint32_t wk_timer;                    /*!< (@ 0x00000030) Comparator Wake Timer Control Reigster                     */

    struct {
      __IOM uint32_t wk_timer   : 1;            /*!< [0..0] This bit controls the external trigger source of general
                                                     timer enabled or not.If it is enabled, the comparator would
                                                     execute compare process when the timer event sends to comparator
                                                     module.0: Disable external timer trigger1: Enable external
                                                     timer trigger                                                             */
            uint32_t            : 31;
    } wk_timer_b;
  } ;

  union {
    __IOM uint32_t wk_timer_sel;                /*!< (@ 0x00000034) Comparator Wake Timer Select Reigster                      */

    struct {
      __IOM uint32_t wk_timer_sel : 2;          /*!< [1..0] This three bits defines which timer channel would be
                                                     used to wake up the comparator.BIT_COMP_EXT_WK_TIMER_SEL
                                                     is 0: Timer module 0 is used as the comparator external
                                                     trigger source.1: Timer module 1 is used as the comparator
                                                     external trigger source. . . .3: Timer module 3 is used
                                                     as the comparator external trigger source.                                */
            uint32_t            : 30;
    } wk_timer_sel_b;
  } ;

  union {
    __IOM uint32_t rst_list;                    /*!< (@ 0x00000038) Comparator Rest List Register                              */

    struct {
      __IOM uint32_t rst_list   : 1;            /*!< [0..0] This bit controls to reset the channel switch to default
                                                     state or not. Once this bit is set, the auto/manual channel
                                                     switch goes to the first channel as a default state.0:
                                                     Do not reset conversion list to default state.1: Reset
                                                     conversion list to default state.                                         */
            uint32_t            : 31;
    } rst_list_b;
  } ;

  union {
    __IOM uint32_t auto_sw_en;                  /*!< (@ 0x0000003C) Comparator Auto Channel Switch Enable Reigster             */

    struct {
      __IOM uint32_t auto_sw_en : 1;            /*!< [0..0] This bit controls the automatic channel swtich enabled
                                                     or disabled.If it's disabled, comparator could be run in
                                                     software or timer trigger mode.0: Disable the automatic
                                                     channel switch. 1: Enable the automatic channel switch.                   */
            uint32_t            : 31;
    } auto_sw_en_b;
  } ;

  union {
    __IOM uint32_t enable;                      /*!< (@ 0x00000040) Comparator Enable Control Register                         */

