Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t enable     : 1;            /*!< [0..0] This bit is for comparator enable control.                         */
      __IOM uint32_t trig_en    : 1;            /*!< [1..1] This bit is a mulitple trigger control source.For software
                                                     trigger (when comparator auto channel switch register (offset:
                                                     0x3C) is NOT set and wake timer control is NOT set), this
                                                     bit is used to be a software trigger source. Each time
                                                     this bit is set to 1 from 0, it drives comparator to do
                                                     a channel comparison.For auto trigger, this bit is used
                                                     to drive comparator to start the auto channel switch operation.           */
            uint32_t            : 30;
    } enable_b;
  } ;

  union {
    __IOM uint32_t wk_shut_cnt;                 /*!< (@ 0x00000044) Comparator Shutdown Counter Register                       */

    struct {
      __IOM uint32_t wk_shut_cnt : 8;           /*!< [7..0] This eight bits defines how long to disable comparator
                                                     analog module when an external trigger event is sent to
                                                     the comparator. The count must include the comparator response
                                                     time to get a correct compare result.                                     */
            uint32_t            : 24;
    } wk_shut_cnt_b;
  } ;
} COMP_Type;                                    /*!< Size = 72 (0x48)                                                          */



/* =========================================================================================================================== */
/* ================                                            TG0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose Timer Group Control (TG0)
  */

typedef struct {                                /*!< (@ 0x40002000) TG0 Structure                                              */

  union {
    __IM  uint32_t ists;                        /*!< (@ 0x00000000) Timer Group interrupt status register                      */

    struct {
      __IM  uint32_t ists       : 8;            /*!< [7..0] Each bit indicates the interrupt pending status of corresponding
                                                     timer:0: the specifiied timer has no interrupt pending1:
                                                     the specifiied timer has pending interrupt                                */
            uint32_t            : 24;
    } ists_b;
  } ;

  union {
    __IM  uint32_t raw_ists;                    /*!< (@ 0x00000004) Timer Group raw interrupt status register                  */

    struct {
      __IM  uint32_t rists      : 8;            /*!< [7..0] Each bit indicates the interrupt pending status of corresponding
                                                     timer:0: the specifiied timer has no interrupt pending1:
                                                     the specifiied timer has pending interrupt (pre-masing)                   */
            uint32_t            : 24;
    } raw_ists_b;
  } ;

  union {
    __IOM uint32_t tsel;                        /*!< (@ 0x00000008) Timer Group indirect read control register                 */

    struct {
      __IOM uint32_t tsel       : 3;            /*!< [2..0] The timer index in a timer group, to select the timer
                                                     for indirect read.                                                        */
            uint32_t            : 1;
      __IOM uint32_t sync_mode  : 1;            /*!< [4..4] Sync mode between Timer clock and APB clock0: Freq. of
                                                     APB clock >> Freq. of Timer clock (about 10 times)1: others               */
            uint32_t            : 2;
      __IOM uint32_t poll       : 1;            /*!< [7..7] Set this bit to enable indirect read current value of
                                                     timer selected by tsel. This bit is cleared by HW while
                                                     finishing read and indicate REG_TIMER_TC is ready                         */
            uint32_t            : 24;
    } tsel_b;
  } ;

  union {
    __IM  uint32_t tc;                          /*!< (@ 0x0000000C) Timer Group indirect read timer counter register           */

    struct {
      __IM  uint32_t timer_tc   : 32;           /*!< [31..0] Current counter value of the specifiied timer by register
                                                     tg_tsel.                                                                  */
    } tc_b;
  } ;
} TG_Type;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            TM0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose Timer0 (TM0)
  */

typedef struct {                                /*!< (@ 0x40002040) TM0 Structure                                              */

  union {
    __IOM uint32_t lc;                          /*!< (@ 0x00000000) Timer load count register                                  */

    struct {
      __IOM uint32_t lc         : 32;           /*!< [31..0] The counter value to be loaded into the timer counter
                                                     when timer is enabled or reset.Min = 0, when prescaler
                                                     register > 0; otherwise Min = 1.                                          */
    } lc_b;
  } ;

  union {
    __IOM uint32_t tc;                          /*!< (@ 0x00000004) Timer current counter register                             */

