Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t tc         : 32;           /*!< [31..0] Current counter value.                                            */
    } tc_b;
  } ;

  union {
    __IOM uint32_t pc;                          /*!< (@ 0x00000008) Timer prescaler counter register                           */

    struct {
      __IOM uint32_t pc         : 10;           /*!< [9..0] Pre-scaler counter will be increased every clock after
                                                     timer is enabled. When the prescaler counter is equal to
                                                     PR, the next clock increments (decrements) the TC and clears
                                                     the PC.                                                                   */
            uint32_t            : 22;
    } pc_b;
  } ;

  union {
    __IOM uint32_t pr;                          /*!< (@ 0x0000000C) Timer prescaler register                                   */

    struct {
      __IOM uint32_t pr         : 10;           /*!< [9..0] When the PC is equal to this value, the next clock increments
                                                     (decrements) the TC and clears the PC.                                    */
            uint32_t            : 22;
    } pr_b;
  } ;

  union {
    __IOM uint32_t ctrl;                        /*!< (@ 0x00000010) Timer control register                                     */

    struct {
      __IOM uint32_t en         : 1;            /*!< [0..0] Timer enable control:0: Disable1: Enable                           */
      __IOM uint32_t mod        : 1;            /*!< [1..1] Timer operation mode:0: timer mode (periodical mode);
                                                     it reloads LC to TC and repeat the process according to
                                                     the setting when the timeout event occurred.1: counter
                                                     mode (one-shot mode); only one time process.                              */
      __IOM uint32_t imr        : 1;            /*!< [2..2] Timer Interrupt mask:0: disable interrupt1: enable interrupt       */
      __IOM uint32_t cnt_mod    : 1;            /*!< [3..3] Timer counting mode:0: Up-counter1: Down-counter                   */
            uint32_t            : 28;
    } ctrl_b;
  } ;

  union {
    __IOM uint32_t isr;                         /*!< (@ 0x00000014) Timer0 interrupt status register                           */

    struct {
      __IOM uint32_t timeout    : 1;            /*!< [0..0] Timeout interrupt                                                  */
      __IOM uint32_t match_ev0  : 1;            /*!< [1..1] Counter value match event0 interrupt.                              */
      __IOM uint32_t match_ev1  : 1;            /*!< [2..2] Counter value match event1 interrupt.                              */
      __IOM uint32_t match_ev2  : 1;            /*!< [3..3] Counter value match event2 interrupt.                              */
      __IOM uint32_t match_ev3  : 1;            /*!< [4..4] Counter value match event3 interrupt.                              */
            uint32_t            : 27;
    } isr_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t mectrl;                      /*!< (@ 0x0000001C) Timer match event control register                         */

    struct {
      __IOM uint32_t me0_en     : 1;            /*!< [0..0] Counter value match event0 enable control:0: Disable1:
                                                     Enable                                                                    */
      __IOM uint32_t me1_en     : 1;            /*!< [1..1] Counter value match event1 enable control:0: Disable1:
                                                     Enable                                                                    */
      __IOM uint32_t me2_en     : 1;            /*!< [2..2] Counter value match event2 enable control:0: Disable1:
                                                     Enable                                                                    */
      __IOM uint32_t me3_en     : 1;            /*!< [3..3] Counter value match event3 enable control:0: Disable1:
                                                     Enable                                                                    */
            uint32_t            : 28;
    } mectrl_b;
  } ;

  union {
    __IOM uint32_t me0;                         /*!< (@ 0x00000020) Timer match event0 counter register                        */

    struct {
      __IOM uint32_t me0        : 32;           /*!< [31..0] Timer counter value for metch event0.                             */
    } me0_b;
  } ;

  union {
    __IOM uint32_t me1;                         /*!< (@ 0x00000024) Timer match event1 counter register                        */

    struct {
      __IOM uint32_t me1        : 32;           /*!< [31..0] Timer counter value for metch event1.                             */
    } me1_b;
  } ;

  union {
    __IOM uint32_t me2;                         /*!< (@ 0x00000028) Timer match event2 counter register                        */

    struct {
      __IOM uint32_t me2        : 32;           /*!< [31..0] Timer counter value for metch event2.                             */
    } me2_b;
  } ;

  union {
    __IOM uint32_t me3;                         /*!< (@ 0x0000002C) Timer match event3 counter register                        */

    struct {
      __IOM uint32_t me3        : 32;           /*!< [31..0] Timer counter value for metch event3.                             */
    } me3_b;
  } ;
} TM_Type;                                     /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real Time Clock (RTC) (RTC)
  */

typedef struct {                                /*!< (@ 0x4000A400) RTC Structure                                              */

  union {
    __IOM uint32_t cmd;                         /*!< (@ 0x00000000) REG_AON_LSFIF_CMD                                          */

