Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IM  uint32_t pwm_en_sts : 12;           /*!< [11..0] Each bit indicates the enabling status of corresponding
                                                     PWM:0: the specific PWM is Disabled1: the specific PWM
                                                     is Enabled                                                                */
            uint32_t            : 20;
    } enable_status_b;
  } ;

  union {
    __IOM uint32_t enable_ctrl;                 /*!< (@ 0x00000004) PWM enable Register                                        */

    struct {
      __IOM uint32_t pwm_en     : 12;           /*!< [11..0] Each bit is used to enablel the corresponding PWM function:When
                                                     wrote 0: No operation1: the specific PWM is enabled and
                                                     the specific bit of REG_PWM_EN_STS is ONE.                                */
            uint32_t            : 20;
    } enable_ctrl_b;
  } ;

  union {
    __IOM uint32_t disable_ctrl;                /*!< (@ 0x00000008) PWM disable Register                                       */

    struct {
      __IOM uint32_t pwm_dis    : 12;           /*!< [11..0] Each bit is used to disable the corresponding PW6M function:When
                                                     wrote 0: No operation1: the conrtolled PWM is disabled
                                                     and the specific bit of REG_PWM_EN_STS is ZERO.                           */
            uint32_t            : 20;
    } disable_ctrl_b;
  } ;

  union {
    __IOM uint32_t int_status;                  /*!< (@ 0x0000000C) PWM Interrupt Status Register                              */

    struct {
      __IOM uint32_t duty_adj_dn_lim : 8;       /*!< [7..0] To indicate the interrupt pending status for PWM 0 ~
                                                     7 duty auto-adjustment reaches the down-limit.Write 1 clear.
                                                     Bit 0 for PWM0, bit 1 for PWM1, ...bit7 for PWM7.                         */
            uint32_t            : 8;
      __IOM uint32_t duty_adj_up_lim : 8;       /*!< [23..16] To indicate the interrupt pending status for PWM 0
                                                     ~ 7 duty auto-adjustment reaches the up-limit.Write 1 clear.
                                                     Bit 16 for PWM0, bit 17 for PWM1, ...bit23 for PWM7.                      */
      __IOM uint32_t period_end : 8;            /*!< [31..24] This bits are used to indicate the interrupt pending
                                                     status for PWM 0 ~7 period end. Write 1 clear. Bit 24 for
                                                     PWM0, bit 25 for PWM1, ...bit31 for PWM7.                                 */
    } int_status_b;
  } ;

  union {
    __IOM uint32_t int_status1;                 /*!< (@ 0x00000010) PWM Interrupt Status1 Register                             */

    struct {
      __IOM uint32_t duty_adj_dn_lim : 4;       /*!< [3..0] To indicate the interrupt pending status for PWM 8 ~
                                                     B duty auto-adjustment reaches the down-limit.Write 1 clear.
                                                     Bit 0 for PWM8, bit 1 for PWM9, ...bit3 for PWMB.                         */
            uint32_t            : 12;
      __IOM uint32_t duty_adj_up_lim : 4;       /*!< [19..16] To indicate the interrupt pending status for PWM 8
                                                     ~ B duty auto-adjustment reaches the up-limit.Write 1 clear.
                                                     Bit 16 for PWM8, bit 17 for PWM9, ...bit19 for PWMB.                      */
            uint32_t            : 8;
      __IOM uint32_t period_end : 4;            /*!< [31..28] This bits are used to indicate the interrupt pending
                                                     status for PWM 8 ~B period end. Write 1 clear. Bit 24 for
                                                     PWM8, bit 25 for PWM1, ...bit27 for PWMB.                                 */
    } int_status1_b;
  } ;

  union {
    __IOM uint32_t indread_idx;                 /*!< (@ 0x00000014) PWM Index of Indirect Read Register                        */

    struct {
      __IOM uint32_t pwm_sel    : 4;            /*!< [3..0] This field is used to assign the PWM index (0 ~ 7) for
                                                     the auto adjusted duty size indirect reading.                             */
      __IOM uint32_t sync_mode  : 1;            /*!< [4..4] Register sync mode selection for PWM clock and APB clock0:
                                                     Freq. of APB clock >> Freq. of PWM clock (about 10 times)1:
                                                     Freq. of PWM clock >= Freq. of APB clock                                  */
            uint32_t            : 2;
      __IOM uint32_t pool       : 1;            /*!< [7..7] Set this bit to enable indirect read current value of
                                                     timer selected by BIT_PWM_INDREAD_IDX. This bit is cleared
                                                     by HW when reading is finished and indicates REG_PERI_PWM_INDREAD_DUTY
                                                     is ready.                                                                 */
            uint32_t            : 24;
    } indread_idx_b;
  } ;

  union {
    __IOM uint32_t indread_duty;                /*!< (@ 0x00000018) PWM Auto Adjusted Duty Indirect Read Register              */

    struct {
      __IOM uint32_t pwm_duty   : 12;           /*!< [11..0] This field is used to read the auto adjusted duty size
                                                     of the PWM which is assigned by the pwm_sel. The SW should
                                                     assign the PWM to read by write the pwm_sel and then read
                                                     this field to get the current duty size of the specified
                                                     PWM.                                                                      */
            uint32_t            : 20;
    } indread_duty_b;
  } ;

  union {
    __IOM uint32_t complementary;               /*!< (@ 0x0000001C) PWM Complementary Register                                 */

