Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t pwm_comp_en : 6;           /*!< [5..0] Enable/Disable PWM Complementary mode. Bit 0 for PWM0_1,
                                                     bit 1 for PWM2_3..bit 5 for PWMA_B                                        */
      __IOM uint32_t pwm_db     : 24;           /*!< [29..6] To indicate the amount of delay. Delay time = (1/Sclk)*PWMX_Y_DB.
                                                     Bit 6~9 for PWM0_1_DB, bit 10~13 for PWM2_3_DB.. Bit 26~29
                                                     for PWMA_B_DB                                                             */
            uint32_t            : 2;
    } complementary_b;
  } ;
} PWM_COMM_Type;                                /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                           PWM0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Pulse Width Modulation 0 (PWM0)
  */

typedef struct {                                /*!< (@ 0x40045020) PWM0 Structure                                             */

  union {
    __IOM uint32_t ctrl;                        /*!< (@ 0x00000000) PWM Control Register                                       */

    struct {
      __IOM uint32_t duty       : 12;           /*!< [11..0] The on-duty duration of PWM pulse. The time unit is
                                                     configured by the GTIMER which is specified by clk_sel
                                                     field. It can be written at any time, but HW will apply
                                                     the changing at PWM enable time or at the end of PWM period.              */
      __IOM uint32_t clk_sel    : 4;            /*!< [15..12] The tick source selection, G-timer 0 ~ 7 or SClk:0:
                                                     GTIMER 01: GTIMER 1...7: GTIMER 78: sclk                                  */
      __IM  uint32_t cur_duty   : 12;           /*!< [27..16] The current duty size which is adjusted by the duty
                                                     auto-adjustment HW. The SW can read this field to know
                                                     the current duty size. However, the latest duty size may
                                                     not be sync to this field on time or the value may transition
                                                     while the SW is reading this field. So use in-direct read
                                                     method to read the duty size is more save and is suggested.               */
      __IOM uint32_t period_ie  : 1;            /*!< [28..28] This bit control the PWM period end interrupt enable
                                                     (1) or disable (0). When the PWM period end interrupt is
                                                     enabled, the PWM HW will assert the interrupt on every
                                                     PWM period end time. This interrupt status can be read
                                                     from pwm_int_status.                                                      */
      __IM  uint32_t run_sts    : 1;            /*!< [29..29] The PWM output running status:0: PWM output is paused1:
                                                     the PWM output is running.                                                */
      __IOM uint32_t pause      : 1;            /*!< [30..30] The paus control:0: Normal running1: To pause the PWM
                                                     out at current PWM period end. Since the PWM output is
                                                     not stopped immediately, the software can poll the BIT_PERI_PWMx_RUNSTS
                                                     to know the PWM out is still running or is paused.                        */
      __IOM uint32_t ctrl_set   : 1;            /*!< [31..31] SW can change setting only at ctrl_set = 0, and set
                                                     ctrl_set = 1 after changing PWM Ctrl. HW will clear ctrl_set
                                                     bit after changing PWM Ctrl.PS. If this PWM is disabled
                                                     (PWMx_EN=0), the HW will not clear this bit.PS. if this
                                                     bit is asserted and the duty auto adjustment is enabled,
                                                     when the PWM is enabled the HW will updates its duty at
                                                     the 1st PWM period and then start the duty adjustment at
                                                     2nd PWM period.                                                           */
    } ctrl_b;
  } ;

  union {
    __IOM uint32_t timing_ctrl;                 /*!< (@ 0x00000004) PWM Timing Control Register                                */

    struct {
      __IOM uint32_t period     : 12;           /*!< [11..0] The period of PWM pulse. The time unit is configured
                                                     by the GTIMER which is specified by the clk_sel field.
                                                     It can be written at any time, but the HW will apply the
                                                     changing at PWM enable time or at the end of PWM period.                  */
            uint32_t            : 4;
      __IOM uint32_t duty_start : 12;           /*!< [27..16] The start of ON duration of PWM pulse in the period.
                                                     The time unit is the same as PWM period.It can be written
                                                     at any time, but HW change setting only at PWM enable and
                                                     the end of period.                                                        */
            uint32_t            : 4;
    } timing_ctrl_b;
  } ;

  union {
    __IOM uint32_t auto_adj_ctrl;               /*!< (@ 0x00000008) PWM Duty Auto Adjustment Control Register                  */

