Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t duty_dec_step : 10;        /*!< [9..0] The Duty Decreasing Step size of the Duty Auto Adjustment.         */
            uint32_t            : 2;
      __IOM uint32_t duty_inc_step : 10;        /*!< [21..12] The Duty Increasing Step size of the Duty Auto Adjustment        */
            uint32_t            : 5;
      __IOM uint32_t duty_dn_lim_ie : 1;        /*!< [27..27] This bit is used to enable the Interrupt of the Duty
                                                     Auto Adjustment.0: Disable1: EnableIf the Interrupt is
                                                     enabled, issue an interrupt when the Adjusted Duty reach
                                                     the Down Limit.                                                           */
      __IOM uint32_t duty_up_lim_ie : 1;        /*!< [28..28] This bit is used to enable the Interrupt of the Duty
                                                     Auto Adjustment.0: Disable1: EnableIf the Interrupt is
                                                     enabled, issue an interrupt when the Adjusted Duty reach
                                                     the Up Limit.                                                             */
      __IOM uint32_t adj_loop_en : 1;           /*!< [29..29] This bit is used to enable the Duty Auto Adjustment
                                                     Loop mode.0: Disable1: EnableIf the Loop Mode is enabled,
                                                     reverse the Duty Auto Adjustment direction when the adjusted
                                                     Duty reach the Up Limit or the Down Limit.                                */
      __IOM uint32_t adj_dir    : 1;            /*!< [30..30] This bit is used to set the Duty Ato Adjustment direction.0:
                                                     Decrease Duty1: Increase Duty                                             */
      __IOM uint32_t adj_en     : 1;            /*!< [31..31] This bit is used to enable the Duty Ato Adjustment.0:
                                                     Disable1: EnablePS. If this bit is 1, the duty of the auto
                                                     adjustment will override the duty setting in the pwm_ctrl
                                                     register.                                                                 */
    } auto_adj_ctrl_b;
  } ;

  union {
    __IOM uint32_t auto_adj_limit;              /*!< (@ 0x0000000C) PWM Duty Auto Adjustment Limit Register                    */

    struct {
      __IOM uint32_t duty_adj_dn_lim : 12;      /*!< [11..0] The down limit (in ticks) of the duty period for the
                                                     duty ratio auto adjustment                                                */
            uint32_t            : 4;
      __IOM uint32_t duty_adj_up_lim : 12;      /*!< [27..16] The up limit of the duty period for the duty ratio
                                                     auto adjustment                                                           */
            uint32_t            : 4;
    } auto_adj_limit_b;
  } ;

  union {
    __IOM uint32_t auto_adj_cycle;              /*!< (@ 0x00000010) PWM Duty Auto Adjustment Cycle Count Register              */

    struct {
      __IOM uint32_t adj_cycles : 12;           /*!< [11..0] The Cycle Count of the Duty Auto Adjustment.The Duty
                                                     size will be increased/decreased with a step size every
                                                     Cycle Count of PWM period                                                 */
            uint32_t            : 20;
    } auto_adj_cycle_b;
  } ;

  union {
    __IOM uint32_t out_dma;                     /*!< (@ 0x00000014) PWMx Output DMA Mode Register                              */

    struct {
      __IOM uint32_t chg_duty   : 1;            /*!< [0..0] 1: this parameter defines to update PWM duty register
                                                     for each period-end interrupt. 0: no update.                              */
      __IOM uint32_t chg_period : 1;            /*!< [1..1] 1: this parameter defines to update PWM period register
                                                     for each period-end interrupt. 0: no update.                              */
      __IOM uint32_t dma_mode   : 1;            /*!< [2..2] 1 : Enable, 0: Disable DMA Mode.                                   */
            uint32_t            : 29;
    } out_dma_b;
  } ;

  union {
    __IOM uint32_t dma_buff;                    /*!< (@ 0x00000018) BIT_DMA_BUFF                                               */

    struct {
      __IOM uint32_t buff       : 32;           /*!< [31..0] Data register for DMA mode.                                       */
    } dma_buff_b;
  } ;
} PWM_Type;                                    /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPIC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SPI Controller to control 4IO DTR Flash (SPIC)
  */

typedef struct {                                /*!< (@ 0x40006000) SPIC Structure                                             */

  union {
    __IOM uint32_t ctrlr0;                      /*!< (@ 0x00000000) SPIC Control Register 0                                    */

    struct {
            uint32_t            : 6;
      __IOM uint32_t scph       : 1;            /*!< [6..6] RSVD                                                               */
      __IOM uint32_t scpol      : 1;            /*!< [7..7] RSVD                                                               */
      __IOM uint32_t tmod       : 2;            /*!< [9..8] RSVD                                                               */
            uint32_t            : 6;
      __IOM uint32_t addr_ch    : 2;            /*!< [17..16] RSVD                                                             */
      __IOM uint32_t data_ch    : 2;            /*!< [19..18] RSVD                                                             */
      __IOM uint32_t cmd_ch     : 2;            /*!< [21..20] RSVD                                                             */
      __IOM uint32_t fast_rd    : 1;            /*!< [22..22] RSVD                                                             */
      __IOM uint32_t ck_mtimes  : 5;            /*!< [27..23] RSVD                                                             */
      __IOM uint32_t addr_ddr_en : 1;           /*!< [28..28] RSVD                                                             */
      __IOM uint32_t data_ddr_en : 1;           /*!< [29..29] RSVD                                                             */
      __IOM uint32_t cmd_ddr_en : 1;            /*!< [30..30] RSVD                                                             */
      __IOM uint32_t prm_2nd_phase : 1;         /*!< [31..31] RSVD                                                             */
    } ctrlr0_b;
  } ;

  union {
    __IOM uint32_t ctrlr1;                      /*!< (@ 0x00000004) SPIC Control Register 1                                    */

