Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t ndf        : 12;           /*!< [11..0] RSVD                                                              */
            uint32_t            : 20;
    } ctrlr1_b;
  } ;

  union {
    __IOM uint32_t ssienr;                      /*!< (@ 0x00000008) SPIC Enable Register                                       */

    struct {
      __IOM uint32_t spic_en    : 1;            /*!< [0..0] RSVD                                                               */
      __OM  uint32_t atck_cmd   : 1;            /*!< [1..1] RSVD                                                               */
            uint32_t            : 30;
    } ssienr_b;
  } ;
  __IOM uint32_t  RSVD;                         /*!< (@ 0x0000000C) RSVD                                                       */

  union {
    __IOM uint32_t ser;                         /*!< (@ 0x00000010) Slave Enable Register                                      */

    struct {
      __IOM uint32_t ser        : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } ser_b;
  } ;

  union {
    __IOM uint32_t baudr;                       /*!< (@ 0x00000014) Baud Rate Select Register                                  */

    struct {
      __IOM uint32_t sckdv      : 12;           /*!< [11..0] RSVD                                                              */
            uint32_t            : 20;
    } baudr_b;
  } ;

  union {
    __IOM uint32_t txftlr;                      /*!< (@ 0x00000018) Transmit FIFO Threshold Level                              */

    struct {
      __IOM uint32_t tft        : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } txftlr_b;
  } ;

  union {
    __IOM uint32_t rxftlr;                      /*!< (@ 0x0000001C) Receive FIFO Threshold Level                               */

    struct {
      __IOM uint32_t rft        : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } rxftlr_b;
  } ;

  union {
    __IM  uint32_t txflr;                       /*!< (@ 0x00000020) Transmit FIFO Level Register                               */

    struct {
      __IM  uint32_t txtfl      : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } txflr_b;
  } ;

  union {
    __IM  uint32_t rxflr;                       /*!< (@ 0x00000024) Receive FIFO Level Register                                */

    struct {
      __IM  uint32_t rxtfl      : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } rxflr_b;
  } ;

  union {
    __IM  uint32_t sr;                          /*!< (@ 0x00000028) Status Register                                            */

    struct {
      __IM  uint32_t busy       : 1;            /*!< [0..0] RSVD                                                               */
      __IM  uint32_t tfnf       : 1;            /*!< [1..1] RSVD                                                               */
      __IM  uint32_t tfe        : 1;            /*!< [2..2] RSVD                                                               */
      __IM  uint32_t rfne       : 1;            /*!< [3..3] RSVD                                                               */
      __IM  uint32_t rff        : 1;            /*!< [4..4] RSVD                                                               */
      __IM  uint32_t txe        : 1;            /*!< [5..5] RSVD                                                               */
      __IM  uint32_t dcol       : 1;            /*!< [6..6] RSVD                                                               */
            uint32_t            : 25;
    } sr_b;
  } ;

  union {
    __IOM uint32_t imr;                         /*!< (@ 0x0000002C) Interrupt Mask Register                                    */

    struct {
      __IOM uint32_t txeim      : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t txoim      : 1;            /*!< [1..1] RSVD                                                               */
      __IOM uint32_t rxuim      : 1;            /*!< [2..2] RSVD                                                               */
      __IOM uint32_t rxoim      : 1;            /*!< [3..3] RSVD                                                               */
      __IOM uint32_t rxfim      : 1;            /*!< [4..4] RSVD                                                               */
      __IOM uint32_t fseim      : 1;            /*!< [5..5] RSVD                                                               */
      __IOM uint32_t wbeim      : 1;            /*!< [6..6] RSVD                                                               */
      __IOM uint32_t byeim      : 1;            /*!< [7..7] RSVD                                                               */
      __IOM uint32_t aceim      : 1;            /*!< [8..8] RSVD                                                               */
      __IOM uint32_t txsim      : 1;            /*!< [9..9] RSVD                                                               */
            uint32_t            : 22;
    } imr_b;
  } ;

  union {
    __IM  uint32_t isr;                         /*!< (@ 0x00000030) Interrupt Status Register                                  */

    struct {
      __IM  uint32_t txeis      : 1;            /*!< [0..0] RSVD                                                               */
      __IM  uint32_t txois      : 1;            /*!< [1..1] RSVD                                                               */
      __IM  uint32_t rxuis      : 1;            /*!< [2..2] RSVD                                                               */
      __IM  uint32_t rxois      : 1;            /*!< [3..3] RSVD                                                               */
      __IM  uint32_t rxfis      : 1;            /*!< [4..4] RSVD                                                               */
      __IM  uint32_t fseis      : 1;            /*!< [5..5] RSVD                                                               */
      __IM  uint32_t wbeis      : 1;            /*!< [6..6] RSVD                                                               */
      __IM  uint32_t byeis      : 1;            /*!< [7..7] RSVD                                                               */
      __IM  uint32_t aceis      : 1;            /*!< [8..8] RSVD                                                               */
      __IM  uint32_t txsis      : 1;            /*!< [9..9] RSVD                                                               */
      __IM  uint32_t rxsis      : 1;            /*!< [10..10] RSVD                                                             */
            uint32_t            : 21;
    } isr_b;
  } ;

  union {
    __IM  uint32_t risr;                        /*!< (@ 0x00000034) Raw Interrupt Status Register                              */

