Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IM  uint32_t txeir      : 1;            /*!< [0..0] RSVD                                                               */
      __IM  uint32_t txoir      : 1;            /*!< [1..1] RSVD                                                               */
      __IM  uint32_t rxuir      : 1;            /*!< [2..2] RSVD                                                               */
      __IM  uint32_t rxoir      : 1;            /*!< [3..3] RSVD                                                               */
      __IM  uint32_t rxfir      : 1;            /*!< [4..4] RSVD                                                               */
      __IM  uint32_t fseir      : 1;            /*!< [5..5] RSVD                                                               */
      __IM  uint32_t wbeir      : 1;            /*!< [6..6] RSVD                                                               */
      __IM  uint32_t byeir      : 1;            /*!< [7..7] RSVD                                                               */
      __IM  uint32_t aceir      : 1;            /*!< [8..8] RSVD                                                               */
            uint32_t            : 23;
    } risr_b;
  } ;

  union {
    __IM  uint32_t txoicr;                      /*!< (@ 0x00000038) Transmit FIFO Overflow Interrupt Clear Register            */

    struct {
      __IM  uint32_t txoicr     : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } txoicr_b;
  } ;

  union {
    __IM  uint32_t rxoicr;                      /*!< (@ 0x0000003C) Receive FIFO Overflow Interrupt Clear Register             */

    struct {
      __IM  uint32_t rxoicr     : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } rxoicr_b;
  } ;

  union {
    __IM  uint32_t rxuicr;                      /*!< (@ 0x00000040) Receive FIFO Underflow Interrupt Clear Register            */

    struct {
      __IM  uint32_t rxuicr     : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } rxuicr_b;
  } ;

  union {
    __IM  uint32_t faeicr;                      /*!< (@ 0x00000044) Frame Alignment Interrupt Clear Register                   */

    struct {
      __IM  uint32_t faeicr     : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } faeicr_b;
  } ;

  union {
    __IM  uint32_t icr;                         /*!< (@ 0x00000048) Interrupt Clear Register                                   */

    struct {
      __IM  uint32_t icr        : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } icr_b;
  } ;

  union {
    __IOM uint32_t dmacr;                       /*!< (@ 0x0000004C) DMA Control Register                                       */

    struct {
      __IOM uint32_t rx_dmac_en : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t tx_dmac_en : 1;            /*!< [1..1] RSVD                                                               */
            uint32_t            : 30;
    } dmacr_b;
  } ;

  union {
    __IOM uint32_t dmatdlr;                     /*!< (@ 0x00000050) DMA Transmit Data Level Register                           */

    struct {
      __IOM uint32_t dmatdl     : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } dmatdlr_b;
  } ;

  union {
    __IOM uint32_t dmardlr;                     /*!< (@ 0x00000054) DMA Receive Data Level Register                            */

    struct {
      __IOM uint32_t dmardl     : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } dmardlr_b;
  } ;

  union {
    __IM  uint32_t idr;                         /*!< (@ 0x00000058) Identification Code Register                               */

    struct {
      __IM  uint32_t idcode     : 32;           /*!< [31..0] RSVD                                                              */
    } idr_b;
  } ;

  union {
    __IM  uint32_t spic_ver;                    /*!< (@ 0x0000005C) SPIC Version Register                                      */

    struct {
      __IM  uint32_t spic_version : 32;         /*!< [31..0] RSVD                                                              */
    } spic_ver_b;
  } ;

  union {
    union {
      __IOM uint32_t dr_word;                   /*!< (@ 0x00000060) Data Register                                              */

      struct {
        __IOM uint32_t word     : 32;           /*!< [31..0] RSVD                                                              */
      } dr_word_b;
    } ;

    union {
      __IOM uint16_t dr_half_word;              /*!< (@ 0x00000060) Data Register                                              */

      struct {
        __IOM uint16_t half_word : 16;          /*!< [15..0] RSVD                                                              */
      } dr_half_word_b;
    } ;

    union {
      __IOM uint8_t dr_byte;                    /*!< (@ 0x00000060) Data Register                                              */

      struct {
        __IOM uint8_t byte      : 8;            /*!< [7..0] RSVD                                                               */
      } dr_byte_b;
    } ;
  };
  __IM  uint32_t  RESERVED[31];

  union {
    __IOM uint32_t read_fast_single;            /*!< (@ 0x000000E0) Fast Read Command Register                                 */

    struct {
      __IOM uint32_t frd_cmd    : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } read_fast_single_b;
  } ;

  union {
    __IOM uint32_t read_dual_data;              /*!< (@ 0x000000E4) Dual Read Command Register                                 */

