Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t rd_dual_o_cmd : 8;         /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } read_dual_data_b;
  } ;

  union {
    __IOM uint32_t read_dual_addr_data;         /*!< (@ 0x000000E8) Dual IO Read Command Register                              */

    struct {
      __IOM uint32_t rd_dual_io_cmd : 8;        /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } read_dual_addr_data_b;
  } ;

  union {
    __IOM uint32_t read_quad_data;              /*!< (@ 0x000000EC) Quad Read Command Register                                 */

    struct {
      __IOM uint32_t rd_quad_o_cmd : 8;         /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } read_quad_data_b;
  } ;

  union {
    __IOM uint32_t read_quad_addr_data;         /*!< (@ 0x000000F0) Quad IO Read Command Register                              */

    struct {
      __IOM uint32_t rd_quad_io_cmd : 8;        /*!< [7..0] RSVD                                                               */
            uint32_t            : 8;
      __IOM uint32_t prm_value  : 8;            /*!< [23..16] RSVD                                                             */
            uint32_t            : 8;
    } read_quad_addr_data_b;
  } ;

  union {
    __IOM uint32_t write_single;                /*!< (@ 0x000000F4) Single IO Page Program Command Register                    */

    struct {
      __IOM uint32_t wr_cmd     : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } write_single_b;
  } ;

  union {
    __IOM uint32_t write_dual_data;             /*!< (@ 0x000000F8) Dual Page Program Command Register                         */

    struct {
      __IOM uint32_t rd_dual_io_cmd : 8;        /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } write_dual_data_b;
  } ;

  union {
    __IOM uint32_t write_dual_addr_data;        /*!< (@ 0x000000FC) Dual IO Page Program Command Register                      */

    struct {
      __IOM uint32_t wr_dual_ii_cmd : 8;        /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } write_dual_addr_data_b;
  } ;

  union {
    __IOM uint32_t write_quad_data;             /*!< (@ 0x00000100) Quad Page Program Command Register                         */

    struct {
      __IOM uint32_t wr_quad_i_cmd : 8;         /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } write_quad_data_b;
  } ;

  union {
    __IOM uint32_t write_quad_addr_data;        /*!< (@ 0x00000104) Quad IO Page Program Command Register                      */

    struct {
      __IOM uint32_t wr_quad_ii_cmd : 8;        /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } write_quad_addr_data_b;
  } ;

  union {
    __IOM uint32_t write_enable;                /*!< (@ 0x00000108) Write Enable Command Register                              */

    struct {
      __IOM uint32_t wr_en_cmd  : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } write_enable_b;
  } ;

  union {
    __IOM uint32_t read_status;                 /*!< (@ 0x0000010C) Read Status Command Register                               */

    struct {
      __IOM uint32_t rd_st_cmd  : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } read_status_b;
  } ;

  union {
    __IOM uint32_t ctrlr2;                      /*!< (@ 0x00000110) SPIC Control Register 2                                    */

    struct {
      __IOM uint32_t so_dnum    : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 2;
      __IOM uint32_t seq_en     : 1;            /*!< [3..3] RSVD                                                               */
      __IOM uint32_t tx_fifo_entry : 4;         /*!< [7..4] RSVD                                                               */
      __IOM uint32_t rx_fifo_entry : 4;         /*!< [11..8] RSVD                                                              */
      __IOM uint32_t cs_active_hold : 2;        /*!< [13..12] RSVD                                                             */
            uint32_t            : 18;
    } ctrlr2_b;
  } ;

  union {
    __IOM uint32_t fbaudr;                      /*!< (@ 0x00000114) Fast Read Baud Rate Select Register                        */

    struct {
      __IOM uint32_t fsckdv     : 12;           /*!< [11..0] RSVD                                                              */
            uint32_t            : 20;
    } fbaudr_b;
  } ;

  union {
    __IOM uint32_t addr_length;                 /*!< (@ 0x00000118) Address Byte Length Register                               */

    struct {
      __IOM uint32_t addr_phase_length : 3;     /*!< [2..0] RSVD                                                               */
            uint32_t            : 29;
    } addr_length_b;
  } ;

  union {
    __IOM uint32_t auto_length;                 /*!< (@ 0x0000011C) Auto Mode Address Byte Length Register                     */

    struct {
      __IOM uint32_t rd_dummy_length : 12;      /*!< [11..0] RSVD                                                              */
            uint32_t            : 4;
      __IOM uint32_t auto_addr_length : 2;      /*!< [17..16] RSVD                                                             */
      __IOM uint32_t auto_dum_len : 8;          /*!< [25..18] RSVD                                                             */
      __IOM uint32_t cs_h_rd_dum_len : 2;       /*!< [27..26] RSVD                                                             */
      __IOM uint32_t cs_h_wr_dum_len : 4;       /*!< [31..28] RSVD                                                             */
    } auto_length_b;
  } ;

  union {
    __IOM uint32_t valid_cmd;                   /*!< (@ 0x00000120) Valid Command Register                                     */

