Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t frd_single : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t rd_dual_i  : 1;            /*!< [1..1] RSVD                                                               */
      __IOM uint32_t rd_dual_io : 1;            /*!< [2..2] RSVD                                                               */
      __IOM uint32_t rd_quad_o  : 1;            /*!< [3..3] RSVD                                                               */
      __IOM uint32_t rd_quad_io : 1;            /*!< [4..4] RSVD                                                               */
      __IOM uint32_t wr_dual_i  : 1;            /*!< [5..5] RSVD                                                               */
      __IOM uint32_t wr_dual_ii : 1;            /*!< [6..6] RSVD                                                               */
      __IOM uint32_t wr_quad_i  : 1;            /*!< [7..7] RSVD                                                               */
      __IOM uint32_t wr_quad_ii : 1;            /*!< [8..8] RSVD                                                               */
      __IOM uint32_t wr_blocking : 1;           /*!< [9..9] RSVD                                                               */
            uint32_t            : 1;
      __IOM uint32_t prm_en     : 1;            /*!< [11..11] RSVD                                                             */
      __IOM uint32_t ctrlr0_ch  : 1;            /*!< [12..12] RSVD                                                             */
            uint32_t            : 19;
    } valid_cmd_b;
  } ;

  union {
    __IOM uint32_t flash_size;                  /*!< (@ 0x00000124) Write Enable Command Register                              */

    struct {
      __IOM uint32_t flash_size : 4;            /*!< [3..0] RSVD                                                               */
            uint32_t            : 28;
    } flash_size_b;
  } ;

  union {
    __IOM uint32_t flush_fifo;                  /*!< (@ 0x00000128) Read Status Command Register                               */

    struct {
      __OM  uint32_t flush_fifio : 1;           /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } flush_fifo_b;
  } ;
} SPIC_Type;                                    /*!< Size = 300 (0x12c)                                                        */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief 8-channel ADC with 12-bit resolution and 250K SPS (ADC)
  */

typedef struct {                                /*!< (@ 0x40010000) ADC Structure                                              */

  union {
    __IOM uint32_t conf;                        /*!< (@ 0x00000000) ADC Configuration Register                                 */

    struct {
      __IOM uint32_t ref_in_sel : 1;            /*!< [0..0] This bit selects ADC reference voltage input.0: ADC's
                                                     reference voltage is from internal source.1: ADC's reference
                                                     voltage is from external pin.                                             */
      __IOM uint32_t op_mod     : 3;            /*!< [3..1] These bits selects ADC operation mode.0: Software Trigger
                                                     Mode1: Automatic Mode2: Timer-Trigger Mode                                */
      __IOM uint32_t cvlist_len : 4;            /*!< [7..4] This field defines the number of items in the ADC conversion
                                                     channel list.0 is for 1 item in list.1 is for 2 items in
                                                     list.                                                                     */
            uint32_t            : 1;
      __IOM uint32_t en         : 1;            /*!< [9..9] This bit is for ADC enable control.                                */
            uint32_t            : 22;
    } conf_b;
  } ;

  union {
    __IOM uint32_t in_type;                     /*!< (@ 0x00000004) ADC Input Type Register                                    */

    struct {
      __IOM uint32_t ch0        : 1;            /*!< [0..0] This bit controls channel 0 input type. If it is set
                                                     to differential type (value of this bit is 1), channel
                                                     1 should also be set to differentail type since they are
                                                     hardware-fixed differentail pair.0: ADC channel 0 is single-end
                                                     input.1: ADC channel 0 is differential input which is paired
                                                     with channel 1.                                                           */
      __IOM uint32_t ch1        : 1;            /*!< [1..1] This bit controls channel 1 input type. If it is set
                                                     to differential type (value of this bit is 1), channel
                                                     0 should also be set to differentail type since they are
                                                     hardware-fixed differentail pair.0: ADC channel 1 is single-end
                                                     input.1: ADC channel 1 is differential input which is paired
                                                     with channel 0.                                                           */
      __IOM uint32_t ch2        : 1;            /*!< [2..2] This bit controls channel 2 input type. If it is set
                                                     to differential type (value of this bit is 1), channel
                                                     3 should also be set to differentail type since they are
                                                     hardware-fixed differentail pair.0: ADC channel 2 is single-end
                                                     input.1: ADC channel 2 is differential input which is paired
                                                     with channel 3.                                                           */
      __IOM uint32_t ch3        : 1;            /*!< [3..3] This bit controls channel 3 input type. If it is set
                                                     to differential type (value of this bit is 1), channel
                                                     2 should also be set to differentail type since they are
                                                     hardware-fixed differentail pair.0: ADC channel 3 is single-end
                                                     input.1: ADC channel 3 is differential input which is paired
                                                     with channel 2.                                                           */
      __IOM uint32_t ch4        : 1;            /*!< [4..4] This bit controls channel 4 input type. If it is set
                                                     to differential type (value of this bit is 1), channel
                                                     5 should also be set to differentail type since they are
                                                     hardware-fixed differentail pair.0: ADC channel 4 is single-end
                                                     input.1: ADC channel 4 is differential input which is paired
                                                     with channel 5.                                                           */
      __IOM uint32_t ch5        : 1;            /*!< [5..5] This bit controls channel 5 input type. If it is set
                                                     to differential type (value of this bit is 1), channel
                                                     4 should also be set to differentail type since they are
                                                     hardware-fixed differentail pair.0: ADC channel 5 is single-end
                                                     input.1: ADC channel 5 is differential input which is paired
                                                     with channel 4.                                                           */
      __IOM uint32_t ch6        : 1;            /*!< [6..6] This bit controls channel 6 input type. If it is set
                                                     to differential type (value of this bit is 1), channel
                                                     7 should also be set to differentail type since they are
                                                     hardware-fixed differentail pair.0: ADC channel 6 is single-end
                                                     input.1: ADC channel 6 is differential input which is paired
                                                     with channel 7.                                                           */
      __IOM uint32_t ch7        : 1;            /*!< [7..7] This bit controls channel 7 input type. If it is set
                                                     to differential type (value of this bit is 1), channel
                                                     6 should also be set to differentail type since they are
                                                     hardware-fixed differentail pair.0: ADC channel 7 is single-end
                                                     input.1: ADC channel 7 is differential input which is paired
                                                     with channel 6.                                                           */
            uint32_t            : 24;
    } in_type_b;
  } ;

  union {
    __IOM uint32_t comp_th_ch0;                 /*!< (@ 0x00000008) ADC Channel 0 Comparison Threshold Register                */

