Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t th_l       : 16;           /*!< [15..0] This field defines the lower threshold of channel 0
                                                     for ADC automatic comparison.                                             */
      __IOM uint32_t th_h       : 16;           /*!< [31..16] This field defines the higher threshold of channel
                                                     0 for ADC automatic comparison.                                           */
    } comp_th_ch0_b;
  } ;

  union {
    __IOM uint32_t comp_th_ch1;                 /*!< (@ 0x0000000C) ADC Channel 1 Comparison Threshold Register                */

    struct {
      __IOM uint32_t th_l       : 16;           /*!< [15..0] This field defines the lower threshold of channel 1
                                                     for ADC automatic comparison.                                             */
      __IOM uint32_t th_h       : 16;           /*!< [31..16] This field defines the higher threshold of channel
                                                     1 for ADC automatic comparison.                                           */
    } comp_th_ch1_b;
  } ;

  union {
    __IOM uint32_t comp_th_ch2;                 /*!< (@ 0x00000010) ADC Channel 2 Comparison Threshold Register                */

    struct {
      __IOM uint32_t th_l       : 16;           /*!< [15..0] This field defines the lower threshold of channel 2
                                                     for ADC automatic comparison.                                             */
      __IOM uint32_t th_h       : 16;           /*!< [31..16] This field defines the higher threshold of channel
                                                     2 for ADC automatic comparison.                                           */
    } comp_th_ch2_b;
  } ;

  union {
    __IOM uint32_t comp_th_ch3;                 /*!< (@ 0x00000014) ADC Channel 3 Comparison Threshold Register                */

    struct {
      __IOM uint32_t th_l       : 16;           /*!< [15..0] This field defines the lower threshold of channel 3
                                                     for ADC automatic comparison.                                             */
      __IOM uint32_t th_h       : 16;           /*!< [31..16] This field defines the higher threshold of channel
                                                     3 for ADC automatic comparison.                                           */
    } comp_th_ch3_b;
  } ;

  union {
    __IOM uint32_t comp_th_ch4;                 /*!< (@ 0x00000018) ADC Channel 4 Comparison Threshold Register                */

    struct {
      __IOM uint32_t th_l       : 16;           /*!< [15..0] This field defines the lower threshold of channel 4
                                                     for ADC automatic comparison.                                             */
      __IOM uint32_t th_h       : 16;           /*!< [31..16] This field defines the higher threshold of channel
                                                     4 for ADC automatic comparison.                                           */
    } comp_th_ch4_b;
  } ;

  union {
    __IOM uint32_t comp_th_ch5;                 /*!< (@ 0x0000001C) ADC Channel 5 Comparison Threshold Register                */

    struct {
      __IOM uint32_t th_l       : 16;           /*!< [15..0] This field defines the lower threshold of channel 5
                                                     for ADC automatic comparison.                                             */
      __IOM uint32_t th_h       : 16;           /*!< [31..16] This field defines the higher threshold of channel
                                                     5 for ADC automatic comparison.                                           */
    } comp_th_ch5_b;
  } ;

  union {
    __IOM uint32_t comp_th_ch6;                 /*!< (@ 0x00000020) ADC Channel 6 Comparison Threshold Register                */

    struct {
      __IOM uint32_t th_l       : 16;           /*!< [15..0] This field defines the lower threshold of channel 6
                                                     for ADC automatic comparison.                                             */
      __IOM uint32_t th_h       : 16;           /*!< [31..16] This field defines the higher threshold of channel
                                                     6 for ADC automatic comparison.                                           */
    } comp_th_ch6_b;
  } ;

  union {
    __IOM uint32_t comp_th_ch7;                 /*!< (@ 0x00000024) ADC Channel 7 Comparison Threshold Register                */

    struct {
      __IOM uint32_t th_l       : 16;           /*!< [15..0] This field defines the lower threshold of channel 7
                                                     for ADC automatic comparison.                                             */
      __IOM uint32_t th_h       : 16;           /*!< [31..16] This field defines the higher threshold of channel
                                                     7 for ADC automatic comparison.                                           */
    } comp_th_ch7_b;
  } ;

  union {
    __IOM uint32_t comp_ctrl;                   /*!< (@ 0x00000028) ADC Comparison Control Register                            */

    struct {
      __IOM uint32_t ch0        : 2;            /*!< [1..0] This field defines ADC channel comparison criteria which
                                                     would notify system by interrupt when the criterion matches.
                                                     Once a criterion matches, ADC should send an interrupt
                                                     signal to system if the related interrupt mask is unmask.
                                                     ADC also updates comparison results in REG_ADC_COMP_STS.0:
                                                     When Vin < BIT_ADC_COMP_TH_L_CH0, comparison criterion
                                                     matches.1: When Vin > BIT_ADC_COMP_TH_H_CH0, comparison
                                                     criterion matches.2: When Vin >= BIT_ADC_COMP_TH_L_CH0
                                                     and Vin <= BIT_ADC_COMP_TH_H_CH0, comparison crit                         */
      __IOM uint32_t ch1        : 2;            /*!< [3..2] This field defines ADC channel comparison criteria which
                                                     would notify system by interrupt when the criterion matches.
                                                     Once a criterion matches, ADC should send an interrupt
                                                     signal to system if the related interrupt mask is unmask.
                                                     ADC also updates comparison results in REG_ADC_COMP_STS.0:
                                                     When Vin < BIT_ADC_COMP_TH_L_CH1, comparison criterion
                                                     matches.1: When Vin > BIT_ADC_COMP_TH_H_CH1, comparison
                                                     criterion matches.2: When Vin >= BIT_ADC_COMP_TH_L_CH1
                                                     and Vin <= BIT_ADC_COMP_TH_H_CH1, comparison crit                         */
      __IOM uint32_t ch2        : 2;            /*!< [5..4] This field defines ADC channel comparison criteria which
                                                     would notify system by interrupt when the criterion matches.
                                                     Once a criterion matches, ADC should send an interrupt
                                                     signal to system if the related interrupt mask is unmask.
                                                     ADC also updates comparison results in REG_ADC_COMP_STS.0:
                                                     When Vin < BIT_ADC_COMP_TH_L_CH2, comparison criterion
                                                     matches.1: When Vin > BIT_ADC_COMP_TH_H_CH2, comparison
                                                     criterion matches.2: When Vin >= BIT_ADC_COMP_TH_L_CH2
                                                     and Vin <= BIT_ADC_COMP_TH_H_CH2, comparison crit                         */
      __IOM uint32_t ch3        : 2;            /*!< [7..6] This field defines ADC channel comparison criteria which
                                                     would notify system by interrupt when the criterion matches.
                                                     Once a criterion matches, ADC should send an interrupt
                                                     signal to system if the related interrupt mask is unmask.
                                                     ADC also updates comparison results in REG_ADC_COMP_STS.0:
                                                     When Vin < BIT_ADC_COMP_TH_L_CH3, comparison criterion
                                                     matches.1: When Vin > BIT_ADC_COMP_TH_H_CH3, comparison
                                                     criterion matches.2: When Vin >= BIT_ADC_COMP_TH_L_CH3
                                                     and Vin <= BIT_ADC_COMP_TH_H_CH3, comparison crit                         */
      __IOM uint32_t ch4        : 2;            /*!< [9..8] This field defines ADC channel comparison criteria which
                                                     would notify system by interrupt when the criterion matches.
                                                     Once a criterion matches, ADC should send an interrupt
                                                     signal to system if the related interrupt mask is unmask.
                                                     ADC also updates comparison results in REG_ADC_COMP_STS.0:
                                                     When Vin < BIT_ADC_COMP_TH_L_CH4, comparison criterion
                                                     matches.1: When Vin > BIT_ADC_COMP_TH_H_CH4, comparison
                                                     criterion matches.2: When Vin >= BIT_ADC_COMP_TH_L_CH4
                                                     and Vin <= BIT_ADC_COMP_TH_H_CH4, comparison crit                         */
      __IOM uint32_t ch5        : 2;            /*!< [11..10] This field defines ADC channel comparison criteria
                                                     which would notify system by interrupt when the criterion
                                                     matches. Once a criterion matches, ADC should send an interrupt
                                                     signal to system if the related interrupt mask is unmask.
                                                     ADC also updates comparison results in REG_ADC_COMP_STS.0:
                                                     When Vin < BIT_ADC_COMP_TH_L_CH5, comparison criterion
                                                     matches.1: When Vin > BIT_ADC_COMP_TH_H_CH5, comparison
                                                     criterion matches.2: When Vin >= BIT_ADC_COMP_TH_L_CH5
                                                     and Vin <= BIT_ADC_COMP_TH_H_CH5, comparison crit                         */
      __IOM uint32_t ch6        : 2;            /*!< [13..12] This field defines ADC channel comparison criteria
                                                     which would notify system by interrupt when the criterion
                                                     matches. Once a criterion matches, ADC should send an interrupt
                                                     signal to system if the related interrupt mask is unmask.
                                                     ADC also updates comparison results in REG_ADC_COMP_STS.0:
                                                     When Vin < BIT_ADC_COMP_TH_L_CH6, comparison criterion
                                                     matches.1: When Vin > BIT_ADC_COMP_TH_H_CH6, comparison
                                                     criterion matches.2: When Vin >= BIT_ADC_COMP_TH_L_CH6
                                                     and Vin <= BIT_ADC_COMP_TH_H_CH6, comparison crit                         */
      __IOM uint32_t ch7        : 2;            /*!< [15..14] This field defines ADC channel comparison criteria
                                                     which would notify system by interrupt when the criterion
                                                     matches. Once a criterion matches, ADC should send an interrupt
                                                     signal to system if the related interrupt mask is unmask.
                                                     ADC also updates comparison results in REG_ADC_COMP_STS.0:
                                                     When Vin < BIT_ADC_COMP_TH_L_CH7, comparison criterion
                                                     matches.1: When Vin > BIT_ADC_COMP_TH_H_CH7, comparison
                                                     criterion matches.2: When Vin >= BIT_ADC_COMP_TH_L_CH7
                                                     and Vin <= BIT_ADC_COMP_TH_H_CH7, comparison crit                         */
            uint32_t            : 16;
    } comp_ctrl_b;
  } ;

  union {
    __IM  uint32_t comp_sts;                    /*!< (@ 0x0000002C) ADC Comparison Status Register                             */

