Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IM  uint32_t ch0        : 2;            /*!< [1..0] This field reflects comparison result of chnnel 0 immediately.     */
      __IM  uint32_t ch1        : 2;            /*!< [3..2] This field reflects comparison result of chnnel 1 immediately.     */
      __IM  uint32_t ch2        : 2;            /*!< [5..4] This field reflects comparison result of chnnel 2 immediately.     */
      __IM  uint32_t ch3        : 2;            /*!< [7..6] This field reflects comparison result of chnnel 3 immediately.     */
      __IM  uint32_t ch4        : 2;            /*!< [9..8] This field reflects comparison result of chnnel 4 immediately.     */
      __IM  uint32_t ch5        : 2;            /*!< [11..10] This field reflects comparison result of chnnel 5 immediately.   */
      __IM  uint32_t ch6        : 2;            /*!< [13..12] This field reflects comparison result of chnnel 6 immediately.   */
      __IM  uint32_t ch7        : 2;            /*!< [15..14] This field reflects comparison result of chnnel 7 immediately.   */
            uint32_t            : 16;
    } comp_sts_b;
  } ;

  union {
    __IOM uint32_t chsw_list_0;                 /*!< (@ 0x00000030) ADC Channel Swtich List 0 Register                         */

    struct {
      __IOM uint32_t chsw_0     : 4;            /*!< [3..0] This field defines the 1st channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_1     : 4;            /*!< [7..4] This field defines the 2nd channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_2     : 4;            /*!< [11..8] This field defines the 3rd channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_3     : 4;            /*!< [15..12] This field defines the 4th channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_4     : 4;            /*!< [19..16] This field defines the 5th channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_5     : 4;            /*!< [23..20] This field defines the 6th channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_6     : 4;            /*!< [27..24] This field defines the 7th channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_7     : 4;            /*!< [31..28] This field defines the 8th channel to do a conversion
                                                     when a conversion event takes place.                                      */
    } chsw_list_0_b;
  } ;

  union {
    __IOM uint32_t chsw_list_1;                 /*!< (@ 0x00000034) ADC Channel Swtich List 1 Register                         */

    struct {
      __IOM uint32_t chsw_8     : 4;            /*!< [3..0] This field defines the 9th channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_9     : 4;            /*!< [7..4] This field defines the 10th channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_10    : 4;            /*!< [11..8] This field defines the 11th channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_11    : 4;            /*!< [15..12] This field defines the 12th channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_12    : 4;            /*!< [19..16] This field defines the 13th channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_13    : 4;            /*!< [23..20] This field defines the 14th channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_14    : 4;            /*!< [27..24] This field defines the 15th channel to do a conversion
                                                     when a conversion event takes place.                                      */
      __IOM uint32_t chsw_15    : 4;            /*!< [31..28] This field defines the 16th channel to do a conversion
                                                     when a conversion event takes place.                                      */
    } chsw_list_1_b;
  } ;

  union {
    __IOM uint32_t rst_list;                    /*!< (@ 0x00000038) ADC Reset List Register                                    */

    struct {
      __IOM uint32_t rst_list   : 1;            /*!< [0..0] This bit controls to reset the channel switch to default
                                                     state or not. Once this bit is set, the auto/manual channel
                                                     switch goes to the first channel as a default state.0:
                                                     Do not reset conversion list to default state.1: Reset
                                                     conversion list to default state.                                         */
            uint32_t            : 31;
    } rst_list_b;
  } ;

  union {
    __IOM uint32_t auto_chsw_ctrl;              /*!< (@ 0x0000003C) ADC Auto Channel Switch Control Register                   */

