Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t auto_chsw_en : 1;          /*!< [0..0] This bit controls the automatic channel swtich enabled
                                                     or disabled.0: Disable the automatic channel switch. If
                                                     an automatic channel switch is in progess, writing 0 will
                                                     terminate the automatic channel switch.1: Enable the automatic
                                                     channel switch. When setting this bit, an automatic channel
                                                     switch starts from the first channel in the channel switch
                                                     list.                                                                     */
            uint32_t            : 31;
    } auto_chsw_ctrl_b;
  } ;

  union {
    __IOM uint32_t sw_trig;                     /*!< (@ 0x00000040) ADC Software Trigger Register                              */

    struct {
      __IOM uint32_t sw_trig    : 1;            /*!< [0..0] This bit controls the ADC module to do a conersion.Every
                                                     time this bit is set to 1, ADC module would switch to a
                                                     new channel and do one conversion. Therefore, this bit
                                                     could be used as a start-convert event which is controlled
                                                     by software. Every time a conversion is done, software
                                                     MUST clear this bit manually.0: Disable the analog module
                                                     and analog mux.1: Enable the analog module and analog mux.
                                                     And then start a new channel conversion.                                  */
            uint32_t            : 31;
    } sw_trig_b;
  } ;

  union {
    __IM  uint32_t last_item;                   /*!< (@ 0x00000044) ADC Last Item Register                                     */

    struct {
      __IM  uint32_t last_item  : 4;            /*!< [3..0] This field reflects the last used channel.                         */
            uint32_t            : 28;
    } last_item_b;
  } ;

  union {
    __IM  uint32_t sts;                         /*!< (@ 0x00000048) ADC Busy_Ready Status Register                             */

    struct {
      __IM  uint32_t busy       : 1;            /*!< [0..0] This bit reflects the ADC is busy or not. If the ADC
                                                     is processing a conversion of a channel, this bit remains
                                                     1 which indicates it's busy. Once a conversion is done,
                                                     this bit becomes 0 which indicates its' ready to do another
                                                     conversion.0: The ADC is ready.1: The ADC is busy.                        */
      __IM  uint32_t full       : 1;            /*!< [1..1] This bit directly reflects the FIFO full status.0: FIFO
                                                     is full.1: FIFO is NOT full.                                              */
      __IM  uint32_t empty      : 1;            /*!< [2..2] This bit directly reflects the FIFO empty status.0: FIFO
                                                     is empty.1: FIFO is NOT empty.                                            */
            uint32_t            : 29;
    } sts_b;
  } ;

  union {
    __IOM uint32_t intr_ctrl;                   /*!< (@ 0x0000004C) ADC Interrupt Control Register                             */

    struct {
      __IOM uint32_t it_cvlist_end_en : 1;      /*!< [0..0] This bit controls the interrupt is enbled or not when
                                                     a conversion of the last channel in the list is done.For
                                                     example, in automatic mode conversions would be executed
                                                     coninuously. Every time the last channel conversion is
                                                     done, which means all channel conversions in the list is
                                                     done, ADC could notify system if this bit is set.0: This
                                                     interrupt is disabled.1: This interrupt is enabled.                       */
      __IOM uint32_t it_cv_end_en : 1;          /*!< [1..1] This bit controls the interrupt is enbled or not every
                                                     time a conversion is done.No matter ADC module is in what
                                                     kind of operation mode. Every time a conversion is executed,
                                                     ADC module would notify system if this bit is set.0: This
                                                     interrupt is disabled.1: This interrupt is enabled.                       */
      __IOM uint32_t it_chcv_end_en : 1;        /*!< [2..2] This bit controls the interrupt is enbled or not when
                                                     a particular channel conversion is done.Please refer to
                                                     REG_ADC_IT_CHNO_CON0: This interrupt is disabled.1: This
                                                     interrupt is enabled.                                                     */
      __IOM uint32_t it_fifo_full_en : 1;       /*!< [3..3] This bit controls the interrupt is enabled or not when
                                                     a FIFO full state takes place.0: This interrupt is disabled.1:
                                                     This interrupt is enabled.                                                */
      __IOM uint32_t it_fifo_over_en : 1;       /*!< [4..4] This bit controls the interrupt is enabled or not when
                                                     a FIFO overflow state takes place.0: This interrupt is
                                                     disabled.1: This interrupt is enabled.                                    */
      __IOM uint32_t it_fifo_empty_en : 1;      /*!< [5..5] This bit controls the interrupt is enabled or not when
                                                     a FIFO empty state takes place.0: This interrupt is disabled.1:
                                                     This interrupt is enabled.                                                */
      __IOM uint32_t it_dat_ovw_en : 1;         /*!< [6..6] This bit controls the interrupt is enabled or not when
                                                     a data overwritten situation takes place.0: This interrupt
                                                     is disabled.1: This interrupt is enabled.                                 */
      __IOM uint32_t it_err_en  : 1;            /*!< [7..7] This bit controls the interrupt is enabled or not when
                                                     an error state takes place.0: This interrupt is disabled.1:
                                                     This interrupt is enabled.                                                */
      __IOM uint32_t it_comp_ch0_en : 1;        /*!< [8..8] This bit controls the interrupt is enabled or not when
                                                     channel 0 comparison criterion matches.0: This interrupt
                                                     is disabled.1: This interrupt is enabled.                                 */
      __IOM uint32_t it_comp_ch1_en : 1;        /*!< [9..9] This bit controls the interrupt is enabled or not when
                                                     channel 1 comparison criterion matches.0: This interrupt
                                                     is disabled.1: This interrupt is enabled.                                 */
      __IOM uint32_t it_comp_ch2_en : 1;        /*!< [10..10] This bit controls the interrupt is enabled or not when
                                                     channel 2 comparison criterion matches.0: This interrupt
                                                     is disabled.1: This interrupt is enabled.                                 */
      __IOM uint32_t it_comp_ch3_en : 1;        /*!< [11..11] This bit controls the interrupt is enabled or not when
                                                     channel 3 comparison criterion matches.0: This interrupt
                                                     is disabled.1: This interrupt is enabled.                                 */
      __IOM uint32_t it_comp_ch4_en : 1;        /*!< [12..12] This bit controls the interrupt is enabled or not when
                                                     channel 4 comparison criterion matches.0: This interrupt
                                                     is disabled.1: This interrupt is enabled.                                 */
      __IOM uint32_t it_comp_ch5_en : 1;        /*!< [13..13] This bit controls the interrupt is enabled or not when
                                                     channel 5 comparison criterion matches.0: This interrupt
                                                     is disabled.1: This interrupt is enabled.                                 */
      __IOM uint32_t it_comp_ch6_en : 1;        /*!< [14..14] This bit controls the interrupt is enabled or not when
                                                     channel 6 comparison criterion matches.0: This interrupt
                                                     is disabled.1: This interrupt is enabled.                                 */
      __IOM uint32_t it_comp_ch7_en : 1;        /*!< [15..15] This bit controls the interrupt is enabled or not when
                                                     channel 7 comparison criterion matches.0: This interrupt
                                                     is disabled.1: This interrupt is enabled.                                 */
            uint32_t            : 16;
    } intr_ctrl_b;
  } ;

  union {
    __IM  uint32_t intr_raw_sts;                /*!< (@ 0x00000050) ADC Interrupt RAW Status Register                          */

