Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IM  uint32_t it_cvlist_end : 1;         /*!< [0..0] RSVD                                                               */
      __IM  uint32_t it_cv_end  : 1;            /*!< [1..1] RSVD                                                               */
      __IM  uint32_t it_chcv_end : 1;           /*!< [2..2] RSVD                                                               */
      __IM  uint32_t it_fifo_full : 1;          /*!< [3..3] RSVD                                                               */
      __IM  uint32_t it_fifo_over : 1;          /*!< [4..4] RSVD                                                               */
      __IM  uint32_t it_fifo_empty : 1;         /*!< [5..5] RSVD                                                               */
      __IM  uint32_t it_dat_ovw : 1;            /*!< [6..6] RSVD                                                               */
      __IM  uint32_t it_err     : 1;            /*!< [7..7] RSVD                                                               */
      __IM  uint32_t it_comp_ch0 : 1;           /*!< [8..8] RSVD                                                               */
      __IM  uint32_t it_comp_ch1 : 1;           /*!< [9..9] RSVD                                                               */
      __IM  uint32_t it_comp_ch2 : 1;           /*!< [10..10] RSVD                                                             */
      __IM  uint32_t it_comp_ch3 : 1;           /*!< [11..11] RSVD                                                             */
      __IM  uint32_t it_comp_ch4 : 1;           /*!< [12..12] RSVD                                                             */
      __IM  uint32_t it_comp_ch5 : 1;           /*!< [13..13] RSVD                                                             */
      __IM  uint32_t it_comp_ch6 : 1;           /*!< [14..14] RSVD                                                             */
      __IM  uint32_t it_comp_ch7 : 1;           /*!< [15..15] RSVD                                                             */
            uint32_t            : 16;
    } intr_raw_sts_b;
  } ;

  union {
    __IOM uint32_t intr_sts;                    /*!< (@ 0x00000054) ADC Interrupt Status Register                              */

    struct {
      __IOM uint32_t it_cvlist_end : 1;         /*!< [0..0] RSVD                                                               */
      __IOM uint32_t it_cv_end  : 1;            /*!< [1..1] RSVD                                                               */
      __IOM uint32_t it_chcv_end : 1;           /*!< [2..2] RSVD                                                               */
      __IOM uint32_t it_fifo_full : 1;          /*!< [3..3] RSVD                                                               */
      __IOM uint32_t it_fifo_over : 1;          /*!< [4..4] RSVD                                                               */
      __IOM uint32_t it_fifo_empty : 1;         /*!< [5..5] RSVD                                                               */
      __IOM uint32_t it_dat_ovw : 1;            /*!< [6..6] RSVD                                                               */
      __IOM uint32_t it_err     : 1;            /*!< [7..7] RSVD                                                               */
      __IOM uint32_t it_comp_ch0 : 1;           /*!< [8..8] RSVD                                                               */
      __IOM uint32_t it_comp_ch1 : 1;           /*!< [9..9] RSVD                                                               */
      __IOM uint32_t it_comp_ch2 : 1;           /*!< [10..10] RSVD                                                             */
      __IOM uint32_t it_comp_ch3 : 1;           /*!< [11..11] RSVD                                                             */
      __IOM uint32_t it_comp_ch4 : 1;           /*!< [12..12] RSVD                                                             */
      __IOM uint32_t it_comp_ch5 : 1;           /*!< [13..13] RSVD                                                             */
      __IOM uint32_t it_comp_ch6 : 1;           /*!< [14..14] RSVD                                                             */
      __IOM uint32_t it_comp_ch7 : 1;           /*!< [15..15] RSVD                                                             */
            uint32_t            : 16;
    } intr_sts_b;
  } ;

  union {
    __IOM uint32_t it_chno_con;                 /*!< (@ 0x00000058) ADC Conversion Interrupt Channel Number Configuration
                                                                    Register                                                   */

    struct {
      __IOM uint32_t it_chno_con : 3;           /*!< [2..0] This field defines that ADC module should send interrupt
                                                     signal to system when a conversion which of channel number
                                                     is the same as this field. This register is only valid
                                                     when BIT_ADC_IT_CHCV_END_EN is set.BIT_ADC_IT_CHNO_CON:
                                                     Channel number.                                                           */
            uint32_t            : 29;
    } it_chno_con_b;
  } ;

  union {
    __IOM uint32_t full_lvl;                    /*!< (@ 0x0000005C) ADC FIFO Full Level Register                               */

    struct {
      __IOM uint32_t full_lvl   : 6;            /*!< [5..0] This field defines the FIFO full entry threshold level
                                                     and it is used for FIFO full interrupt. It should be set
                                                     according to ADC FIFO depth.A value of 0 sets the threshold
                                                     for 1 entry, and a value of 15 sets the threshold for16
                                                     entries.                                                                  */
            uint32_t            : 26;
    } full_lvl_b;
  } ;

  union {
    __IOM uint32_t trig_timer_sel;              /*!< (@ 0x00000060) ADC Trigger Timer Select Register                          */

