Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t trig_timer_sel : 3;        /*!< [2..0] This three bits defines which timer channel would be
                                                     used to make ADC module do a conversion.BIT_ADC_EXT_WK_TIMER_SEL
                                                     is 0: Timer module 0 is used as the comparator external
                                                     trigger source.1: Timer module 1 is used as the comparator
                                                     external trigger source. . . .7: Timer module 7 is used
                                                     as the comparator external trigger source.                                */
            uint32_t            : 29;
    } trig_timer_sel_b;
  } ;

  union {
    __IOM uint32_t dat_global;                  /*!< (@ 0x00000064) ADC Global Data Register                                   */

    struct {
      __IOM uint32_t dat        : 18;           /*!< [17..0] This field contains the newest conversion data of a
                                                     conversion channel in the list.                                           */
            uint32_t            : 3;
      __IOM uint32_t ovw        : 1;            /*!< [21..21] This bit indicates that there is a data overwritten
                                                     situation in BIT_ADC_DATA_GLOBAL takes place. A data overwritten
                                                     situation is that a former conversion data is NOT read
                                                     before a new conversion is written into data field.0: There
                                                     is no data overwritten case.1: There is a data overwritten
                                                     case.                                                                     */
      __IOM uint32_t rdy        : 1;            /*!< [22..22] This bit indicates that a conversion is done. Every
                                                     time a conversion is done, this bit should be set to 1
                                                     and it would be cleared to 0 when a read operation of REG_ADC_DATA_GLOBAL
                                                                                                                               */
      __IOM uint32_t ch         : 3;            /*!< [25..23] This field indicates which channel data is in BIT_ADC_DATA_GLOBAL */
            uint32_t            : 6;
    } dat_global_b;
  } ;

  union {
    __IOM uint32_t dat_ch0;                     /*!< (@ 0x00000068) ADC Channel 0 Data Register                                */

    struct {
      __IOM uint32_t dat        : 18;           /*!< [17..0] This field contains the newest conversion data of channel
                                                     0.                                                                        */
            uint32_t            : 3;
      __IOM uint32_t ovw        : 1;            /*!< [21..21] This bit indicates that there is a data overwritten
                                                     situation in dat_ch0 takes place. A data overwritten situation
                                                     is that a former conversion data is NOT read before a new
                                                     conversion is written into data field.0: There is no data
                                                     overwritten case.1: There is a data overwritten case.                     */
      __IOM uint32_t rdy        : 1;            /*!< [22..22] This bit indicates that a conversion is done. Every
                                                     time a conversion is done, this bit should be set to 1
                                                     and it would be cleared to 0 when a read operation of dat_ch0.            */
            uint32_t            : 9;
    } dat_ch0_b;
  } ;

  union {
    __IOM uint32_t dat_ch1;                     /*!< (@ 0x0000006C) ADC Channel 1 Data Register                                */

    struct {
      __IOM uint32_t dat        : 18;           /*!< [17..0] This field contains the newest conversion data of channel
                                                     1.                                                                        */
            uint32_t            : 3;
      __IOM uint32_t ovw        : 1;            /*!< [21..21] This bit indicates that there is a data overwritten
                                                     situation in dat_ch1 takes place. A data overwritten situation
                                                     is that a former conversion data is NOT read before a new
                                                     conversion is written into data field.0: There is no data
                                                     overwritten case.1: There is a data overwritten case.                     */
      __IOM uint32_t rdy        : 1;            /*!< [22..22] This bit indicates that a conversion is done. Every
                                                     time a conversion is done, this bit should be set to 1
                                                     and it would be cleared to 0 when a read operation of dat_ch1.            */
            uint32_t            : 9;
    } dat_ch1_b;
  } ;

  union {
    __IOM uint32_t dat_ch2;                     /*!< (@ 0x00000070) ADC Channel 2 Data Register                                */

    struct {
      __IOM uint32_t dat        : 18;           /*!< [17..0] This field contains the newest conversion data of channel
                                                     2.                                                                        */
            uint32_t            : 3;
      __IOM uint32_t ovw        : 1;            /*!< [21..21] This bit indicates that there is a data overwritten
                                                     situation in dat_ch2 takes place. A data overwritten situation
                                                     is that a former conversion data is NOT read before a new
                                                     conversion is written into data field.0: There is no data
                                                     overwritten case.1: There is a data overwritten case.                     */
      __IOM uint32_t rdy        : 1;            /*!< [22..22] This bit indicates that a conversion is done. Every
                                                     time a conversion is done, this bit should be set to 1
                                                     and it would be cleared to 0 when a read operation of dat_ch2.            */
            uint32_t            : 9;
    } dat_ch2_b;
  } ;

  union {
    __IOM uint32_t dat_ch3;                     /*!< (@ 0x00000074) ADC Channel 3 Data Register                                */

