Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t dat        : 18;           /*!< [17..0] This field contains the newest conversion data of channel
                                                     3.                                                                        */
            uint32_t            : 3;
      __IOM uint32_t ovw        : 1;            /*!< [21..21] This bit indicates that there is a data overwritten
                                                     situation in dat_ch3 takes place. A data overwritten situation
                                                     is that a former conversion data is NOT read before a new
                                                     conversion is written into data field.0: There is no data
                                                     overwritten case.1: There is a data overwritten case.                     */
      __IOM uint32_t rdy        : 1;            /*!< [22..22] This bit indicates that a conversion is done. Every
                                                     time a conversion is done, this bit should be set to 1
                                                     and it would be cleared to 0 when a read operation of dat_ch3.            */
            uint32_t            : 9;
    } dat_ch3_b;
  } ;

  union {
    __IOM uint32_t dat_ch4;                     /*!< (@ 0x00000078) ADC Channel 4 Data Register                                */

    struct {
      __IOM uint32_t dat        : 18;           /*!< [17..0] This field contains the newest conversion data of channel
                                                     4.                                                                        */
            uint32_t            : 3;
      __IOM uint32_t ovw        : 1;            /*!< [21..21] This bit indicates that there is a data overwritten
                                                     situation in dat_ch4 takes place. A data overwritten situation
                                                     is that a former conversion data is NOT read before a new
                                                     conversion is written into data field.0: There is no data
                                                     overwritten case.1: There is a data overwritten case.                     */
      __IOM uint32_t rdy        : 1;            /*!< [22..22] This bit indicates that a conversion is done. Every
                                                     time a conversion is done, this bit should be set to 1
                                                     and it would be cleared to 0 when a read operation of dat_ch4.            */
            uint32_t            : 9;
    } dat_ch4_b;
  } ;

  union {
    __IOM uint32_t dat_ch5;                     /*!< (@ 0x0000007C) ADC Channel 5 Data Register                                */

    struct {
      __IOM uint32_t dat        : 18;           /*!< [17..0] This field contains the newest conversion data of channel
                                                     5.                                                                        */
            uint32_t            : 3;
      __IOM uint32_t ovw        : 1;            /*!< [21..21] This bit indicates that there is a data overwritten
                                                     situation in dat_ch5 takes place. A data overwritten situation
                                                     is that a former conversion data is NOT read before a new
                                                     conversion is written into data field.0: There is no data
                                                     overwritten case.1: There is a data overwritten case.                     */
      __IOM uint32_t rdy        : 1;            /*!< [22..22] This bit indicates that a conversion is done. Every
                                                     time a conversion is done, this bit should be set to 1
                                                     and it would be cleared to 0 when a read operation of dat_ch5.            */
            uint32_t            : 9;
    } dat_ch5_b;
  } ;

  union {
    __IOM uint32_t dat_ch6;                     /*!< (@ 0x00000080) ADC Channel 6 Data Register                                */

    struct {
      __IOM uint32_t dat        : 18;           /*!< [17..0] This field contains the newest conversion data of channel
                                                     6.                                                                        */
            uint32_t            : 3;
      __IOM uint32_t ovw        : 1;            /*!< [21..21] This bit indicates that there is a data overwritten
                                                     situation in dat_ch6 takes place. A data overwritten situation
                                                     is that a former conversion data is NOT read before a new
                                                     conversion is written into data field.0: There is no data
                                                     overwritten case.1: There is a data overwritten case.                     */
      __IOM uint32_t rdy        : 1;            /*!< [22..22] This bit indicates that a conversion is done. Every
                                                     time a conversion is done, this bit should be set to 1
                                                     and it would be cleared to 0 when a read operation of dat_ch6.            */
            uint32_t            : 9;
    } dat_ch6_b;
  } ;

  union {
    __IOM uint32_t dat_ch7;                     /*!< (@ 0x00000084) ADC Channel 7 Data Register                                */

    struct {
      __IOM uint32_t dat        : 18;           /*!< [17..0] This field contains the newest conversion data of channel
                                                     7.                                                                        */
            uint32_t            : 3;
      __IOM uint32_t ovw        : 1;            /*!< [21..21] This bit indicates that there is a data overwritten
                                                     situation in dat_ch7 takes place. A data overwritten situation
                                                     is that a former conversion data is NOT read before a new
                                                     conversion is written into data field.0: There is no data
                                                     overwritten case.1: There is a data overwritten case.                     */
      __IOM uint32_t rdy        : 1;            /*!< [22..22] This bit indicates that a conversion is done. Every
                                                     time a conversion is done, this bit should be set to 1
                                                     and it would be cleared to 0 when a read operation of dat_ch7.            */
            uint32_t            : 9;
    } dat_ch7_b;
  } ;

  union {
    __IOM uint32_t dma_con;                     /*!< (@ 0x00000088) ADC DMA Control Register                                   */

