Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t en         : 1;            /*!< [0..0] This bit controls that DMA function of ADC is enabled
                                                     or not.0: ADC DMA is disabled.1: ADC DMA is enabled.                      */
            uint32_t            : 7;
      __IOM uint32_t lvl        : 6;            /*!< [13..8] This field defines the FIFO threshold level that ADC
                                                     module should make a DMA request to DMA module.A value
                                                     of 0 sets the threshold for 1 entry, and a value of 15
                                                     sets the threshold for16 entries.                                         */
            uint32_t            : 18;
    } dma_con_b;
  } ;

  union {
    __IOM uint32_t flr;                         /*!< (@ 0x0000008C) ADC FIFO Level Register                                    */

    struct {
      __IOM uint32_t flr        : 7;            /*!< [6..0] This field records the current ADC FIFO entry number.              */
            uint32_t            : 25;
    } flr_b;
  } ;

  union {
    __IOM uint32_t clr_fifo;                    /*!< (@ 0x00000090) ADC Clear FIFO Register                                    */

    struct {
      __IOM uint32_t clr_fifo   : 1;            /*!< [0..0] This bit is used to clear FIFO contents and makes it
                                                     to the default status.Every time this bit is set to 1,
                                                     FIFO would be cleared to the default status. Software should
                                                     set this bit to 0 after FIFO is cleared.0: No effect.1:
                                                     Clear FIFO.                                                               */
            uint32_t            : 31;
    } clr_fifo_b;
  } ;

  union {
    __IOM uint32_t clk_div;                     /*!< (@ 0x00000094) ADC Clock Division Register                                */

    struct {
      __IOM uint32_t clk_div    : 3;            /*!< [2..0] This field defines clock divider level of ADC module.A
                                                     value of 0 is for clock divided by 5.A value of 1 is for
                                                     clock divided by 10.A value of 2 is for clock divided by
                                                     16.A value of 3 is for clock divided by 32.A value of 4
                                                     is for clock divided by 64.                                               */
            uint32_t            : 29;
    } clk_div_b;
  } ;

  union {
    __IOM uint32_t dly_cnt;                     /*!< (@ 0x00000098) ADC Delay Couont Register                                  */

    struct {
      __IOM uint32_t dly_cnt    : 4;            /*!< [3..0] This field defines channel switch delay count.A value
                                                     of 0 is for using default count of hardware.                              */
            uint32_t            : 28;
    } dly_cnt_b;
  } ;

  union {
    __IOM uint32_t pwr_ctrl;                    /*!< (@ 0x0000009C) ADC Power Control Register                                 */

    struct {
      __IOM uint32_t pwr_ctrl   : 1;            /*!< [0..0] This field is used to power control.                               */
            uint32_t            : 31;
    } pwr_ctrl_b;
  } ;

  union {
    __IOM uint32_t ana_ad0;                     /*!< (@ 0x000000A0) ADC Analog Control 0 Register                              */

    struct {
      __IOM uint32_t pwr_cut    : 1;            /*!< [0..0] This field is for analog usage.                                    */
      __IOM uint32_t en         : 1;            /*!< [1..1] This field is for analog usage.                                    */
      __IOM uint32_t ref_en     : 1;            /*!< [2..2] This field is for analog usage.                                    */
      __IOM uint32_t cal_en     : 1;            /*!< [3..3] This field is for analog usage.                                    */
      __IOM uint32_t ext_vref_en : 1;           /*!< [4..4] This field is for analog usage.                                    */
      __IOM uint32_t ck         : 1;            /*!< [5..5] This field is for analog usage.                                    */
      __IOM uint32_t ckd2       : 1;            /*!< [6..6] This field is for analog usage.                                    */
      __IOM uint32_t dly        : 1;            /*!< [7..7] This field is for analog usage.                                    */
      __IOM uint32_t samp       : 1;            /*!< [8..8] This field is for analog usage.                                    */
      __IOM uint32_t revck      : 1;            /*!< [9..9] This field is for analog usage.                                    */
      __IOM uint32_t dout       : 1;            /*!< [10..10] This field is for analog usage.                                  */
      __IOM uint32_t bstca      : 1;            /*!< [11..11] This field is for analog usage.                                  */
      __IOM uint32_t avg        : 1;            /*!< [12..12] This field is for analog usage.                                  */
      __IOM uint32_t bypass     : 6;            /*!< [18..13] This field is for analog usage.                                  */
      __IOM uint32_t dat_sel    : 5;            /*!< [23..19] This field is for analog usage.                                  */
      __IOM uint32_t dummy      : 8;            /*!< [31..24] This field is for analog usage.                                  */
    } ana_ad0_b;
  } ;

  union {
    __IOM uint32_t ana_ad1;                     /*!< (@ 0x000000A4) ADC Analog Control 1 Register                              */

    struct {
      __IOM uint32_t dout0_p    : 2;            /*!< [1..0] This field is for analog usage.                                    */
      __IOM uint32_t dout0_n    : 2;            /*!< [3..2] This field is for analog usage.                                    */
      __IOM uint32_t dout1_p    : 3;            /*!< [6..4] This field is for analog usage.                                    */
      __IOM uint32_t dout1_n    : 3;            /*!< [9..7] This field is for analog usage.                                    */
      __IOM uint32_t dout2_p    : 3;            /*!< [12..10] This field is for analog usage.                                  */
      __IOM uint32_t dout2_n    : 3;            /*!< [15..13] This field is for analog usage.                                  */
      __IOM uint32_t dout3_p    : 4;            /*!< [19..16] This field is for analog usage.                                  */
      __IOM uint32_t dout3_n    : 4;            /*!< [23..20] This field is for analog usage.                                  */
      __IOM uint32_t dout4_n    : 5;            /*!< [28..24] This field is for analog usage.                                  */
      __IOM uint32_t dummy      : 3;            /*!< [31..29] This field is for analog usage.                                  */
    } ana_ad1_b;
  } ;

  union {
    __IOM uint32_t ana_ad2;                     /*!< (@ 0x000000A8) ADC Analog Control 2 Register                              */

