Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t dout4_n    : 5;            /*!< [4..0] This field is for analog usage.                                    */
      __IOM uint32_t dout5_p    : 5;            /*!< [9..5] This field is for analog usage.                                    */
      __IOM uint32_t dout5_n    : 5;            /*!< [14..10] This field is for analog usage.                                  */
      __IOM uint32_t dout6_p    : 5;            /*!< [19..15] This field is for analog usage.                                  */
      __IOM uint32_t dout6_n    : 5;            /*!< [24..20] This field is for analog usage.                                  */
      __IOM uint32_t dout7_p    : 5;            /*!< [29..25] This field is for analog usage.                                  */
      __IOM uint32_t dummy      : 2;            /*!< [31..30] This field is for analog usage.                                  */
    } ana_ad2_b;
  } ;

  union {
    __IOM uint32_t ana_ad3;                     /*!< (@ 0x000000AC) ADC Analog Control 3 Register                              */

    struct {
      __IOM uint32_t dout7_n    : 5;            /*!< [4..0] This field is for analog usage.                                    */
      __IOM uint32_t dout8_p    : 5;            /*!< [9..5] This field is for analog usage.                                    */
      __IOM uint32_t dout8_n    : 5;            /*!< [14..10] This field is for analog usage.                                  */
      __IOM uint32_t dout9_p    : 6;            /*!< [20..15] This field is for analog usage.                                  */
      __IOM uint32_t dout9_n    : 6;            /*!< [26..21] This field is for analog usage.                                  */
      __IOM uint32_t dummy      : 5;            /*!< [31..27] This field is for analog usage.                                  */
    } ana_ad3_b;
  } ;

  union {
    __IOM uint32_t ana_ad4;                     /*!< (@ 0x000000B0) ADC Analog Control 4 Register                              */

    struct {
      __IOM uint32_t dout10_p   : 5;            /*!< [4..0] This field is for analog usage.                                    */
      __IOM uint32_t dout10_n   : 5;            /*!< [9..5] This field is for analog usage.                                    */
      __IOM uint32_t dout11_p   : 5;            /*!< [14..10] This field is for analog usage.                                  */
      __IOM uint32_t dout11_n   : 6;            /*!< [20..15] This field is for analog usage.                                  */
            uint32_t            : 5;
      __IOM uint32_t dummy      : 6;            /*!< [31..26] This field is for analog usage.                                  */
    } ana_ad4_b;
  } ;

  union {
    __IOM uint32_t ana_ad5;                     /*!< (@ 0x000000B4) ADC Analog Control 5 Register                              */

    struct {
      __IOM uint32_t dout12_p   : 8;            /*!< [7..0] This field is for analog usage.                                    */
      __IOM uint32_t dout12_n   : 8;            /*!< [15..8] This field is for analog usage.                                   */
      __IOM uint32_t dout13_p   : 8;            /*!< [23..16] This field is for analog usage.                                  */
      __IOM uint32_t dout13_n   : 8;            /*!< [31..24] This field is for analog usage.                                  */
    } ana_ad5_b;
  } ;

  union {
    __IOM uint32_t ana_ad6;                     /*!< (@ 0x000000B8) ADC Analog Control 6 Register                              */

    struct {
      __IOM uint32_t dout_offp  : 6;            /*!< [5..0] This field is for analog usage.                                    */
      __IOM uint32_t dout_offn  : 6;            /*!< [11..6] This field is for analog usage.                                   */
      __IOM uint32_t dummy      : 4;            /*!< [15..12] This field is for analog usage.                                  */
            uint32_t            : 16;
    } ana_ad6_b;
  } ;
} ADC_Type;                                     /*!< Size = 188 (0xbc)                                                         */



/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UART port 0, 7/8 bit frame, 1/2 stop bit, up to 4000000 baud rate (UART0)
  */

typedef struct {                                /*!< (@ 0x40040000) UART0 Structure                                            */

  union {
    __IOM uint32_t dllr;                        /*!< (@ 0x00000000) Divisor Latch (LS) Register                                */

    struct {
      __IOM uint32_t dll        : 8;            /*!< [7..0] Divisor [7:0]; accessible when DLAB = 1                            */
            uint32_t            : 24;
    } dllr_b;
  } ;

  union {
    union {
      __IOM uint32_t dlmr;                      /*!< (@ 0x00000004) Divisor Latch (MS) Register                                */

      struct {
        __IOM uint32_t dlm      : 8;            /*!< [7..0] Divisor [15:8]; accessible when DLAB = 1                           */
              uint32_t          : 24;
      } dlmr_b;
    } ;

    union {
      __IOM uint32_t ier;                       /*!< (@ 0x00000004) Interrupt Enable Register                                  */

      struct {
        __IOM uint32_t erbi     : 1;            /*!< [0..0] Enable Received Data Available Interrupt (ERBFI) (rx
                                                     trigger)0: disabled1: enabled                                             */
        __IOM uint32_t etbei    : 1;            /*!< [1..1] Enable Transmitter FIFO Empty interrupt (ETBEI) (tx fifo
                                                     empty)0: disabled 1: enabled                                              */
        __IOM uint32_t elsi     : 1;            /*!< [2..2] Enable Receiver Line Status Interrupt (ELSI) (receiver
                                                     line status)0: disabled1: enabled                                         */
        __IOM uint32_t edssi    : 1;            /*!< [3..3] Enable Modem Status Interrupt (EDSSI) (modem status transition)0:
                                                     disabled1: enabled                                                        */
              uint32_t          : 28;
      } ier_b;
    } ;
  };

  union {
    union {
      __IM  uint32_t iir;                       /*!< (@ 0x00000008) Interrupt Identification Register                          */

