Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
      struct {
        __IM  uint32_t int_pend : 1;            /*!< [0..0] Indicates that an interrupt is pending when it's logic
                                                     ''0''. When it is ''1'', no interrupt is pending0: an interrupt
                                                     is pending and the IIR contents may be used as a pointer
                                                     to the appropriate interrupt service routine1: no interrupt
                                                     is pending                                                                */
        __IM  uint32_t int_id   : 3;            /*!< [3..1] Bit1 and Bit2 the two bits of the IIR are used to identify
                                                     the highest priority interrupt pending as indicated in
                                                     the following tableBit3: In the FIFO mode this bit is set
                                                     along with bit 2 when a timeout interrupt is pending.Bit3~Bit1
                                                     displays the list of possible interrupts along with the
                                                     bits they enable, priority, and their source and reset
                                                     control.''3'b011'': Interrupt Priority: 1st priority (int_3)
                                                     Interrupt Type: Receiver Line Status (read lsr) Interrupt
                                                     Source: Par                                                               */
              uint32_t          : 28;
      } iir_b;
    } ;

    union {
      __OM  uint32_t fcr;                       /*!< (@ 0x00000008) FIFO Control Register                                      */

      struct {
        __OM  uint32_t en_rxfifo_err : 1;       /*!< [0..0] Set as 1 to enable the report of Error in RCVR FIFO field
                                                     in LSR bit [7]                                                            */
        __OM  uint32_t clear_rxfifo : 1;        /*!< [1..1] Writing a Logic ''1'' to Bit 1 clears the Receiver FIFO
                                                     and resets its logic. But it doesn't clear the shift register,
                                                     i.e. receiving of the current character continues.The 1
                                                     that is written to this bit position is self-clearing                     */
        __OM  uint32_t clear_txfifo : 1;        /*!< [2..2] Writing a Logic ''1'' to Bit 2 clears the Transmitter
                                                     FIFO and resets its logic. The shift register is not cleared,
                                                     i.e., transmitting of the current character continues.The
                                                     1 that is written to this bit position is self-clearing                   */
        __OM  uint32_t dma_mode : 1;            /*!< [3..3] Support DMA mode. (cooperate with DW DDMA in the data
                                                     path)                                                                     */
              uint32_t          : 1;
        __OM  uint32_t txfifo_low_level : 1;    /*!< [5..5] Define the Transmission FIFO Low Water Level Interrupt
                                                     trigger.0: 4 byte1: 8 bytes                                               */
        __OM  uint32_t rxfifo_trigger_level : 2;/*!< [7..6] Define the 32-entries Receiver FIFO Interrupt trigger
                                                     level 0~31 bytes''00'': 1 byte''01'': 8 bytes''10'': 16
                                                     bytes''11'': 30 bytes (for some device detect RTS de-assertion
                                                     slower, reserve more RX FIFO space to prevent RX FIFO overflow
                                                     )                                                                         */
              uint32_t          : 24;
      } fcr_b;
    } ;
  };

  union {
    __IOM uint32_t lcr;                         /*!< (@ 0x0000000C) Line Control Register                                      */

    struct {
      __IOM uint32_t wls0       : 1;            /*!< [0..0] Word length selection, 0: data is 7 bit word length.1:
                                                     data is 8 bit word length.                                                */
            uint32_t            : 1;
      __IOM uint32_t stb        : 1;            /*!< [2..2] This bit specifies the number of Stop bits transmitted
                                                     and received in each serial character.0: 1 stop bit. 1:
                                                     2 stop bits.Note that the receiver always checks the first
                                                     stop bit only.                                                            */
      __IOM uint32_t parity_en  : 1;            /*!< [3..3] Parity Enable0: No parity1: Parity bit is generated on
                                                     each outgoing character and is checked on each incoming
                                                     one.                                                                      */
      __IOM uint32_t even_parity_sel : 1;       /*!< [4..4] Even Parity select0: Odd number of Logic ''1'' is transmitted
                                                     and checked in each word (data and parity combined). In
                                                     other words, if the data has an even number of ''1'' in
                                                     it, then the parity bit is ''1''1: Even number of ''1''
                                                     is transmitted in each word.                                              */
      __IOM uint32_t stick_parity_en : 1;       /*!< [5..5] Stick Parity enable control.1: Enable Stick Parity.0:
                                                     Disable Stick Parity.If the stick parity is enabled, the
                                                     parity bit is controlled by the LCR bit[4].LCR[5:4]:00:
                                                     Odd Parity01: Even Parity10: Stick Parity as 011: Stick
                                                     Parity as 1                                                               */
      __IOM uint32_t break_ctrl : 1;            /*!< [6..6] Break Control bit0: break is disabled1: the serial out
                                                     is forced into logic '0' (break state). Break control bit
                                                     causes a break condition to be transmitted to the receiving
                                                     UART. When it is set to logic 1, the serial output (Sout)
                                                     is forced to the Spacing (logic 0) state. The break is
                                                     disabled by setting bit 6 to logic 0. The Break Control
                                                     bit acts only on SOUT and has no effect on the transmitter
                                                     logic.                                                                    */
      __IOM uint32_t dlab       : 1;            /*!< [7..7] Divisor Latch Access bit0: The divisor latches cannot
                                                     be accessed1: The divisor latches can be accessedNote:
                                                     DLL/DLM only can be access when dlab bit = 1 IER only can
                                                     be access when dlab bit = 0 THR/RBR don't care about dlab
                                                     bit value.                                                                */
            uint32_t            : 24;
    } lcr_b;
  } ;

  union {
    __IOM uint32_t mcr;                         /*!< (@ 0x00000010) Modem Control Register                                     */

