Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t dtr        : 1;            /*!< [0..0] Data Terminal Ready (DTR) signal control0:DTR is logic
                                                     11:DTR is logic 0This bit controls the Data Terminal Ready
                                                     (DTR_) output. When bit 0 is set to logic 1, the DTR_ output
                                                     is forced to logic 0. When bit0 reset to logic 0, the DTR_
                                                     output is forced to logic 1.                                              */
      __IOM uint32_t rts        : 1;            /*!< [1..1] Request to Send (RTS) signal control''0'' RTS is logic
                                                     1''1'' RTS is logic 0This bit controls the Request to Send
                                                     (RTS) output. The RTS output is controlled as following
                                                     equation:RTS_output = rts_en ? (~rts|FIFO_FlowCtrl):~rts                  */
      __IOM uint32_t out1       : 1;            /*!< [2..2] This bit controls the Output 1 (OUT1_) signal, which
                                                     is an auxiliary user-designated output. Bit 2 affects the
                                                     OUT1_ in a manner identical to that described below for
                                                     bit 0.In loopback mode, connected Ring Indicator (RI) signal
                                                     input                                                                     */
      __IOM uint32_t out2       : 1;            /*!< [3..3] This bit controls the output 2 (OUT2_) signal, which
                                                     is an auxiliary user-designated output. Bit3 affects the
                                                     OUT2_output in a manner identical to that described below
                                                     for bit 0.In loopback mode, connected to Data Carrier Detect
                                                     (DCD)                                                                     */
      __IOM uint32_t loopback_en : 1;           /*!< [4..4] LoopBack mode0: normal operation1: loopback modeThis
                                                     bit provides a local loopback feature for diagnostic testing
                                                     of the UART. When bit 4 is set to logic 1, the following
                                                     occur: the transmitter Serial Output ( SOUT) is set to
                                                     the Marking ( logic 1) state; the receiver Serial Input
                                                     (SIN) is disconnected; the output of the Transmitter Shift
                                                     Register is ''looped back'' into the Receiver Shift Register
                                                     input; the four MODEM control inputs (DSR_, CTS_, RI_ and
                                                     DCD_) are disconnected; and the four MODEM                                */
      __IOM uint32_t cts_en     : 1;            /*!< [5..5] CTS flow control enable (CTSE)This Bit (CTSE) is the
                                                     auto CTS flow control enable. When set (1), the auto CTS
                                                     flow control as described in the detailed description is
                                                     enabled.Note: Auto-CTS_:The Transmitter circuitry checks
                                                     CTS_ before sending the next data byte. When CTS_ is active,
                                                     it sends the next byte. Top stop the transmitter from sending
                                                     the following byte, CTS_ must be released before the middle
                                                     of the last stop bit that is currently being sent. The
                                                     auto-CTS_ function reduces interrupts to th                               */
      __IOM uint32_t rts_en     : 1;            /*!< [6..6] RTS flow control enable (RTSE)This Bit (RTSE) is the
                                                     auto RTS flow control enables. When set (1), the auto RTS
                                                     flow control as described in the detailed description is
                                                     enabled.Note: Auto-RTS_ data flow control originates in
                                                     the receiver timing and control block and is linked to
                                                     the programmed receiver FIFO trigger level. When the receiver
                                                     FIFO level reaches a trigger level, RTS_ is de-asserted.
                                                     The sending communication element may send an additional
                                                     byte after the trigger level is reached (assuming                         */
      __IOM uint32_t sw_cts     : 1;            /*!< [7..7] Software controlled CTS. The software can use this bit
                                                     to pause the UART transmission, just like the HW flow control.
                                                     This is useful for software to implement XOn/XOff SW flow
                                                     control. This bit setting will effects the CTS flow-control:CTS
                                                     = cts_en ? (sw_cts | CTS_input) : sw_cts                                  */
            uint32_t            : 24;
    } mcr_b;
  } ;

  union {
    __IM  uint32_t lsr;                         /*!< (@ 0x00000014) Line Status Register                                       */

