Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IM  uint32_t rxfifo_datardy : 1;        /*!< [0..0] Data Ready (DR) indicator0: No characters in the Receiver
                                                     FIFO1: At least one character has been received and transferred
                                                     into the FIFO.Bit0 is reset to logic ''0'' by reading all
                                                     of the data in the Receiver Buffer Register or the RX FIFO.               */
      __IM  uint32_t overrun_err : 1;           /*!< [1..1] Overrun Error (OE) indicator0: No Overrun state1: Indicates
                                                     that data in the RX FIFO was not read by the CPU before
                                                     the next character was transferred into the RX FIFO, thereby
                                                     destroying the previous character. The OE indicator is
                                                     set to logic 1 upon detection of an overrun condition and
                                                     reset whenever the CPU reads the contents of the Line Status
                                                     Register. If the FIFO mode data continues to fill the FIFO
                                                     beyond the trigger level, an overrun error will occur only
                                                     after the FIFO is full and the next ch                                    */
      __IM  uint32_t parity_err : 1;            /*!< [2..2] Parity Error (PE) indicator0: No parity error in current
                                                     character1: Indicates that the received data character
                                                     does not have the correct even or odd parity, as selected
                                                     by the even-parity-select bit. The PE bit is set to logic
                                                     ''1'' upon detection of a parity error and is reset to
                                                     logic 0 whenever the CPU reads the contents of the Line
                                                     Status Register. This error is revealed to the CPU when
                                                     its associated character is at the top of the FIFO (next
                                                     character to be read).                                                    */
      __IM  uint32_t framing_err : 1;           /*!< [3..3] Framing Error (FE) indicator0: No framing error in the
                                                     current character1: The received character at the top of
                                                     the FIFO did not have a valid stop bit. Of course, generally,
                                                     it might be that all the following data is corrupt. It
                                                     indicates that the received character did not have a valid
                                                     stop bit. Bit 3 is set to a logic 1 whenever the Stop bit
                                                     following the last data bit or parity bit is detected as
                                                     a logic 0 bit (Spacing level). The FE indicator is reset
                                                     whenever the CPU reads the contents of the Line                           */
      __IM  uint32_t break_err_int : 1;         /*!< [4..4] Break Interrupt (BI) indicator0: No break condition in
                                                     the current character1: set to logic 1 whenever the received
                                                     data input is held in the Spacing (logic 0) state for a
                                                     longer than a full word transmission time (that is, the
                                                     total time of Start bit + data bits + Parity + Stop bits).
                                                     The BI indicator is reset whenever the CPU reads the contents
                                                     of the Line Status Register. This error is revealed to
                                                     the CPU when its associated character is at the top of
                                                     the FIFO. When break occurs only one zero charac                          */
      __IM  uint32_t txfifo_empty : 1;          /*!< [5..5] TXFIFO empty indicator.0: Otherwise1: It indicates that
                                                     the Transmitter FIFO is empty. This bit is set when the
                                                     Transmitter FIFO is empty; it is cleared when at least
                                                     1 byte is written to the Transmitter FIFO.                                */
            uint32_t            : 1;
      __IM  uint32_t rxfifo_err : 1;            /*!< [7..7] Uart_rx_error1: In the FIFO mode, this bit (LSR bit7)
                                                     is set when there is at least on parity error, framing
                                                     error or break indication in the FIFO. LSR7 is clear when
                                                     the CPU reads the LSR, if there are no subsequent errors
                                                     in the FIFO.                                                              */
            uint32_t            : 24;
    } lsr_b;
  } ;

  union {
    __IM  uint32_t msr;                         /*!< (@ 0x00000018) Modem Status Register                                      */

    struct {
      __IM  uint32_t d_cts      : 1;            /*!< [0..0] Delta Clear to Send (DCTS) indicator1: The CTS line has
                                                     changed its state.0: Otherwise                                            */
      __IM  uint32_t d_dsr      : 1;            /*!< [1..1] Delta Data Set Ready (DDSR) indicator1: The DSR line
                                                     has changed its state.0: Otherwise                                        */
      __IM  uint32_t teri       : 1;            /*!< [2..2] Trailing Edge of Ring Indicator (TERI) detector. The
                                                     RI line has changed its state from low to high state                      */
      __IM  uint32_t d_dcd      : 1;            /*!< [3..3] Delta Data Carrier Detect (DDCD) indicator1: The DCD
                                                     line has changed its state.0: Otherwise.                                  */
      __IM  uint32_t r_cts      : 1;            /*!< [4..4] Complement of the CTS input or equals to RTS in loopback
                                                     mode.                                                                     */
      __IM  uint32_t r_dsr      : 1;            /*!< [5..5] Complement of the DSR input or equals to DTR in loopback
                                                     mode.                                                                     */
      __IM  uint32_t r_ri       : 1;            /*!< [6..6] Complement of the RI input or equals to Out1 in loopback
                                                     mode.                                                                     */
      __IM  uint32_t r_dcd      : 1;            /*!< [7..7] Complement of the DCD input or equals to Out2 in loopback
                                                     mode.                                                                     */
            uint32_t            : 24;
    } msr_b;
  } ;

  union {
    __IOM uint32_t scr;                         /*!< (@ 0x0000001C) Scratch Pad Register                                       */

