Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
            uint32_t            : 3;
      __IOM uint32_t pin_lb_test : 1;           /*!< [3..3] For uart IP txd/rxd/rts/cts pin loopback test                      */
      __IM  uint32_t fl_frame_err : 1;          /*!< [4..4] RSVD                                                               */
      __IM  uint32_t fl_set_bi_err : 1;         /*!< [5..5] RSVD                                                               */
      __IOM uint32_t rx_break_int_en : 1;       /*!< [6..6] rx break signal interrupt enable                                   */
      __IOM uint32_t rx_break_int_sts : 1;      /*!< [7..7] rx break signal interrupt status. Write one clear.                 */
      __IOM uint32_t dbg_sel    : 4;            /*!< [11..8] Debug port selection                                              */
            uint32_t            : 4;
      __IOM uint32_t xfactor_adj : 11;          /*!< [26..16] One factor of Baud rate calculation, i.e., the ovsr_adj[10:0]
                                                     of following formula.                                                     */
            uint32_t            : 5;
    } scr_b;
  } ;

  union {
    __IOM uint32_t stsr;                        /*!< (@ 0x00000020) STS Register                                               */

    struct {
            uint32_t            : 3;
      __IOM uint32_t reset_rcv  : 1;            /*!< [3..3] Reset Uart Receiver                                                */
      __IOM uint32_t xfactor    : 4;            /*!< [7..4] Factor of Baud rate calculation, i.e., the ovsr[3:0]
                                                     of following formula.                                                     */
            uint32_t            : 16;
      __IM  uint32_t dma_mode   : 1;            /*!< [24..24] dma_mode field of FCR bit[3]                                     */
      __IM  uint32_t fifo_en    : 1;            /*!< [25..25] fifo_en field of FCR bit[0]                                      */
      __IM  uint32_t txfifo_low_level : 1;      /*!< [26..26] txfifo_low_level in FCR bit[5], Define the Transmission
                                                     FIFO Low Water Level Interrupt trigger.0: 4 byte1: 8 bytes                */
      __IM  uint32_t rxfifo_trigger_level : 2;  /*!< [28..27] rxfifo_trigger_level in FCR bit[7:6], Define the 32-entries
                                                     Receiver FIFO Interrupt trigger level 0~31 bytes00: 1 byte01:
                                                     8 bytes10: 16 bytes11: 28 bytes (for some device detect
                                                     RTS de-assertion slower, reserve more RX FIFO space to
                                                     prevent RX FIFO overflow )                                                */
            uint32_t            : 3;
    } stsr_b;
  } ;

  union {
    union {
      __IM  uint32_t rbr;                       /*!< (@ 0x00000024) Receiver Buffer Register                                   */

      struct {
        __IM  uint32_t rxdata   : 8;            /*!< [7..0] Rx data.Note: Bit 0 is the least significant bit. It
                                                     is the first bit serially received.                                       */
              uint32_t          : 24;
      } rbr_b;
    } ;

    union {
      __OM  uint32_t thr;                       /*!< (@ 0x00000024) Transmitter Holder Register                                */

      struct {
        __OM  uint32_t txdata   : 8;            /*!< [7..0] Tx data.Note: Bit 0 is the least significant bit. It
                                                     is the first bit serially transmitted.                                    */
              uint32_t          : 24;
      } thr_b;
    } ;
  };

  union {
    __IOM uint32_t miscr;                       /*!< (@ 0x00000028) MISC Control Register                                      */

    struct {
      __IOM uint32_t irda_enable : 1;           /*!< [0..0] 1: UART is co-work with IRDA SIR mode. i.e., txd/rxd
                                                     are irda signals0: UART mode only.                                        */
      __IOM uint32_t txdma_en   : 1;            /*!< [1..1] 1: txdma is enabled (valid when dma_mode in FCR is 1'b1)0:
                                                     txdma is disabled                                                         */
      __IOM uint32_t rxdma_en   : 1;            /*!< [2..2] 1: rxdma is enabled (valid when dma_mode in FCR is 1'b1)0:
                                                     rxdma is disabled                                                         */
      __IOM uint32_t txdma_burstsize : 5;       /*!< [7..3] Txdma burstsize                                                    */
      __IOM uint32_t rxdma_burstsize : 6;       /*!< [13..8] Rxdma burstsize                                                   */
      __IOM uint32_t irda_tx_inv : 1;           /*!< [14..14] Invert irda_tx_o when 1; Default is 0;Note: Default
                                                     IRDA TX Pulse is High Active                                              */
      __IOM uint32_t irda_rx_inv : 1;           /*!< [15..15] Invert irda_rx_i when 1;Default is 0;Note: Default
                                                     IRDA RX pulse is Low Active                                               */
            uint32_t            : 16;
    } miscr_b;
  } ;

  union {
    __IOM uint32_t txplsr;                      /*!< (@ 0x0000002C) IRDA SIR TX Pulse Width Control 0 Register                 */

    struct {
      __IOM uint32_t txpulse_lowbound_shiftval : 15;/*!< [14..0] The shift value of SIR tx pulse's left edge positionThe
                                                     nominal IRDA SIR tx pulse width is 3/16 bit time. If want
                                                     to increase or decrease the left edge position of tx pulse
                                                     then must change the value. Note: In time unit of uart
                                                     clock period. Nominally the 10ns.(100Mhz uart clk)                        */
      __IOM uint32_t lowbound_shiftright : 1;   /*!< [15..15] 0: shift left (minus offset value of txplsr[14:0])1:
                                                     shift right (plus offset value txplsr[14:0])                              */
      __IOM uint32_t txpulse_upperbound_shiftval : 15;/*!< [30..16] The shift value of SIR tx pulse's right edge position.
                                                     The nominal IRDA SIR tx pulse width is 3/16 bit time. If
                                                     want to increase or decrease the right edge position of
                                                     tx pulse then must change this value. Note: In time unit
                                                     of uart clock period. Nominally the 10ns.(100Mhz uart clk)                */
      __IOM uint32_t upperbound_shiftright : 1; /*!< [31..31] 0: shift left (minus offset value of txplsr[30:16])1:
                                                     shift right (plus offset value txplsr[30:16])                             */
    } txplsr_b;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __IM  uint32_t dbg_uart;                    /*!< (@ 0x0000003C) Debug Register                                             */

