Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t rf_match_int_en : 1;       /*!< [0..0] The Rx filter pattern matched interrupt enabling control:1:
                                                     enable0: disable                                                          */
      __IOM uint32_t rf_timeout_int_en : 1;     /*!< [1..1] The Rx filter idle timeout interrupt enabling control:1:
                                                     enable0: disable                                                          */
      __IOM uint32_t tx_fifo_lv_int_en : 1;     /*!< [2..2] The TX FIFO water level interrupt enabling control:1:
                                                     enable0: disable                                                          */
      __IOM uint32_t rx_idle_timeout_en : 1;    /*!< [3..3] The RX idle timeout interrupt enabling control:1: enable0:
                                                     disable                                                                   */
            uint32_t            : 28;
    } vier_b;
  } ;

  union {
    __IOM uint32_t ritor;                       /*!< (@ 0x00000060) RX Idle Timeout Register                                   */

    struct {
      __IOM uint32_t rxidle_timeout_value : 4;  /*!< [3..0] Time unit is the duration of a UART bit, depends on the
                                                     baud-rate setting. Default 0.0: 8 bit time. (1*8)1: 16
                                                     bit time. (2*8)2: 32 bit time. (2^2*8)3: 64 bit time. (2^3*8)4:
                                                     128 bit time. (2^4*8)5: 256 bit time. (2^5*8)6: 512 bit
                                                     time. (2^6*8)7: 1024 bit time. (2^7*8)8: 2048 bit time.
                                                     (2^8*8)9: 4096 bit time. (2^9*8)10: 8192 bit time. (2^10*8)11:
                                                     16384 bit time. (2^11*8)12: 32768 bit time. (2^12*8)13:
                                                     65535 bit time. (2^13*8)14: 131072 bit time. (2^14*8)15:
                                                     262144 bit time                                                           */
            uint32_t            : 27;
      __IOM uint32_t rx_idle_timeout_en : 1;    /*!< [31..31] RX idle timeout enable, default 0.                               */
    } ritor_b;
  } ;
} UART_TypeDef;                                   /*!< Size = 100 (0x64)                                                         */



/* =========================================================================================================================== */
/* ================                                           SSI0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SSI supports 8 bit and 16 bit frame format with different combination of clock phase and clock polarity(mode 0 ~ mode 3). SSI0 & SSI1 are SPI master devices. SSI2 & SSI3 are slave devices. (SSI0)
  */

typedef struct {                                /*!< (@ 0x40042800) SSI0 Structure                                             */

  union {
    __IOM uint32_t ctrlr0;                      /*!< (@ 0x00000000) SSI Control Register 0                                     */

    struct {
      __IOM uint32_t dfs        : 4;            /*!< [3..0] RSVD                                                               */
      __IOM uint32_t frf        : 2;            /*!< [5..4] RSVD                                                               */
      __IOM uint32_t scph       : 1;            /*!< [6..6] RSVD                                                               */
      __IOM uint32_t scpol      : 1;            /*!< [7..7] RSVD                                                               */
      __IOM uint32_t tmod       : 2;            /*!< [9..8] RSVD                                                               */
      __IOM uint32_t slv_oe     : 1;            /*!< [10..10] RSVD                                                             */
            uint32_t            : 1;
      __IOM uint32_t cfs        : 4;            /*!< [15..12] RSVD                                                             */
            uint32_t            : 5;
      __IOM uint32_t tx_byte_swap : 1;          /*!< [21..21] RSVD                                                             */
      __IOM uint32_t tx_bit_swap : 1;           /*!< [22..22] RSVD                                                             */
      __IOM uint32_t rx_byte_swap : 1;          /*!< [23..23] RSVD                                                             */
      __IOM uint32_t rx_bit_swap : 1;           /*!< [24..24] RSVD                                                             */
            uint32_t            : 6;
      __IOM uint32_t ss_t       : 1;            /*!< [31..31] RSVD                                                             */
    } ctrlr0_b;
  } ;

  union {
    __IOM uint32_t ctrlr1;                      /*!< (@ 0x00000004) SSI Control Register 1                                     */

    struct {
      __IOM uint32_t ndf        : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } ctrlr1_b;
  } ;

  union {
    __IOM uint32_t ssienr;                      /*!< (@ 0x00000008) SSI Enable Register                                        */

    struct {
      __IOM uint32_t ssi_en     : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } ssienr_b;
  } ;

  union {
    __IOM uint32_t mwcr;                        /*!< (@ 0x0000000C) Microwire Control Register                                 */

    struct {
      __IOM uint32_t mwmod      : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t mdd        : 1;            /*!< [1..1] RSVD                                                               */
      __IOM uint32_t mhs        : 1;            /*!< [2..2] RSVD                                                               */
            uint32_t            : 29;
    } mwcr_b;
  } ;

  union {
    __IOM uint32_t ser;                         /*!< (@ 0x00000010) Slave Enable Register                                      */

