Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t ser        : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } ser_b;
  } ;

  union {
    __IOM uint32_t baudr;                       /*!< (@ 0x00000014) Baud Rate Select Register                                  */

    struct {
      __IOM uint32_t sckdv      : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } baudr_b;
  } ;

  union {
    __IOM uint32_t txftlr;                      /*!< (@ 0x00000018) Transmit FIFO Threshold Level                              */

    struct {
      __IOM uint32_t tft        : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } txftlr_b;
  } ;

  union {
    __IOM uint32_t rxftlr;                      /*!< (@ 0x0000001C) Receive FIFO Threshold Level                               */

    struct {
      __IOM uint32_t rft        : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } rxftlr_b;
  } ;

  union {
    __IOM uint32_t txflr;                       /*!< (@ 0x00000020) Transmit FIFO Level Register                               */

    struct {
      __IM  uint32_t txtfl      : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } txflr_b;
  } ;

  union {
    __IM  uint32_t rxflr;                       /*!< (@ 0x00000024) Receive FIFO Level Register                                */

    struct {
      __IM  uint32_t rxtfl      : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } rxflr_b;
  } ;

  union {
    __IM  uint32_t sr;                          /*!< (@ 0x00000028) Status Register                                            */

    struct {
      __IM  uint32_t busy       : 1;            /*!< [0..0] RSVD                                                               */
      __IM  uint32_t tfnf       : 1;            /*!< [1..1] RSVD                                                               */
      __IM  uint32_t tfe        : 1;            /*!< [2..2] RSVD                                                               */
      __IM  uint32_t rfne       : 1;            /*!< [3..3] RSVD                                                               */
      __IM  uint32_t rff        : 1;            /*!< [4..4] RSVD                                                               */
      __IM  uint32_t txe        : 1;            /*!< [5..5] RSVD                                                               */
            uint32_t            : 26;
    } sr_b;
  } ;

  union {
    union {
      __IOM uint32_t imr;                       /*!< (@ 0x0000002C) Interrupt Mask Register                                    */

      struct {
        __IOM uint32_t txeim    : 1;            /*!< [0..0] RSVD                                                               */
        __IOM uint32_t txoim    : 1;            /*!< [1..1] RSVD                                                               */
        __IOM uint32_t rxuim    : 1;            /*!< [2..2] RSVD                                                               */
        __IOM uint32_t rxoim    : 1;            /*!< [3..3] RSVD                                                               */
        __IOM uint32_t rxfim    : 1;            /*!< [4..4] RSVD                                                               */
        __IOM uint32_t mstim    : 1;            /*!< [5..5] RSVD                                                               */
        __IOM uint32_t txuim    : 1;            /*!< [6..6] RSVD                                                               */
        __IOM uint32_t ssrim    : 1;            /*!< [7..7] RSVD                                                               */
              uint32_t          : 24;
      } imr_b;
    } ;

    union {
      __IOM uint32_t imr_slv;                   /*!< (@ 0x0000002C) Interrupt Mask of RTK-SPI Slave Register                   */

      struct {
        __IOM uint32_t txeim    : 1;            /*!< [0..0] RSVD                                                               */
        __IOM uint32_t txoim    : 1;            /*!< [1..1] RSVD                                                               */
        __IOM uint32_t rxuim    : 1;            /*!< [2..2] RSVD                                                               */
        __IOM uint32_t rxoim    : 1;            /*!< [3..3] RSVD                                                               */
        __IOM uint32_t rxfim    : 1;            /*!< [4..4] RSVD                                                               */
        __IOM uint32_t faeim    : 1;            /*!< [5..5] RSVD                                                               */
        __IOM uint32_t txuim    : 1;            /*!< [6..6] RSVD                                                               */
        __IOM uint32_t ssrim    : 1;            /*!< [7..7] RSVD                                                               */
              uint32_t          : 24;
      } imr_slv_b;
    } ;
  };

  union {
    union {
      __IM  uint32_t isr;                       /*!< (@ 0x00000030) Interrupt Status Register                                  */

      struct {
        __IM  uint32_t txeis    : 1;            /*!< [0..0] RSVD                                                               */
        __IM  uint32_t txois    : 1;            /*!< [1..1] RSVD                                                               */
        __IM  uint32_t rxuis    : 1;            /*!< [2..2] RSVD                                                               */
        __IM  uint32_t rxois    : 1;            /*!< [3..3] RSVD                                                               */
        __IM  uint32_t rxfis    : 1;            /*!< [4..4] RSVD                                                               */
        __IM  uint32_t mstis    : 1;            /*!< [5..5] RSVD                                                               */
        __IM  uint32_t txuis    : 1;            /*!< [6..6] RSVD                                                               */
        __IM  uint32_t ssris    : 1;            /*!< [7..7] RSVD                                                               */
              uint32_t          : 24;
      } isr_b;
    } ;

    union {
      __IM  uint32_t isr_slv;                   /*!< (@ 0x00000030) Interrupt Status Register                                  */

