Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
      struct {
        __IM  uint32_t txeis    : 1;            /*!< [0..0] RSVD                                                               */
        __IM  uint32_t txois    : 1;            /*!< [1..1] RSVD                                                               */
        __IM  uint32_t rxuis    : 1;            /*!< [2..2] RSVD                                                               */
        __IM  uint32_t rxois    : 1;            /*!< [3..3] RSVD                                                               */
        __IM  uint32_t rxfis    : 1;            /*!< [4..4] RSVD                                                               */
        __IM  uint32_t faeis    : 1;            /*!< [5..5] RSVD                                                               */
        __IM  uint32_t txuis    : 1;            /*!< [6..6] RSVD                                                               */
        __IM  uint32_t ssris    : 1;            /*!< [7..7] RSVD                                                               */
              uint32_t          : 24;
      } isr_slv_b;
    } ;
  };

  union {
    union {
      __IM  uint32_t risr;                      /*!< (@ 0x00000034) Raw Interrupt Status Register                              */

      struct {
        __IM  uint32_t txeir    : 1;            /*!< [0..0] RSVD                                                               */
        __IM  uint32_t txoir    : 1;            /*!< [1..1] RSVD                                                               */
        __IM  uint32_t rxuir    : 1;            /*!< [2..2] RSVD                                                               */
        __IM  uint32_t rxoir    : 1;            /*!< [3..3] RSVD                                                               */
        __IM  uint32_t rxfir    : 1;            /*!< [4..4] RSVD                                                               */
        __IM  uint32_t mstir    : 1;            /*!< [5..5] RSVD                                                               */
        __IM  uint32_t txuir    : 1;            /*!< [6..6] RSVD                                                               */
        __IM  uint32_t ssrir    : 1;            /*!< [7..7] RSVD                                                               */
              uint32_t          : 24;
      } risr_b;
    } ;

    union {
      __IM  uint32_t risr_slv;                  /*!< (@ 0x00000034) Raw Interrupt Status Register                              */

      struct {
        __IM  uint32_t txeir    : 1;            /*!< [0..0] RSVD                                                               */
        __IM  uint32_t txoir    : 1;            /*!< [1..1] RSVD                                                               */
        __IM  uint32_t rxuir    : 1;            /*!< [2..2] RSVD                                                               */
        __IM  uint32_t rxoir    : 1;            /*!< [3..3] RSVD                                                               */
        __IM  uint32_t rxfir    : 1;            /*!< [4..4] RSVD                                                               */
        __IM  uint32_t faeir    : 1;            /*!< [5..5] RSVD                                                               */
        __IM  uint32_t txuir    : 1;            /*!< [6..6] RSVD                                                               */
        __IM  uint32_t ssrir    : 1;            /*!< [7..7] RSVD                                                               */
              uint32_t          : 24;
      } risr_slv_b;
    } ;
  };

  union {
    __IM  uint32_t txoicr;                      /*!< (@ 0x00000038) Transmit FIFO Overflow Interrupt Clear Register            */

    struct {
      __IM  uint32_t txoicr     : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } txoicr_b;
  } ;

  union {
    __IM  uint32_t rxoicr;                      /*!< (@ 0x0000003C) Receive FIFO Overflow Interrupt Clear Register             */

    struct {
      __IM  uint32_t rxoicr     : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } rxoicr_b;
  } ;

  union {
    __IM  uint32_t rxuicr;                      /*!< (@ 0x00000040) Receive FIFO Underflow Interrupt Clear Register            */

    struct {
      __IM  uint32_t rxuicr     : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } rxuicr_b;
  } ;

  union {
    union {
      __IM  uint32_t msticr;                    /*!< (@ 0x00000044) Multi-Master Interrupt Clear Register                      */

      struct {
        __IM  uint32_t msticr   : 1;            /*!< [0..0] RSVD                                                               */
              uint32_t          : 31;
      } msticr_b;
    } ;

    union {
      __IM  uint32_t faeicr;                    /*!< (@ 0x00000044) Frame Alignment Interrupt Clear Register                   */

      struct {
        __IM  uint32_t faeicr   : 1;            /*!< [0..0] RSVD                                                               */
              uint32_t          : 31;
      } faeicr_b;
    } ;
  };

  union {
    __IM  uint32_t icr;                         /*!< (@ 0x00000048) Interrupt Clear Register                                   */
    
    struct {
      __IM  uint32_t icr        : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } icr_b;
  } ;
  
  union {
    __IOM uint32_t dmacr;                       /*!< (@ 0x0000004C) DMA Control Register                                       */
    
    struct {
      __IOM uint32_t rdmae      : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t tdmae      : 1;            /*!< [1..1] RSVD                                                               */
            uint32_t            : 30;
    } dmacr_b;
  } ;
  
  union {
    __IOM uint32_t dmatdlr;                     /*!< (@ 0x00000050) DMA Transmit Data Level Register                           */
    
