Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t dmatdl     : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } dmatdlr_b;
  } ;
  
  union {
    __IOM uint32_t dmardlr;                     /*!< (@ 0x00000054) DMA Receive Data Level Register                            */
    
    struct {
      __IOM uint32_t dmardl     : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } dmardlr_b;
  } ;
  
  union {
    __IM  uint32_t txuicr;                      /*!< (@ 0x00000058) Transmit FIFO Underflow Interrupt Clear Register           */
    
    struct {
      __IM  uint32_t txuicr     : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } txuicr_b;
  } ;
  
  union {
    __IM  uint32_t ssricr;                      /*!< (@ 0x0000005C) SS_N Rising Edge Detect Interrupt Clear Register           */
    
    struct {
      __IM  uint32_t ssiicr     : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } ssricr_b;
  } ;
  
  union {
    __IOM uint16_t dr;                          /*!< (@ 0x00000060) Data Register                                              */
    
    struct {
      __IOM uint16_t dr         : 16;           /*!< [15..0] RSVD                                                              */
    } dr_b;
  } ;
  __IM  uint16_t  RESERVED;
  __IM  uint32_t  RESERVED1[35];
  
  union {
    __IOM uint32_t rx_sample_dly;               /*!< (@ 0x000000F0) Rx Sample Delay Register                                   */
    
    struct {
      __IOM uint32_t rsd        : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } rx_sample_dly_b;
  } ;
} SSI_Type;                                    /*!< Size = 244 (0xf4)                                                         */



/* =========================================================================================================================== */
/* ================                                           I2C0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief I2C with 7-bit/10-bit SS/FS/HS mode in master and slave mode transmission (I2C0)
  */

/* =========================================================================================================================== */
/* ================                                            SI                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial Interface for setting the audio codec. (SI)
  */

typedef struct {                                /*!< (@ 0x40013000) SI Structure                                               */
  
  union {
    __IOM uint32_t ctrl;                        /*!< (@ 0x00000000) SI Control Register                                        */
    
    struct {
      __IOM uint32_t si_wr_start : 1;           /*!< [0..0] Write value to codec.0: This bit will be cleared when
                                                     wriring is done.1: Start to perform SI write to audio codec.              */
            uint32_t            : 3;
      __IOM uint32_t si_read_start : 1;         /*!< [4..4] Read value form codec0: This bit will be cleared when
                                                     reading is done.1: Start to perform SI read to audio codec.               */
            uint32_t            : 2;
      __IOM uint32_t si_disable : 1;            /*!< [7..7] 0: Si is enabled.1: Si is disabled.                                */
      __IOM uint32_t si_address : 8;            /*!< [15..8] Set the 8 bit address of audio codec.                             */
      __IOM uint32_t si_data    : 16;           /*!< [31..16] For si write, the data is written to the codec register.For
                                                     si read, the data is read out the codec register.                         */
    } ctrl_b;
  } ;
  
  union {
    __IOM uint32_t clk_ctrl;                    /*!< (@ 0x00000004) SI Clock Control Register                                  */
    
    struct {
      __IOM uint32_t reg_dk_en  : 1;            /*!< [0..0] To save power, reset this bit to gate CLK when the registers
                                                     are already programmed.0: Turn off the clock.1: Turn off
                                                     the clock of the register bank of audio codec.                            */
            uint32_t            : 31;
    } clk_ctrl_b;
  } ;
} SI_Type;                                      /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                           SPORT                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Audio interface for the codec (SPORT)
  */

typedef struct {                                /*!< (@ 0x40066000) SPORT Structure                                            */
  
  union {
    __OM  uint32_t sp_tx_fifo_0;                /*!< (@ 0x00000000) SPORT TX FIFO Register                                     */
    
    struct {
      __OM  uint32_t sp_tx_fifo_0 : 32;         /*!< [31..0] TX FIFO 0 address                                                 */
    } sp_tx_fifo_0_b;
  } ;
  
  union {
    __IOM uint32_t sp_con;                      /*!< (@ 0x00000004) SPORT Control Register                                     */
    
