Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t sp_reset   : 1;            /*!< [0..0] Reset SPORT0 module0: disable reset1: reset SPORT0 module.
                                                     Write 1 first and then write 0.                                           */
      __IOM uint32_t sp_tx_inv_i2s_sclk : 1;    /*!< [1..1] Sclk to TX path is inverted.0: sclk to TX path is not
                                                     inverted.1: sclk to TX path is inverted.                                  */
      __IOM uint32_t sp_rx_inv_i2s_sclk : 1;    /*!< [2..2] Sclk to RX path is inverted.0: sclk to RX path is not
                                                     inverted.1: sclk to RX path is inverted.                                  */
      __IOM uint32_t sp_slave_clk_sel : 1;      /*!< [3..3] I2S or PCM slave for CLK path.0: To be not an I2S or
                                                     PCM slave 1: To be an I2S or PCM slave                                    */
      __IOM uint32_t sp_slave_data_sel : 1;     /*!< [4..4] I2S or PCM slave for DATA path.0: To be not an I2S or
                                                     PCM slave 1: To be an I2S or PCM slave                                    */
      __IOM uint32_t sp_wclk_tx_inverse : 1;    /*!< [5..5] Inverte I2S/PCM word clock for TX.0: I2S/PCM word clock
                                                     is not inverted1: I2S/PCM word clock is inverted                          */
      __IOM uint32_t sp_loopback : 1;           /*!< [6..6] Self loopback mode.0: Off.1: Enable self loopback mode.            */
      __IOM uint32_t sp_mcu_ctl_mode : 1;       /*!< [7..7] Select DMA mode or FIFO mode.0: Internal DMA mode.1:
                                                     FIFO mode.                                                                */
      __IOM uint32_t sp_data_format_sel_tx : 2; /*!< [9..8] Set data format00: I2S01: Left Justified10: PCM mode
                                                     A11: PCM mode B                                                           */
      __IOM uint32_t sp_inv_i2s_sclk : 1;       /*!< [10..10] Set bclk inverter0: I2S and PCM sclk is not inverted1:
                                                     I2S and PCM sclk is inverted                                              */
      __IOM uint32_t sp_en_i2s_mono_tx_0 : 1;   /*!< [11..11] Set mono or stereo for TX00: stereo1: mono                       */
      __IOM uint32_t sp_data_len_sel_tx_0 : 3;  /*!< [14..12] Set the TX0 data length000: 16 bits001: 20 bits010:
                                                     24 bits100: 32 bitsOthers: Reserved                                       */
      __IOM uint32_t sp_i2s_self_lpbk_en : 1;   /*!< [15..15] Internal loopback mode.0: Internal loopback mode is
                                                     not enabled1: Internal loopback mode is enabled                           */
      __IOM uint32_t sp_tx_disable : 1;         /*!< [16..16] SPORT TX control.0: SPORT TX is enabled1: SPORT TX
                                                     is disabled                                                               */
      __IOM uint32_t sp_start_tx : 1;           /*!< [17..17] Start TX.0: TX is disabled1: TX is started                       */
      __IOM uint32_t sp_tdm_mode_sel_tx : 2;    /*!< [19..18] TDM TX channel control00: Without TDM01: 4 channels
                                                     in the TDM mode10: 6 channels in the TDM mode11: 8 channels
                                                     in the TDM mode                                                           */
      __IOM uint32_t sp_tdm_mode_sel_rx : 2;    /*!< [21..20] TDM RX channel control00: Without TDM01: 4 channels
                                                     in the TDM mode10: 6 channels in the TDM mode11: 8 channels
                                                     in the TDM mode                                                           */
      __IOM uint32_t sp_tx_lsb_first_0 : 1;     /*!< [22..22] MSB or LSB control for TX0.0: MSB first 1: LSB first             */
      __IOM uint32_t sp_rx_lsb_first_0 : 1;     /*!< [23..23] MSB or LSB control for RX0.0: MSB first 1: LSB first             */
      __IOM uint32_t sp_rx_disable : 1;         /*!< [24..24] SPORT RX control.0: SPORT RX is enabled1: SPORT RX
                                                     is disabled                                                               */
      __IOM uint32_t sp_start_rx : 1;           /*!< [25..25] Start RX.0: RX is disabled1: RX is started                       */
      __IOM uint32_t sp_sel_i2s_tx_ch : 2;      /*!< [27..26] Control L and R channel data for TX.00: L/R01: R/L10:
                                                     L/L11: R/RWithout TDM only                                                */
      __IOM uint32_t sp_sel_i2s_rx_ch : 2;      /*!< [29..28] Control L and R channel data for RX.00: L/R01: R/L10:
                                                     L/L11: R/RWithout TDM only                                                */
      __IOM uint32_t sp_mclk_sel : 2;           /*!< [31..30] Select MCLK output01 and 11: MCLK output = SP_SRC_CLK
                                                     / 100: MCLK output = SP_SRC_CLK / 210: MCLK output = SP_SRC_CLK
                                                     / 4                                                                       */
    } sp_con_b;
  } ;
  
  union {
    __IOM uint32_t sp_fifo_en_clk_con;          /*!< (@ 0x00000008) SPORT FIFO Enable and Clock Control Register               */
    
    struct {
      __IOM uint32_t sp_bclk_reset : 1;         /*!< [0..0] 0: Stop reset1: Stop BCLK, and reset the state machine
                                                     of the clock generator.                                                   */
      __IOM uint32_t sp_tx_fifo_reset : 1;      /*!< [1..1] 0: Stop reset1: Reset TX FIFO to make TX FIFO data become
                                                     zero                                                                      */
      __IOM uint32_t sp_rx_fifo_reset : 1;      /*!< [2..2] 0: Stop reset1: Reset RX FIFO to make TX FIFO data become
                                                     zero                                                                      */
            uint32_t            : 5;
      __IOM uint32_t sp_debug_bus_sel : 3;      /*!< [10..8] 000: Debug_bus_a001: Debug_bus_bect.                              */
      __IOM uint32_t sp_enable_mclk : 1;        /*!< [11..11] 0: Disable1: Enable MCLK                                         */
      __IOM uint32_t sp_clear_tx_err_cnt : 1;   /*!< [12..12] Write 1 and then write 0 to clear TX error counter.              */
      __IOM uint32_t sp_clear_rx_err_cnt : 1;   /*!< [13..13] Write 1 and then write 0 to clear RX error counter.              */
      __IOM uint32_t sp_clk_sel : 2;            /*!< [15..14] 00 and 01: SP_CLK = SP_SRC_CLK10: SP_CLK = SP_SRC_CLK
                                                     / 211: SP_CLK = SP_SRC_CLK / 4                                            */
            uint32_t            : 4;
      __IOM uint32_t sp_tx_src_byte_swap_0 : 1; /*!< [20..20] 0: Disable1: Swap H/L bytes read from the source memory
                                                     of TX_FIFO_0                                                              */
      __IOM uint32_t sp_tx_src_lr_swap_0 : 1;   /*!< [21..21] 0: Disable1: Swap L/R audio samples read from the source
                                                     memory of TX_FIFO_0                                                       */
      __IOM uint32_t sp_rx_snk_byte_swap_0 : 1; /*!< [22..22] 0: Disable1: Swap H/L bytes written to the sink memory
                                                     of RX_FIFO_0                                                              */
      __IOM uint32_t sp_rx_snk_lr_swap_0 : 1;   /*!< [23..23] 0: Disable1: Swap L/R audio samples written to the
                                                     sink memory of RX_FIFO_0                                                  */
      __IOM uint32_t sp_tx_fifo_0_ch0_1_en : 1; /*!< [24..24] 0: Disable1: Enable the CH0 and CH1 of TX_FIFO_0                 */
      __IOM uint32_t sp_tx_fifo_0_ch2_3_en : 1; /*!< [25..25] 0: Disable1: Enable the CH2 and CH3 of TX_FIFO_0                 */
      __IOM uint32_t sp_tx_fifo_1_ch4_5_en : 1; /*!< [26..26] 0: Disable1: Enable the CH4 and CH5 of TX_FIFO_1                 */
      __IOM uint32_t sp_tx_fifo_1_ch6_7_en : 1; /*!< [27..27] 0: Disable1: Enable the CH6 and CH7 of TX_FIFO_1                 */
      __IOM uint32_t sp_rx_fifo_0_ch0_1_en : 1; /*!< [28..28] 0: Disable1: Enable the CH0 and CH1 of RX_FIFO_0                 */
      __IOM uint32_t sp_rx_fifo_0_ch2_3_en : 1; /*!< [29..29] 0: Disable1: Enable the CH2 and CH3 of RX_FIFO_0                 */
      __IOM uint32_t sp_rx_fifo_1_ch4_5_en : 1; /*!< [30..30] 0: Disable1: Enable the CH4 and CH5 of RX_FIFO_1                 */
      __IOM uint32_t sp_rx_fifo_1_ch6_7_en : 1; /*!< [31..31] 0: Disable1: Enable the CH6 and CH7 of RX_FIFO_1                 */
    } sp_fifo_en_clk_con_b;
  } ;
  
  union {
    __IOM uint32_t sp_fifo_intr_con;            /*!< (@ 0x0000000C) SPORT FIFO Interrupt Control Register                      */
    
