Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t sp_clr_tx_fifo_th_intr_0 : 1;/*!< [0..0] For MCU mode (bypass DMA), F/W writes 1 and then 0 to
                                                     clear RX interrupt.Note: TX interrupt is to indicate that
                                                     MCU can write audio data to TX FIFO_0                                     */
      __IOM uint32_t sp_clr_rx_fifo_th_intr_0 : 1;/*!< [1..1] For MCU mode (bypass DMA), F/W writes 1 and then 0 to
                                                     clear RX interrupt.Note: RX interrupt is to indicate that
                                                     MCU can get audio data from RX FIFO_0                                     */
      __IOM uint32_t sp_clr_tx_fifo_full_intr_0 : 1;/*!< [2..2] Clear TX FIFO_0 full interrupt. F/W writes 1 and then
                                                     0 to clear TX interrupt.                                                  */
      __IOM uint32_t sp_clr_rx_fifo_full_intr_0 : 1;/*!< [3..3] Clear RX FIFO_0 full interrupt. F/W writes 1 and then
                                                     0 to clear RX interrupt.                                                  */
      __IOM uint32_t sp_clr_tx_fifo_empty_0 : 1;/*!< [4..4] Clear TX FIFO_0 empty interrupt. F/W writes 1 and then
                                                     0 to clear TX interrupt.                                                  */
      __IOM uint32_t sp_clr_rx_fifo_empty_0 : 1;/*!< [5..5] Clear RX FIFO_0 empty interrupt. F/W writes 1 and then
                                                     0 to clear RX interrupt.                                                  */
      __IOM uint32_t sp_clr_tx_idle_intr_0 : 1; /*!< [6..6] Clear TX FIFO_0 idle interrupt. F/W writes 1 and then
                                                     0 to clear TX interrupt.                                                  */
      __IOM uint32_t sp_clr_tx_fifo_th_intr_1 : 1;/*!< [7..7] For MCU mode (bypass DMA), F/W writes 1 and then 0 to
                                                     clear RX interrupt.Note: TX interrupt is to indicate that
                                                     MCU can write audio data to TX FIFO_1                                     */
      __IOM uint32_t sp_clr_rx_fifo_th_intr_1 : 1;/*!< [8..8] For MCU mode (bypass DMA), F/W writes 1 and then 0 to
                                                     clear RX interrupt.Note: RX interrupt is to indicate that
                                                     MCU can get audio data from RX FIFO_1                                     */
      __IOM uint32_t sp_clr_tx_fifo_full_intr_1 : 1;/*!< [9..9] Clear TX FIFO_1 full interrupt. F/W writes 1 and then
                                                     0 to clear TX interrupt.                                                  */
      __IOM uint32_t sp_clr_rx_fifo_full_intr_1 : 1;/*!< [10..10] Clear RX FIFO_1 full interrupt. F/W writes 1 and then
                                                     0 to clear RX interrupt.                                                  */
      __IOM uint32_t sp_clr_tx_fifo_empty_1 : 1;/*!< [11..11] Clear TX FIFO_1 empty interrupt. F/W writes 1 and then
                                                     0 to clear TX interrupt.                                                  */
      __IOM uint32_t sp_clr_rx_fifo_empty_1 : 1;/*!< [12..12] Clear RX FIFO_1 empty interrupt. F/W writes 1 and then
                                                     0 to clear RX interrupt.                                                  */
      __IOM uint32_t sp_clr_tx_idle_intr_1 : 1; /*!< [13..13] Clear TX FIFO_1 idle interrupt. F/W writes 1 and then
                                                     0 to clear TX interrupt.                                                  */
            uint32_t            : 2;
      __IOM uint32_t sp_tx_fifo_th_intr_0_en : 1;/*!< [16..16] 0: Disable1: When TX FIFO_0 level is less than SP_TX_FIFO_TH,
                                                     generate the interrupt.                                                   */
      __IOM uint32_t sp_rx_fifo_th_intr_0_en : 1;/*!< [17..17] 0: Disable1: When RX FIFO_0 level is greater than SP_RX_FIFO_TH,
                                                     generate the interrupt.                                                   */
      __IOM uint32_t sp_tx_fifo_full_intr_0_en : 1;/*!< [18..18] 0: Disable1: Enable TX FIFO_0 full interrupt                  */
      __IOM uint32_t sp_rx_fifo_full_intr_0_en : 1;/*!< [19..19] 0: Disable1: Enable RX FIFO_0 full interrupt                  */
      __IOM uint32_t sp_tx_fifo_empty_0_en : 1; /*!< [20..20] 0: Disable1: Enable TX FIFO_0 empty interrupt                    */
      __IOM uint32_t sp_rx_fifo_empty_0_en : 1; /*!< [21..21] 0: Disable1: Enable RX FIFO_0 empty interrupt                    */
      __IOM uint32_t sp_tx_idle_intr_0_en : 1;  /*!< [22..22] 0: Disable1: Generate the interrupt when TX is working,
                                                     and TX FIFO_0 is empty.                                                   */
            uint32_t            : 1;
      __IOM uint32_t sp_tx_fifo_th_intr_1_en : 1;/*!< [24..24] 0: Disable1: When TX FIFO_1 level is less than SP_TX_FIFO_TH,
                                                     generate the interrupt.                                                   */
      __IOM uint32_t sp_rx_fifo_th_intr_1_en : 1;/*!< [25..25] 0: Disable1: When RX FIFO_1 level is greater than SP_RX_FIFO_TH,
                                                     generate the interrupt.                                                   */
      __IOM uint32_t sp_tx_fifo_full_intr_1_en : 1;/*!< [26..26] 0: Disable1: Enable TX FIFO_1 full interrupt                  */
      __IOM uint32_t sp_rx_fifo_full_intr_1_en : 1;/*!< [27..27] 0: Disable1: Enable RX FIFO_1 full interrupt                  */
      __IOM uint32_t sp_tx_fifo_empty_1_en : 1; /*!< [28..28] 0: Disable1: Enable TX FIFO_1 empty interrupt                    */
      __IOM uint32_t sp_rx_fifo_empty_1_en : 1; /*!< [29..29] 0: Disable1: Enable RX FIFO_1 empty interrupt                    */
      __IOM uint32_t sp_tx_idle_intr_1_en : 1;  /*!< [30..30] 0: Disable1: Generate the interrupt when TX is working,
                                                     and TX FIFO_1 is empty.                                                   */
            uint32_t            : 1;
    } sp_fifo_intr_con_b;
  } ;
  
  union {
    __IM  uint32_t sp_rx_fifo_0;                /*!< (@ 0x00000010) SPORT RX FIFO_0 Register                                   */
    
