Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IM  uint32_t sp_rx_fifo_0 : 32;         /*!< [31..0] RX FIFO_0 data register                                           */
    } sp_rx_fifo_0_b;
  } ;
  
  union {
    __IM  uint32_t sp_fifo_cnt_sta;             /*!< (@ 0x00000014) SPORT FIFO Counter Status Register                         */
    
    struct {
      __IM  uint32_t sp_tx_depth_cnt_0 : 6;     /*!< [5..0] Read TX FIFO_0 depth status.When TX FIFO_0 is empty,
                                                     this value shows 32.                                                      */
            uint32_t            : 2;
      __IM  uint32_t sp_rx_depth_cnt_0 : 6;     /*!< [13..8] Read RX FIFO_0 depth status.When RX FIFO_0 is empty,
                                                     this value shows 32.                                                      */
            uint32_t            : 2;
      __IM  uint32_t sp_tx_depth_cnt_1 : 6;     /*!< [21..16] Read TX FIFO_1 depth status.When TX FIFO_1 is empty,
                                                     this value shows 32.                                                      */
            uint32_t            : 2;
      __IM  uint32_t sp_rx_depth_cnt_1 : 6;     /*!< [29..24] Read RX FIFO_1 depth status.When RX FIFO_1 is empty,
                                                     this value shows 32.                                                      */
            uint32_t            : 2;
    } sp_fifo_cnt_sta_b;
  } ;
  
  union {
    __IM  uint32_t sp_tx_rx_err_sta;            /*!< (@ 0x00000018) SPORT TX and RX Error Status Register                      */
    
    struct {
      __IM  uint32_t sp_tx_err_cnt : 16;        /*!< [15..0] TX error counterNote: This counter should always be
                                                     zero if everything works well.                                            */
      __IM  uint32_t sp_rx_err_cnt : 16;        /*!< [31..16] RX error counterNote: This counter should always be
                                                     zero if everything works well.                                            */
    } sp_tx_rx_err_sta_b;
  } ;
  
  union {
    __IOM uint32_t sp_tx_fra_div;               /*!< (@ 0x0000001C) SPORT TX Fractional Divider Register                       */
    
    struct {
      __IOM uint32_t sp_tx_mi   : 16;           /*!< [15..0] BCLK = 40MHz x (ni/mi) For example: BCLK=3.072MHz=40MHz
                                                     x (48/625)                                                                */
      __IOM uint32_t sp_tx_ni   : 15;           /*!< [30..16] the same mi                                                      */
      __IOM uint32_t sp_tx_mi_ni_update : 1;    /*!< [31..31] Update mi and ni.0: Off1: To update mi and ni to get
                                                     the new clock rate. This bit will be reset automatically
                                                     when the update is done.                                                  */
    } sp_tx_fra_div_b;
  } ;
  
  union {
    __IOM uint32_t sp_lrck_fifo_th_con;         /*!< (@ 0x00000020) SPORT LRCK and FIFO Threshold Control Register             */
    
    struct {
      __IOM uint32_t sp_tx_fifo_th : 6;         /*!< [5..0] Set TX FIFO interrupt and DMA request threshold.                   */
            uint32_t            : 2;
      __IOM uint32_t sp_rx_fifo_th : 6;         /*!< [13..8] Set RX FIFO interrupt and DMA request threshold.                  */
            uint32_t            : 2;
      __IOM uint32_t sp_bclk_div_ratio : 8;     /*!< [23..16] Control LRCK divider.                                            */
      __IOM uint32_t sp_rx_bclk_div_ratio : 8;  /*!< [31..24] Control RX LRCK divider.                                         */
    } sp_lrck_fifo_th_con_b;
  } ;
  
  union {
    __IM  uint32_t sp_fifo_intr_sta;            /*!< (@ 0x00000024) SPORT FIFO Interrupt Status Register                       */
    
    struct {
      __IM  uint32_t sp_tx_fifo_th_intr_0 : 1;  /*!< [0..0] Interrupt status1: It is ready to send data out                    */
      __IM  uint32_t sp_rx_fifo_th_intr_0 : 1;  /*!< [1..1] Interrupt status1: It is ready to send data out                    */
      __IM  uint32_t sp_tx_fifo_full_intr_0 : 1;/*!< [2..2] Interrupt status1: TX FIFO_0 is full                               */
      __IM  uint32_t sp_rx_fifo_full_intr_0 : 1;/*!< [3..3] Interrupt status1: RX FIFO_0 is full                               */
      __IM  uint32_t sp_tx_fifo_empty_intr_0 : 1;/*!< [4..4] Interrupt status1: TX FIFO_0 is empty                             */
      __IM  uint32_t sp_rx_fifo_empty_intr_0 : 1;/*!< [5..5] Interrupt status1: TX FIFO_0 is empty                             */
      __IM  uint32_t sp_tx_idle_intr_0 : 1;     /*!< [6..6] Interrupt status1: TX is working but FIFO_0 is empty.              */
      __IM  uint32_t sp_tx_fifo_th_intr_1 : 1;  /*!< [7..7] Interrupt status1: It is ready to send data out                    */
      __IM  uint32_t sp_rx_fifo_th_intr_1 : 1;  /*!< [8..8] Interrupt status1: It is ready to receive data                     */
      __IM  uint32_t sp_tx_fifo_full_intr_1 : 1;/*!< [9..9] Interrupt status1: TX FIFO_1 is full                               */
      __IM  uint32_t sp_rx_fifo_full_intr_1 : 1;/*!< [10..10] Interrupt status1: RX FIFO_1 is full                             */
      __IM  uint32_t sp_tx_fifo_empty_intr_1 : 1;/*!< [11..11] Interrupt status1: TX FIFO_1 is empty                           */
      __IM  uint32_t sp_rx_fifo_empty_intr_1 : 1;/*!< [12..12] Interrupt status1: RX FIFO_1 is empty                           */
      __IM  uint32_t sp_tx_idle_intr_1 : 1;     /*!< [13..13] Interrupt status1: TX is working but FIFO_1 is empty.            */
            uint32_t            : 10;
      __IM  uint32_t sp_tx_fifo_full_1 : 1;     /*!< [24..24] TX FIFO raw status1: TX FIFO_1 is full                           */
      __IM  uint32_t sp_rx_fifo_full_1 : 1;     /*!< [25..25] RX FIFO raw status1: RX FIFO_1 is full                           */
      __IM  uint32_t sp_tx_fifo_empty_1 : 1;    /*!< [26..26] TX FIFO raw status1: TX FIFO_1 is empty                          */
      __IM  uint32_t sp_rx_fifo_empty_1 : 1;    /*!< [27..27] RX FIFO raw status1: RX FIFO_1 is empty                          */
      __IM  uint32_t sp_tx_fifo_full_0 : 1;     /*!< [28..28] TX FIFO raw status1: TX FIFO_0 is full                           */
      __IM  uint32_t sp_rx_fifo_full_0 : 1;     /*!< [29..29] RX FIFO raw status1: RX FIFO_0 is full                           */
      __IM  uint32_t sp_tx_fifo_empty_0 : 1;    /*!< [30..30] TX FIFO raw status1: TX FIFO_0 is empty                          */
      __IM  uint32_t sp_rx_fifo_empty_0 : 1;    /*!< [31..31] RX FIFO raw status1: RX FIFO_0 is empty                          */
    } sp_fifo_intr_sta_b;
  } ;
  
  union {
    __IOM uint32_t sp_form_con;                 /*!< (@ 0x00000028) SPORT Format Control                                       */
    
