Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t sp_trx_same_fs : 1;        /*!< [0..0] Support TX and RX use different sample rates.0: TX and
                                                     RX do not have the same sampling rate1: TX and RX have
                                                     the same sampling rate                                                    */
      __IOM uint32_t sp_trx_same_ch : 1;        /*!< [1..1] 0: Do not have the same channel setting.1: Have the same
                                                     channel setting. Both are either stereo or mono.                          */
      __IOM uint32_t sp_trx_same_length : 1;    /*!< [2..2] 0: Do not have the same data length.1: Have the same
                                                     data length.                                                              */
      __IOM uint32_t sp_bclk_out_inverse : 1;   /*!< [3..3] 0: Disable1: Invert the phase of BCLK                              */
            uint32_t            : 1;
      __IOM uint32_t sp_bclk_rx_inverse : 1;    /*!< [5..5] 0: Disable1: Invert the phase of LRCK_RX                           */
      __IOM uint32_t sp_fixed_bclk_sel : 1;     /*!< [6..6] 0: BCLK is fixed at SP_CLK / 41: BCLK is fixed at SP_CLK
                                                     / 2                                                                       */
      __IOM uint32_t sp_fixed_bclk : 1;         /*!< [7..7] 0: Disable the fixed BCLK1: Enable the fixed BCLK                  */
      __IOM uint32_t sp_data_format_sel_rx : 2; /*!< [9..8] It is valid if SP_TRX_SAME_FS is 0.Data format of SD_I00:
                                                     I2S01: Left Justified10: PCM mode A11: PCM mode B                         */
      __IOM uint32_t sp_trx_same_lrck : 1;      /*!< [10..10] 0: LRCK_RX is not as same as LRCK1: LRCK_RX is as same
                                                     as LRCK                                                                   */
      __IOM uint32_t sp_en_i2s_mono_rx_0 : 1;   /*!< [11..11] It is valid if SP_TRX_SAME_FS is 0.Data format of SD_I0:
                                                     stereo1: mono                                                             */
      __IOM uint32_t sp_data_len_sel_rx_0 : 3;  /*!< [14..12] It is valid if SP_TRX_SAME_FS is 0.Data length of SD_I000:
                                                     16 bits001: 20 bits010: 24 bits100: 32 bitsOthers: Reserved               */
            uint32_t            : 9;
      __IOM uint32_t sp_ch_len_sel_tx : 3;      /*!< [26..24] Set TX channel length.000: 16 bits001: 20 bits010:
                                                     24 bits100: 32 bitsOthers: Reserved                                       */
            uint32_t            : 1;
      __IOM uint32_t sp_ch_len_sel_rx : 3;      /*!< [30..28] Set RX channel length.000: 16 bits001: 20 bits010:
                                                     24 bits100: 32 bitsOthers: Reserved                                       */
      __IOM uint32_t sp_trx_same_ch_len : 1;    /*!< [31..31] 0: TX and RX channel length according to SP_CH_LEN_SEL_RX
                                                     and SP_CH_LEN_SEL_RX.1: Force that TX and RX have the same
                                                     channel length                                                            */
    } sp_form_con_b;
  } ;
  
  union {
    __IOM uint32_t sp_rx_fra_div;               /*!< (@ 0x0000002C) SPORT RX Fractional Divider Register                       */
    
    struct {
      __IOM uint32_t sp_rx_mi   : 16;           /*!< [15..0] This fractional Divider mainly makes LRCK_RX.BCLK =
                                                     40MHz x (ni/mi) For example: BCLK=3.072MHz=40MHz x (48/625)               */
      __IOM uint32_t sp_rx_ni   : 15;           /*!< [30..16] the same mi                                                      */
      __IOM uint32_t sp_rx_mi_ni_update : 1;    /*!< [31..31] Update mi and ni.0: Off1: To update mi and ni to get
                                                     the new clock rate. This bit will be reset automatically
                                                     when the update is done.                                                  */
    } sp_rx_fra_div_b;
  } ;
  __IM  uint32_t  sp_rsvd_0;                    /*!< (@ 0x00000030) SPORT Reserve Register 0                                   */
  __IM  uint32_t  sp_rsvd_1;                    /*!< (@ 0x00000034) SPORT Reserve Register 1                                   */
  __IM  uint32_t  sp_rsvd_2;                    /*!< (@ 0x00000038) SPORT Reserve Register 2                                   */
  
  union {
    __IOM uint32_t sp_tx_slot_sele;             /*!< (@ 0x0000003C) SPORT TX Slot Selection Register                           */
    
    struct {
      __IOM uint32_t sp_tx_slot0_sel : 3;       /*!< [2..0] Select the data of slot 0.0: CH0 Data1: CH1 Data2: CH2
                                                     Data3: CH3 Data4: CH4 Data5: CH5 Data6: CH6 Data7: CH7
                                                     Data                                                                      */
            uint32_t            : 1;
      __IOM uint32_t sp_tx_slot1_sel : 3;       /*!< [6..4] Select the data of slot 1.0: CH0 Data1: CH1 Data2: CH2
                                                     Data3: CH3 Data4: CH4 Data5: CH5 Data6: CH6 Data7: CH7
                                                     Data                                                                      */
            uint32_t            : 1;
      __IOM uint32_t sp_tx_slot2_sel : 3;       /*!< [10..8] Select the data of slot 2.0: CH0 Data1: CH1 Data2: CH2
                                                     Data3: CH3 Data4: CH4 Data5: CH5 Data6: CH6 Data7: CH7
                                                     Data                                                                      */
            uint32_t            : 1;
      __IOM uint32_t sp_tx_slot3_sel : 3;       /*!< [14..12] Select the data of slot 3.0: CH0 Data1: CH1 Data2:
                                                     CH2 Data3: CH3 Data4: CH4 Data5: CH5 Data6: CH6 Data7:
                                                     CH7 Data                                                                  */
            uint32_t            : 1;
      __IOM uint32_t sp_tx_slot4_sel : 3;       /*!< [18..16] Select the data of slot 4.0: CH0 Data1: CH1 Data2:
                                                     CH2 Data3: CH3 Data4: CH4 Data5: CH5 Data6: CH6 Data7:
                                                     CH7 Data                                                                  */
            uint32_t            : 1;
      __IOM uint32_t sp_tx_slot5_sel : 3;       /*!< [22..20] Select the data of slot 5.0: CH0 Data1: CH1 Data2:
                                                     CH2 Data3: CH3 Data4: CH4 Data5: CH5 Data6: CH6 Data7:
                                                     CH7 Data                                                                  */
            uint32_t            : 1;
      __IOM uint32_t sp_tx_slot6_sel : 3;       /*!< [26..24] Select the data of slot 6.0: CH0 Data1: CH1 Data2:
                                                     CH2 Data3: CH3 Data4: CH4 Data5: CH5 Data6: CH6 Data7:
                                                     CH7 Data                                                                  */
            uint32_t            : 1;
      __IOM uint32_t sp_tx_slot7_sel : 3;       /*!< [30..28] Select the data of slot 7.0: CH0 Data1: CH1 Data2:
                                                     CH2 Data3: CH3 Data4: CH4 Data5: CH5 Data6: CH6 Data7:
                                                     CH7 Data                                                                  */
            uint32_t            : 1;
    } sp_tx_slot_sele_b;
  } ;
  
  union {
    __OM  uint32_t sp_tx_fifo_1;                /*!< (@ 0x00000040) SPORT TX FIFO_1 Register                                   */
    
