Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __OM  uint32_t sp_tx_fifo_1 : 32;         /*!< [31..0] TX FIFO_1 data register                                           */
    } sp_tx_fifo_1_b;
  } ;
  
  union {
    __IOM uint32_t sp_tx1_rx1_dat_con;          /*!< (@ 0x00000044) SPORT TX1 and RX1 Data Control Register                    */
    
    struct {
            uint32_t            : 26;
      __IOM uint32_t sp_tx_src_byte_swap_1 : 1; /*!< [26..26] 0: Disable1: Swap H/L bytes read from the source memory
                                                     of TX_FIFO_1                                                              */
      __IOM uint32_t sp_tx_src_lr_swap_1 : 1;   /*!< [27..27] 0: Disable1: Swap L/R audio samples read from the source
                                                     memory of TX_FIFO_1                                                       */
      __IOM uint32_t sp_rx_snk_byte_swap_1 : 1; /*!< [28..28] 0: Disable1: Swap H/L bytes written to the sink memory
                                                     of RX_FIFO_1                                                              */
      __IOM uint32_t sp_rx_snk_lr_swap_1 : 1;   /*!< [29..29] 0: Disable1: Swap L/R audio samples written to the
                                                     sink memory of RX_FIFO_1                                                  */
      __IOM uint32_t sp_tx_lsb_first_1 : 1;     /*!< [30..30] TX1 transmit0: MSB first1: LSB first                             */
      __IOM uint32_t sp_rx_lsb_first_1 : 1;     /*!< [31..31] RX1 transmit0: MSB first1: LSB first                             */
    } sp_tx1_rx1_dat_con_b;
  } ;
  
  union {
    __IOM uint32_t sp_tx1_rx1_form_con;         /*!< (@ 0x00000048) SPORT TX1 and RX1 Format Control Register                  */
    
    struct {
            uint32_t            : 24;
      __IOM uint32_t sp_data_len_sel_tx_1 : 3;  /*!< [26..24] 000: 16 bits001: 20 bits010: 24 bits100: 32 bitsOthers:
                                                     Reserved                                                                  */
      __IOM uint32_t sp_en_i2s_mono_tx_1 : 1;   /*!< [27..27] 0: Stereo1: Mono                                                 */
      __IOM uint32_t sp_data_len_sel_rx_1 : 3;  /*!< [30..28] It is valid if SP_TRX_SAME_FS is 0.Data length of SD_I000:
                                                     16 bits001: 20 bits010: 24 bits100: 32 bitsOthers: Reserved               */
      __IOM uint32_t sp_en_i2s_mono_rx_1 : 1;   /*!< [31..31] It is valid if SP_TRX_SAME_FS is 0.Data format of SD_I0:
                                                     stereo1: mono                                                             */
    } sp_tx1_rx1_form_con_b;
  } ;
  __IM  uint32_t  sp_rsvd_3;                    /*!< (@ 0x0000004C) SPORT Reserve Register 3                                   */
  
  union {
    __IM  uint32_t sp_rx_fifo_1;                /*!< (@ 0x00000050) SPORT RX FIFO_1 Register                                   */
    
    struct {
      __IM  uint32_t sp_rx_fifo_1 : 32;         /*!< [31..0] RX FIFO_1 data register                                           */
    } sp_rx_fifo_1_b;
  } ;
  
  union {
    __IOM uint32_t sp_rx_slot_sele_0_3ch;       /*!< (@ 0x00000054) SPORT RX Slot Selection 0-3 Channel Register               */
    
    struct {
      __IOM uint32_t sp_rx_ch0_sel : 3;         /*!< [2..0] Select the slot of CH0.0: Slot 01: Slot 12: Slot 23:
                                                     Slot 34: Slot 45: Slot 56: Slot 67: Slot 7                                */
            uint32_t            : 5;
      __IOM uint32_t sp_rx_ch1_sel : 3;         /*!< [10..8] Select the slot of CH1.0: Slot 01: Slot 12: Slot 23:
                                                     Slot 34: Slot 45: Slot 56: Slot 67: Slot 7                                */
            uint32_t            : 5;
      __IOM uint32_t sp_rx_ch2_sel : 3;         /*!< [18..16] Select the slot of CH2.0: Slot 01: Slot 12: Slot 23:
                                                     Slot 34: Slot 45: Slot 56: Slot 67: Slot 7                                */
            uint32_t            : 5;
      __IOM uint32_t sp_rx_ch3_sel : 3;         /*!< [26..24] Select the slot of CH3.0: Slot 01: Slot 12: Slot 23:
                                                     Slot 34: Slot 45: Slot 56: Slot 67: Slot 7                                */
            uint32_t            : 5;
    } sp_rx_slot_sele_0_3ch_b;
  } ;
  
  union {
    __IOM uint32_t sp_rx_slot_sele_4_7ch;       /*!< (@ 0x00000058) SPORT RX Slot Selection 4-7 Channel Register               */
    
    struct {
      __IOM uint32_t sp_rx_ch4_sel : 3;         /*!< [2..0] Select the slot of CH4.0: Slot 01: Slot 12: Slot 23:
                                                     Slot 34: Slot 45: Slot 56: Slot 67: Slot 7                                */
            uint32_t            : 5;
      __IOM uint32_t sp_rx_ch5_sel : 3;         /*!< [10..8] Select the slot of CH5.0: Slot 01: Slot 12: Slot 23:
                                                     Slot 34: Slot 45: Slot 56: Slot 67: Slot 7                                */
            uint32_t            : 5;
      __IOM uint32_t sp_rx_ch6_sel : 3;         /*!< [18..16] Select the slot of CH6.0: Slot 01: Slot 12: Slot 23:
                                                     Slot 34: Slot 45: Slot 56: Slot 67: Slot 7                                */
            uint32_t            : 5;
      __IOM uint32_t sp_rx_ch7_sel : 3;         /*!< [26..24] Select the slot of CH7.0: Slot 01: Slot 12: Slot 23:
                                                     Slot 34: Slot 45: Slot 56: Slot 67: Slot 7                                */
            uint32_t            : 5;
    } sp_rx_slot_sele_4_7ch_b;
  } ;
  
  union {
    __IOM uint32_t sp_err_cnt_con;              /*!< (@ 0x0000005C) SPORT Error Count Control Register                         */
    
