Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t sp_tx_depth_thr_0 : 6;     /*!< [5..0] Threshold of TX_FIFO_0. Set as the data consumption of
                                                     TX_FIFO_0 in one LRCK. This value is the FIFO layer, and
                                                     one layer is 32 bits.                                                     */
            uint32_t            : 2;
      __IOM uint32_t sp_rx_depth_thr_0 : 6;     /*!< [13..8] Threshold of RX_FIFO_0. Set as the data consumption
                                                     of RX_FIFO_0 in one LRCK. This value is the FIFO layer,
                                                     and one layer is 32 bits.                                                 */
            uint32_t            : 2;
      __IOM uint32_t sp_tx_depth_thr_1 : 6;     /*!< [21..16] Threshold of TX_FIFO_1. Set as the data consumption
                                                     of TX_FIFO_1 in one LRCK. This value is the FIFO layer,
                                                     and one layer is 32 bits.                                                 */
            uint32_t            : 2;
      __IOM uint32_t sp_rx_depth_thr_1 : 6;     /*!< [29..24] Threshold of RX_FIFO_1. Set as the data consumption
                                                     of RX_FIFO_1 in one LRCK. This value is the FIFO layer,
                                                     and one layer is 32 bits.                                                 */
            uint32_t            : 2;
    } sp_err_cnt_con_b;
  } ;
  
  union {
    __IOM uint32_t sp_dma_con;                  /*!< (@ 0x00000060) SPORT DMA Control Register                                 */
    
    struct {
      __IOM uint32_t sp_dma_rstn : 1;           /*!< [0..0] Reset the DMA mechanism like state machine, the DMA pointer.0:
                                                     Make I2S execute the reset1: Make I2S stop the reset                      */
      __IOM uint32_t sp_tx_dma_en : 1;          /*!< [1..1] 0: Disable TX DMA, close Interrupt, and keep the DMA
                                                     pointer.1: Enable TX DMA.                                                 */
      __IOM uint32_t sp_rx_dma_en : 1;          /*!< [2..2] 0: Disable RX DMA, close Interrupt, and keep the DMA
                                                     pointer.1: Enable RX DMA.                                                 */
            uint32_t            : 1;
      __IOM uint32_t sp_dma_ctrl : 1;           /*!< [4..4] DMA Burst-length calculation methods0: Self-calculation
                                                     based on Page Size and Page Pointer settings1: Calculation
                                                     based on FIFO status (default)                                            */
            uint32_t            : 3;
      __IOM uint32_t sp_page_num : 2;           /*!< [9..8] Page number:00 : inactive01 : the page number is 210
                                                     : the page number is 311 : the page number is 4                           */
            uint32_t            : 2;
      __IOM uint32_t sp_burst_size : 2;         /*!< [13..12] Set DMA burst size. When SP_MCU_CTL_MODE is 0, SP_TX_FIFO_TH
                                                     and SP_RX_FIFO_TH also must be set to 15, 7, or 3 according
                                                     SP_BURST_SIZE.For example:When SP_BURST_SIZE is 0, SP_TX_FIFO_TH
                                                     and SP_RX_FIFO_TH are 15.00: Burst size is 16. Total burst
                                                     data is 64 bytes.01: Burst size is 8. Total burst data
                                                     is 32 bytes.10: Burst size is 4. Total burst data is 16
                                                     bytes.Others: Reserved                                                    */
            uint32_t            : 2;
      __IOM uint32_t sp_page_size : 12;         /*!< [27..16] Memory page size = PAGE_SIZE + 1 (word unit)                     */
            uint32_t            : 4;
    } sp_dma_con_b;
  } ;
  
  union {
    __IOM uint32_t sp_tx0_dma_pp;               /*!< (@ 0x00000064) SPORT TX0 DMA Page Pointer Register                        */
    
    struct {
            uint32_t            : 2;
      __IOM uint32_t sp_tx0_page_ptr : 30;      /*!< [31..2] TX0 Page pointer. This is a physical address with word-align
                                                     limitation.                                                               */
    } sp_tx0_dma_pp_b;
  } ;
  
  union {
    __IOM uint32_t sp_tx0_dma_int_en;           /*!< (@ 0x00000068) SPORT TX0 DMA Interrupt Enable Register                    */
    
    struct {
      __IOM uint32_t sp_tx0_p0okie : 1;         /*!< [0..0] TX0 Page 0 OK Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx0_p1okie : 1;         /*!< [1..1] TX0 Page 1 OK Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx0_p2okie : 1;         /*!< [2..2] TX0 Page 2 OK Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx0_p3okie : 1;         /*!< [3..3] TX0 Page 3 OK Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
            uint32_t            : 4;
      __IOM uint32_t sp_tx0_page0unava_ie : 1;  /*!< [8..8] TX0 PAGE 0 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx0_page1unava_ie : 1;  /*!< [9..9] TX0 PAGE 1 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx0_page2unava_ie : 1;  /*!< [10..10] TX0PAGE 2 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx0_page3unava_ie : 1;  /*!< [11..11] TX0 PAGE 3 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
            uint32_t            : 4;
      __IOM uint32_t sp_tx0_page0errie : 1;     /*!< [16..16] TX0 PAGE 0 error Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx0_page1errie : 1;     /*!< [17..17] TX0 PAGE 1 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx0_page2errie : 1;     /*!< [18..18] TX0 PAGE 2 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx0_page3errie : 1;     /*!< [19..19] TX0 PAGE 3 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
            uint32_t            : 4;
      __IOM uint32_t sp_tx0_underflow_ie : 1;   /*!< [24..24] TX0 FIFO Underflow Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
            uint32_t            : 7;
    } sp_tx0_dma_int_en_b;
  } ;
  
  union {
    __IOM uint32_t sp_tx0_dma_int_sta;          /*!< (@ 0x0000006C) SPORT TX0 DMA Interrupt Status Register                    */
    
