Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __OM  uint32_t sp_tx0_p0okip : 1;         /*!< [0..0] TX0 Page 0 OK Interrupt Pending0: No Interrupt1: Interrupt
                                                     pending, write 1 to clear                                                 */
      __OM  uint32_t sp_tx0_p1okip : 1;         /*!< [1..1] TX0 Page 1 OK Interrupt Pending0: No Interrupt1: Interrupt
                                                     pending, write 1 to clear                                                 */
      __OM  uint32_t sp_tx0_p2okip : 1;         /*!< [2..2] TX0 Page 2 OK Interrupt Pending0: No Interrupt1: Interrupt
                                                     pending, write 1 to clear                                                 */
      __OM  uint32_t sp_tx0_p3okip : 1;         /*!< [3..3] TX0 Page 3 OK Interrupt Pending0: No Interrupt1: Interrupt
                                                     pending, write 1 to clear                                                 */
            uint32_t            : 4;
      __OM  uint32_t sp_tx0_page0unava_ip : 1;  /*!< [8..8] TX0 PAGE 0 unavailable Interrupt Pending. The controller
                                                     wants to execute the page but this page own bit does not
                                                     be set. This situation will make the interrupt.0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
      __OM  uint32_t sp_tx0_page1unava_ip : 1;  /*!< [9..9] TX0 PAGE 1 unavailable Interrupt Pending. The controller
                                                     wants to execute the page but this page own bit does not
                                                     be set. This situation will make the interrupt.0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
      __OM  uint32_t sp_tx0_page2unava_ip : 1;  /*!< [10..10] TX0 PAGE 2 unavailable Interrupt Pending. The controller
                                                     wants to execute the page but this page own bit does not
                                                     be set. This situation will make the interrupt.0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
      __OM  uint32_t sp_tx0_page3unava_ip : 1;  /*!< [11..11] TX0 PAGE 3 unavailable Interrupt Pending. The controller
                                                     wants to execute the page but this page own bit does not
                                                     be set. This situation will make the interrupt.0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
            uint32_t            : 4;
      __OM  uint32_t sp_tx0_page0errip : 1;     /*!< [16..16] TX0 PAGE 0 Error Interrupt Pending. Fabric bus responses
                                                     DEC/SLV error.0: No error interrupt1: Interrupt pending                   */
      __OM  uint32_t sp_tx0_page1errip : 1;     /*!< [17..17] TX0 PAGE 1 Error Interrupt Pending. Fabric bus responses
                                                     DEC/SLV error.0: No error interrupt1: Interrupt pending                   */
      __OM  uint32_t sp_tx0_page2errip : 1;     /*!< [18..18] TX0 PAGE 2 Error Interrupt Pending. Fabric bus responses
                                                     DEC/SLV error.0: No error interrupt1: Interrupt pending                   */
      __OM  uint32_t sp_tx0_page3errip : 1;     /*!< [19..19] TX0 PAGE 3 Error Interrupt Pending. Fabric bus responses
                                                     DEC/SLV error.0: No error interrupt1: Interrupt pending                   */
            uint32_t            : 4;
      __OM  uint32_t sp_tx0_underflow_ip : 1;   /*!< [24..24] TX0 FIFO Underflow Interrupt Pending0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
            uint32_t            : 7;
    } sp_tx0_dma_int_sta_b;
  } ;
  
  union {
    __IOM uint32_t sp_tx1_dma_pp;               /*!< (@ 0x00000070) SPORT TX1 DMA Page Pointer Register                        */
    
    struct {
            uint32_t            : 2;
      __IOM uint32_t sp_tx1_page_ptr : 30;      /*!< [31..2] TX1 Page pointer. This is a physical address with word-align
                                                     limitation.                                                               */
    } sp_tx1_dma_pp_b;
  } ;
  
  union {
    __IOM uint32_t sp_tx1_dma_int_en;           /*!< (@ 0x00000074) SPORT TX1 DMA Interrupt Enable Register                    */
    
    struct {
      __IOM uint32_t sp_tx1_p0okie : 1;         /*!< [0..0] TX1 Page 0 OK Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx1_p1okie : 1;         /*!< [1..1] TX1 Page 1 OK Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx1_p2okie : 1;         /*!< [2..2] TX1 Page 2 OK Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx1_p3okie : 1;         /*!< [3..3] TX1 Page 3 OK Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
            uint32_t            : 4;
      __IOM uint32_t sp_tx1_page0unava_ie : 1;  /*!< [8..8] TX1 PAGE 0 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx1_page1unava_ie : 1;  /*!< [9..9] TX1 PAGE 1 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx1_page2unava_ie : 1;  /*!< [10..10] TX1 PAGE 2 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx1_page3unava_ie : 1;  /*!< [11..11] TX1 PAGE 3 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
            uint32_t            : 4;
      __IOM uint32_t sp_tx1_page0errie : 1;     /*!< [16..16] TX1 PAGE 0 error Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx1_page1errie : 1;     /*!< [17..17] TX1 PAGE 1 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx1_page2errie : 1;     /*!< [18..18] TX1 PAGE 2 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_tx1_page3errie : 1;     /*!< [19..19] TX1 PAGE 3 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
            uint32_t            : 4;
      __IOM uint32_t sp_tx1_underflow_ie : 1;   /*!< [24..24] TX1 FIFO Underflow Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
            uint32_t            : 7;
    } sp_tx1_dma_int_en_b;
  } ;
  
  union {
    __IOM uint32_t sp_tx1_dma_int_sta;          /*!< (@ 0x00000078) SPORT TX1 DMA Interrupt Status Register                    */
    
