Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __OM  uint32_t sp_tx1_p0okip : 1;         /*!< [0..0] TX1 Page 0 OK Interrupt Pending0: No Interrupt1: Interrupt
                                                     pending, write 1 to clear                                                 */
      __OM  uint32_t sp_tx1_p1okip : 1;         /*!< [1..1] TX1 Page 1 OK Interrupt Pending0: No Interrupt1: Interrupt
                                                     pending, write 1 to clear                                                 */
      __OM  uint32_t sp_tx1_p2okip : 1;         /*!< [2..2] TX1 Page 2 OK Interrupt Pending0: No Interrupt1: Interrupt
                                                     pending, write 1 to clear                                                 */
      __OM  uint32_t sp_tx1_p3okip : 1;         /*!< [3..3] TX1 Page 3 OK Interrupt Pending0: No Interrupt1: Interrupt
                                                     pending, write 1 to clear                                                 */
            uint32_t            : 4;
      __OM  uint32_t sp_tx1_page0unava_ip : 1;  /*!< [8..8] TX1 PAGE 0 unavailable Interrupt Pending. The controller
                                                     wants to execute the page but this page own bit does not
                                                     be set. This situation will make the interrupt.0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
      __OM  uint32_t sp_tx1_page1unava_ip : 1;  /*!< [9..9] TX1 PAGE 1 unavailable Interrupt Pending. The controller
                                                     wants to execute the page but this page own bit does not
                                                     be set. This situation will make the interrupt.0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
      __OM  uint32_t sp_tx1_page2unava_ip : 1;  /*!< [10..10] TX1 PAGE 2 unavailable Interrupt Pending. The controller
                                                     wants to execute the page but this page own bit does not
                                                     be set. This situation will make the interrupt.0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
      __OM  uint32_t sp_tx1_page3unava_ip : 1;  /*!< [11..11] TX1 PAGE 3 unavailable Interrupt Pending. The controller
                                                     wants to execute the page but this page own bit does not
                                                     be set. This situation will make the interrupt.0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
            uint32_t            : 4;
      __OM  uint32_t sp_tx1_page0errip : 1;     /*!< [16..16] TX1 PAGE 0 Error Interrupt Pending. Fabric bus responses
                                                     DEC/SLV error.0: No error interrupt1: Interrupt pending                   */
      __OM  uint32_t sp_tx1_page1errip : 1;     /*!< [17..17] TX1 PAGE 1 Error Interrupt Pending. Fabric bus responses
                                                     DEC/SLV error.0: No error interrupt1: Interrupt pending                   */
      __OM  uint32_t sp_tx1_page2errip : 1;     /*!< [18..18] TX1 PAGE 2 Error Interrupt Pending. Fabric bus responses
                                                     DEC/SLV error.0: No error interrupt1: Interrupt pending                   */
      __OM  uint32_t sp_tx1_page3errip : 1;     /*!< [19..19] TX1 PAGE 3 Error Interrupt Pending. Fabric bus responses
                                                     DEC/SLV error.0: No error interrupt1: Interrupt pending                   */
            uint32_t            : 4;
      __OM  uint32_t sp_tx1_underflow_ip : 1;   /*!< [24..24] TX1 FIFO Underflow Interrupt Pending0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
            uint32_t            : 7;
    } sp_tx1_dma_int_sta_b;
  } ;
  
  union {
    __IOM uint32_t sp_tx_page_own;              /*!< (@ 0x0000007C) SPORT TX Page Own Register                                 */
    
    struct {
      __IOM uint32_t sp_tx0_p0own : 1;          /*!< [0..0] TX0 Page 0 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_tx0_p1own : 1;          /*!< [1..1] TX0 Page 1 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_tx0_p2own : 1;          /*!< [2..2] TX0 Page 2 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_tx0_p3own : 1;          /*!< [3..3] TX0 Page 3 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_tx1_p0own : 1;          /*!< [4..4] TX1 Page 0 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_tx1_p1own : 1;          /*!< [5..5] TX1 Page 1 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_tx1_p2own : 1;          /*!< [6..6] TX1 Page 2 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_tx1_p3own : 1;          /*!< [7..7] TX1 Page 3 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
            uint32_t            : 24;
    } sp_tx_page_own_b;
  } ;
  
  union {
    __IOM uint32_t sp_rx0_dma_pp;               /*!< (@ 0x00000080) SPORT RX0 DMA Page Pointer Register                        */
    
