Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
            uint32_t            : 2;
      __IOM uint32_t sp_rx0_page_ptr : 30;      /*!< [31..2] RX0 Page pointer. This is a physical address with word-align
                                                     limitation.                                                               */
    } sp_rx0_dma_pp_b;
  } ;
  
  union {
    __IOM uint32_t sp_rx0_dma_int_en;           /*!< (@ 0x00000084) SPORT RX0 DMA Interrupt Enable Register                    */
    
    struct {
      __IOM uint32_t sp_rx0_p0okie : 1;         /*!< [0..0] RX0 Page 0 OK Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_rx0_p1okie : 1;         /*!< [1..1] RX0 Page 1 OK Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_rx0_p2okie : 1;         /*!< [2..2] RX0 Page 2 OK Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_rx0_p3okie : 1;         /*!< [3..3] RX0 Page 3 OK Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
            uint32_t            : 4;
      __IOM uint32_t sp_rx0_page0unava_ie : 1;  /*!< [8..8] RX0 PAGE 0 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_rx0_page1unava_ie : 1;  /*!< [9..9] RX0 PAGE 1 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_rx0_page2unava_ie : 1;  /*!< [10..10] RX0PAGE 2 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_rx0_page3unava_ie : 1;  /*!< [11..11] RX0 PAGE 3 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
            uint32_t            : 4;
      __IOM uint32_t sp_rx0_page0errie : 1;     /*!< [16..16] RX0 PAGE 0 error Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_rx0_page1errie : 1;     /*!< [17..17] RX0 PAGE 1 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_rx0_page2errie : 1;     /*!< [18..18] RX0 PAGE 2 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
      __IOM uint32_t sp_rx0_page3errie : 1;     /*!< [19..19] RX0 PAGE 3 unavailable Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
            uint32_t            : 4;
      __IOM uint32_t sp_rx0_overflow_ie : 1;    /*!< [24..24] RX0 FIFO overflow Interrupt Enable0: Disable Interrupt1:
                                                     Enable Interrupt                                                          */
            uint32_t            : 7;
    } sp_rx0_dma_int_en_b;
  } ;
  
  union {
    __IOM uint32_t sp_rx0_dma_int_sta;          /*!< (@ 0x00000088) SPORT RX0 DMA Interrupt Status Register                    */
    
    struct {
      __OM  uint32_t sp_rx0_p0okip : 1;         /*!< [0..0] RX0 Page 0 OK Interrupt Pending0: No Interrupt1: Interrupt
                                                     pending, write 1 to clear                                                 */
      __OM  uint32_t sp_rx0_p1okip : 1;         /*!< [1..1] RX0 Page 1 OK Interrupt Pending0: No Interrupt1: Interrupt
                                                     pending, write 1 to clear                                                 */
      __OM  uint32_t sp_rx0_p2okip : 1;         /*!< [2..2] RX0 Page 2 OK Interrupt Pending0: No Interrupt1: Interrupt
                                                     pending, write 1 to clear                                                 */
      __OM  uint32_t sp_rx0_p3okip : 1;         /*!< [3..3] RX0 Page 3 OK Interrupt Pending0: No Interrupt1: Interrupt
                                                     pending, write 1 to clear                                                 */
            uint32_t            : 4;
      __OM  uint32_t sp_rx0_page0unava_ip : 1;  /*!< [8..8] RX0 PAGE 0 unavailable Interrupt Pending. The controller
                                                     wants to execute the page but this page own bit does not
                                                     be set. This situation will make the interrupt.0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
      __OM  uint32_t sp_rx0_page1unava_ip : 1;  /*!< [9..9] RX0 PAGE 1 unavailable Interrupt Pending. The controller
                                                     wants to execute the page but this page own bit does not
                                                     be set. This situation will make the interrupt.0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
      __OM  uint32_t sp_rx0_page2unava_ip : 1;  /*!< [10..10] RX0 PAGE 2 unavailable Interrupt Pending. The controller
                                                     wants to execute the page but this page own bit does not
                                                     be set. This situation will make the interrupt.0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
      __OM  uint32_t sp_rx0_page3unava_ip : 1;  /*!< [11..11] RX0 PAGE 3 unavailable Interrupt Pending. The controller
                                                     wants to execute the page but this page own bit does not
                                                     be set. This situation will make the interrupt.0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
            uint32_t            : 4;
      __OM  uint32_t sp_rx0_page0errip : 1;     /*!< [16..16] RX0 PAGE 0 Error Interrupt Pending. Fabric bus responses
                                                     DEC/SLV error.0: No error interrupt1: Interrupt pending                   */
      __OM  uint32_t sp_rx0_page1errip : 1;     /*!< [17..17] RX0 PAGE 1 Error Interrupt Pending. Fabric bus responses
                                                     DEC/SLV error.0: No error interrupt1: Interrupt pending                   */
      __OM  uint32_t sp_rx0_page2errip : 1;     /*!< [18..18] RX0 PAGE 2 Error Interrupt Pending. Fabric bus responses
                                                     DEC/SLV error.0: No error interrupt1: Interrupt pending                   */
      __OM  uint32_t sp_rx0_page3errip : 1;     /*!< [19..19] RX0 PAGE 3 Error Interrupt Pending. Fabric bus responses
                                                     DEC/SLV error.0: No error interrupt1: Interrupt pending                   */
            uint32_t            : 4;
      __OM  uint32_t sp_rx0_overflow_ip : 1;    /*!< [24..24] RX0 FIFO overflow Interrupt Pending0: No Interrupt1:
                                                     Interrupt pending, write 1 to clear                                       */
            uint32_t            : 7;
    } sp_rx0_dma_int_sta_b;
  } ;
  
  union {
    __IOM uint32_t sp_rx1_dma_pp;               /*!< (@ 0x0000008C) SPORT RX1 DMA Page Pointer Register                        */
    
