Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t sp_rx0_p0own : 1;          /*!< [0..0] RX0 Page 0 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_rx0_p1own : 1;          /*!< [1..1] RX0 Page 1 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_rx0_p2own : 1;          /*!< [2..2] RX0 Page 2 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_rx0_p3own : 1;          /*!< [3..3] RX0 Page 3 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_rx1_p0own : 1;          /*!< [4..4] RX1 Page 0 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_rx1_p1own : 1;          /*!< [5..5] RX1 Page 1 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_rx1_p2own : 1;          /*!< [6..6] RX1 Page 2 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
      __IOM uint32_t sp_rx1_p3own : 1;          /*!< [7..7] RX1 Page 3 Own bit0: Page 0 owned by CPU1: Page 0 owned
                                                     by controllerDMA sets this bit to 0 when TX channel 0 Page
                                                     0 is done                                                                 */
            uint32_t            : 24;
    } sp_rx_page_own_b;
  } ;
  
  union {
    __IOM uint32_t sp_tx_axiaddr_err;           /*!< (@ 0x0000009C) SPORT TX AXI address access Error address record
                                                                    Register                                                   */
    
    struct {
      __IOM uint32_t sp_tx_axiaddr : 32;        /*!< [31..0] TX AXI Error Address cause Error interruptlimitation.             */
    } sp_tx_axiaddr_err_b;
  } ;
  __IM  uint32_t  RESERVED[24];
  
  union {
    __IM  uint32_t sp_tx_misc_err;              /*!< (@ 0x00000100) SPORT TX AXI MISC. access Error record Register            */
    
    struct {
      __IM  uint32_t sp_tx_page_size : 12;      /*!< [11..0] Page Size setting                                                 */
      __IM  uint32_t sp_tx_page_num : 2;        /*!< [13..12] Number of page setting                                           */
            uint32_t            : 2;
      __IM  uint32_t sp_tx_burst_len : 4;       /*!< [19..16] TX AXI Burst Length Error transaction causes Error
                                                     interrupt                                                                 */
            uint32_t            : 3;
      __IM  uint32_t sp_tx_dma_ctrl : 1;        /*!< [23..23] DMA Burst length calculation0: Self-calculation1: Burst
                                                     length info from setting (refer to BURST_LEN_SETTING field)               */
      __IM  uint32_t sp_tx_burst_len_setting : 2;/*!< [25..24] Burst length setting in DMA_CTRL = 1                            */
            uint32_t            : 1;
      __IM  uint32_t sp_tx_channel_winner : 1;  /*!< [27..27] Channel that is served by DMA0: Channel 01: Channel
                                                     1                                                                         */
            uint32_t            : 1;
      __IM  uint32_t sp_tx_current_page : 2;    /*!< [30..29] Current page has Error00: page 001: page 110: page
                                                     211: page 3                                                               */
            uint32_t            : 1;
    } sp_tx_misc_err_b;
  } ;
  
  union {
    __IOM uint32_t sp_rx_axiaddr_err;           /*!< (@ 0x00000104) SPORT RX AXI address access Error address record
                                                                    Register                                                   */
    
    struct {
      __IOM uint32_t sp_rx_axiaddr : 32;        /*!< [31..0] RX AXI Error Address cause Error interruptlimitation.             */
    } sp_rx_axiaddr_err_b;
  } ;
  
  union {
    __IM  uint32_t sp_rx_misc_err;              /*!< (@ 0x00000108) SPORT RX AXI MISC. access Error record Register            */
    
    struct {
      __IM  uint32_t sp_rx_page_size : 12;      /*!< [11..0] Page Size setting                                                 */
      __IM  uint32_t sp_rx_page_num : 2;        /*!< [13..12] Number of page setting                                           */
            uint32_t            : 2;
      __IM  uint32_t sp_rx_burst_len : 4;       /*!< [19..16] TX AXI Burst Length Error transaction causes Error
                                                     interrupt                                                                 */
            uint32_t            : 3;
      __IM  uint32_t sp_rx_dma_ctrl : 1;        /*!< [23..23] DMA Burst length calculation0: Self-calculation1: Burst
                                                     length info from setting (refer to BURST_LEN_SETTING field)               */
      __IM  uint32_t sp_rx_burst_len_setting : 2;/*!< [25..24] Burst length setting in DMA_CTRL = 1                            */
            uint32_t            : 1;
      __IM  uint32_t sp_rx_channel_winner : 1;  /*!< [27..27] Channel that is served by DMA0: Channel 01: Channel
                                                     1                                                                         */
            uint32_t            : 1;
      __IM  uint32_t sp_rx_current_page : 2;    /*!< [30..29] Current page has Error00: page 001: page 110: page
                                                     211: page 3                                                               */
            uint32_t            : 1;
    } sp_rx_misc_err_b;
  } ;
} SPORT_Type;                                   /*!< Size = 268 (0x10c)                                                        */



/* =========================================================================================================================== */
/* ================                                           SGPIO                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial General Purpose Input / Output (SGPIO)
  */

typedef struct {                                /*!< (@ 0x40046000) SGPIO Structure                                            */
  
  union {
    __IOM uint32_t rxtmr_ctrl;                  /*!< (@ 0x00000000) RX Timer Control Register                                  */
    
