Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t rxtmr_cen  : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t rxtmr_crst : 1;            /*!< [1..1] RSVD                                                               */
            uint32_t            : 6;
      __IOM uint32_t rxtmredge_sel : 2;         /*!< [9..8] RSVD                                                               */
            uint32_t            : 22;
    } rxtmr_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t rxprval;                     /*!< (@ 0x00000004) RX Maximum Prescale Register                               */
    
    struct {
      __IOM uint32_t rxprval    : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } rxprval_b;
  } ;
  
  union {
    __IOM uint32_t rxprtc;                      /*!< (@ 0x00000008) RX Timer Prescale Register                                 */
    
    struct {
      __IOM uint32_t rxprtc     : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } rxprtc_b;
  } ;
  
  union {
    __IOM uint32_t rxtc;                        /*!< (@ 0x0000000C) RX Timer Counter Register                                  */
    
    struct {
      __IOM uint32_t rxtc       : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } rxtc_b;
  } ;
  
  union {
    __IOM uint32_t rxmc;                        /*!< (@ 0x00000010) Position Counter Register                                  */
    
    struct {
      __IOM uint32_t rx_mr0i_en : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t rx_mr0rst_en : 1;          /*!< [1..1] RSVD                                                               */
      __IOM uint32_t rx_mr0stop_en : 1;         /*!< [2..2] RSVD                                                               */
      __IOM uint32_t rx_mr0sclk_en : 1;         /*!< [3..3] RSVD                                                               */
      __IOM uint32_t rx_mr1i_en : 1;            /*!< [4..4] RSVD                                                               */
      __IOM uint32_t rx_mr1rst_en : 1;          /*!< [5..5] RSVD                                                               */
      __IOM uint32_t rx_mr1stop_en : 1;         /*!< [6..6] RSVD                                                               */
      __IOM uint32_t rx_mr1sclk_en : 1;         /*!< [7..7] RSVD                                                               */
      __IOM uint32_t rx_mr2i_en : 1;            /*!< [8..8] RSVD                                                               */
      __IOM uint32_t rx_mr2rst_en : 1;          /*!< [9..9] RSVD                                                               */
      __IOM uint32_t rx_mr2stop_en : 1;         /*!< [10..10] RSVD                                                             */
      __IOM uint32_t rx_mr2sclk_en : 1;         /*!< [11..11] RSVD                                                             */
      __IOM uint32_t rx_mr0mulrst_en : 1;       /*!< [12..12] RSVD                                                             */
      __IOM uint32_t rx_mr0mulstop_en : 1;      /*!< [13..13] RSVD                                                             */
      __IOM uint32_t rx_posrst_en : 1;          /*!< [14..14] RSVD                                                             */
      __IOM uint32_t rx_posstop_en : 1;         /*!< [15..15] RSVD                                                             */
            uint32_t            : 16;
    } rxmc_b;
  } ;
  
  union {
    __IOM uint32_t rxmr0;                       /*!< (@ 0x00000014) RX Match Register 0                                        */
    
    struct {
      __IOM uint32_t rxmr0      : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } rxmr0_b;
  } ;
  
  union {
    __IOM uint32_t rxmr1;                       /*!< (@ 0x00000018) RX Match Register 1                                        */
    
    struct {
      __IOM uint32_t rxmr1      : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } rxmr1_b;
  } ;
  
  union {
    __IOM uint32_t rxmr2;                       /*!< (@ 0x0000001C) RX Match Register 2                                        */
    
    struct {
      __IOM uint32_t rxmr2      : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } rxmr2_b;
  } ;
  
  union {
    __IOM uint32_t cap_ctrl;                    /*!< (@ 0x00000020) Capture Control Register                                   */
    
    struct {
      __IOM uint32_t cap_en     : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t capi_en    : 1;            /*!< [1..1] RSVD                                                               */
      __IOM uint32_t capsrc_sel : 1;            /*!< [2..2] RSVD                                                               */
      __IOM uint32_t capfe_en   : 1;            /*!< [3..3] RSVD                                                               */
      __IOM uint32_t capre_en   : 1;            /*!< [4..4] RSVD                                                               */
      __IOM uint32_t cap_rxtcrst_en : 1;        /*!< [5..5] RSVD                                                               */
      __IOM uint32_t cap_rxtcstop_en : 1;       /*!< [6..6] RSVD                                                               */
      __IOM uint32_t cap_cmpval_sel : 1;        /*!< [7..7] RSVD                                                               */
      __IOM uint32_t capvalid_en : 1;           /*!< [8..8] RSVD                                                               */
            uint32_t            : 7;
      __IOM uint32_t cap_cmpval : 16;           /*!< [31..16] RSVD                                                             */
    } cap_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t capr;                        /*!< (@ 0x00000024) Capture Register                                           */
    
