Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IM  uint32_t capr       : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } capr_b;
  } ;
  
  union {
    __IOM uint32_t multmr_ctrl;                 /*!< (@ 0x00000028) Multiple Timer Control Register                            */
    
    struct {
      __IOM uint32_t multmr_cen : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t multmr_crst : 1;           /*!< [1..1] RSVD                                                               */
            uint32_t            : 6;
      __IOM uint32_t mulmode_en : 2;            /*!< [9..8] RSVD                                                               */
            uint32_t            : 22;
    } multmr_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t mulprval;                    /*!< (@ 0x0000002C) Multiple Maximum Prescale Register                         */
    
    struct {
      __IOM uint32_t mulprval   : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } mulprval_b;
  } ;
  
  union {
    __IOM uint32_t mulprtc;                     /*!< (@ 0x00000030) Multiple Timer Prescale Register                           */
    
    struct {
      __IOM uint32_t mulprtc    : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } mulprtc_b;
  } ;
  
  union {
    __IOM uint32_t multc;                       /*!< (@ 0x00000034) Multiple Timer Counter Register                            */
    
    struct {
      __IOM uint32_t multc      : 16;           /*!< [15..0] RSVD                                                              */
            uint32_t            : 16;
    } multc_b;
  } ;
  
  union {
    __IOM uint32_t mulmc;                       /*!< (@ 0x00000038) Multiple Match Control Register                            */
    
    struct {
      __IOM uint32_t mul_mr0i_en : 1;           /*!< [0..0] RSVD                                                               */
      __IOM uint32_t mul_mr0rst_en : 1;         /*!< [1..1] RSVD                                                               */
      __IOM uint32_t mul_mr0stop_en : 1;        /*!< [2..2] RSVD                                                               */
      __IOM uint32_t mul_mr0sclk_en : 1;        /*!< [3..3] RSVD                                                               */
      __IOM uint32_t mul_mr0rxrst_en : 1;       /*!< [4..4] RSVD                                                               */
      __IOM uint32_t mul_mr0rxstop_en : 1;      /*!< [5..5] RSVD                                                               */
      __IOM uint32_t mul_mr0capsrc_en : 1;      /*!< [6..6] RSVD                                                               */
      __IOM uint32_t mul_mr0mcnt_en : 1;        /*!< [7..7] RSVD                                                               */
      __IOM uint32_t mul_mcnti_en : 1;          /*!< [8..8] RSVD                                                               */
      __IOM uint32_t mul_mcntrst_en : 1;        /*!< [9..9] RSVD                                                               */
      __IOM uint32_t mul_mcntstop_en : 1;       /*!< [10..10] RSVD                                                             */
      __IOM uint32_t mul_fmode_en : 1;          /*!< [11..11] RSVD                                                             */
      __IOM uint32_t mul_dma_en : 1;            /*!< [12..12] RSVD                                                             */
      __IOM uint32_t mul_dma_start : 1;         /*!< [13..13] RSVD                                                             */
      __IOM uint32_t mul_dma_unfli_en : 1;      /*!< [14..14] RSVD                                                             */
            uint32_t            : 17;
    } mulmc_b;
  } ;
  
  union {
    __IOM uint32_t mulmr01gp0;                  /*!< (@ 0x0000003C) Multiple Match Register 0 & 1 For Group 0                  */
    
    struct {
      __IOM uint32_t mulmr0_gp0 : 16;           /*!< [15..0] RSVD                                                              */
      __IOM uint32_t mulmr1_gp0 : 16;           /*!< [31..16] RSVD                                                             */
    } mulmr01gp0_b;
  } ;
  
  union {
    __IOM uint32_t mulmr23gp0;                  /*!< (@ 0x00000040) Multiple Match Register 2 & 3 For Group 0                  */
    
    struct {
      __IOM uint32_t mulmr2_gp0 : 16;           /*!< [15..0] RSVD                                                              */
      __IOM uint32_t mulmr3_gp0 : 16;           /*!< [31..16] RSVD                                                             */
    } mulmr23gp0_b;
  } ;
  
  union {
    __IOM uint32_t mulmr01gp1;                  /*!< (@ 0x00000044) Multiple Match Register 0 & 1 For Group 1                  */
    
    struct {
      __IOM uint32_t mulmr0_gp1 : 16;           /*!< [15..0] RSVD                                                              */
      __IOM uint32_t mulmr1_gp1 : 16;           /*!< [31..16] RSVD                                                             */
    } mulmr01gp1_b;
  } ;
  
  union {
    __IOM uint32_t mulmr23gp1;                  /*!< (@ 0x00000048) Multiple Match Register 2 & 3 For Group 1                  */
    
    struct {
      __IOM uint32_t mulmr2_gp1 : 16;           /*!< [15..0] RSVD                                                              */
      __IOM uint32_t mulmr3_gp1 : 16;           /*!< [31..16] RSVD                                                             */
    } mulmr23gp1_b;
  } ;
  
  union {
    __IOM uint32_t mul_mcnt;                    /*!< (@ 0x0000004C) Multiple Match Counter Register                            */
    
