Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t mul_mcnt   : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } mul_mcnt_b;
  } ;
  
  union {
    __IOM uint32_t mulemr;                      /*!< (@ 0x00000050) External Match Control Register                            */
    
    struct {
      __IOM uint32_t mulemc1    : 2;            /*!< [1..0] RSVD                                                               */
      __IOM uint32_t mulemc2    : 2;            /*!< [3..2] RSVD                                                               */
      __IOM uint32_t mulemc3    : 2;            /*!< [5..4] RSVD                                                               */
      __IOM uint32_t rxemc0     : 2;            /*!< [7..6] RSVD                                                               */
      __IOM uint32_t rxemc1     : 2;            /*!< [9..8] RSVD                                                               */
      __IOM uint32_t rxemc2     : 2;            /*!< [11..10] RSVD                                                             */
      __IOM uint32_t biout_en   : 1;            /*!< [12..12] RSVD                                                             */
      __IOM uint32_t biout_mode : 2;            /*!< [14..13] RSVD                                                             */
      __IOM uint32_t mulbimc1   : 2;            /*!< [16..15] RSVD                                                             */
      __IOM uint32_t mulbimc2   : 2;            /*!< [18..17] RSVD                                                             */
      __IOM uint32_t mulbimc3   : 2;            /*!< [20..19] RSVD                                                             */
      __IOM uint32_t rxbimc0    : 2;            /*!< [22..21] RSVD                                                             */
      __IOM uint32_t rxbimc1    : 2;            /*!< [24..23] RSVD                                                             */
      __IOM uint32_t rxbimc2    : 2;            /*!< [26..25] RSVD                                                             */
            uint32_t            : 5;
    } mulemr_b;
  } ;
  
  union {
    __IOM uint32_t data_ctrl;                   /*!< (@ 0x00000054) Data Control Register                                      */
    
    struct {
      __IOM uint32_t rxsft_ie   : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t mulsft_ie  : 1;            /*!< [1..1] RSVD                                                               */
      __IOM uint32_t rxload_ie  : 1;            /*!< [2..2] RSVD                                                               */
      __IOM uint32_t mulload_ie : 1;            /*!< [3..3] RSVD                                                               */
      __IOM uint32_t rxdatasrc_sel : 1;         /*!< [4..4] RSVD                                                               */
      __IOM uint32_t pattern_match_mode : 1;    /*!< [5..5] RSVD                                                               */
      __IOM uint32_t pattern_match_ie : 1;      /*!< [6..6] RSVD                                                               */
      __IOM uint32_t rxdata_dir : 1;            /*!< [7..7] RSVD                                                               */
      __IOM uint32_t txdata_dir : 1;            /*!< [8..8] RSVD                                                               */
            uint32_t            : 23;
    } data_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t rxdata;                      /*!< (@ 0x00000058) RX Data Register                                           */
    
    struct {
      __IOM uint32_t rxdata     : 32;           /*!< [31..0] RSVD                                                              */
    } rxdata_b;
  } ;
  
  union {
    __IOM uint32_t rxdata_dp;                   /*!< (@ 0x0000005C) RX Data Duplicate Register                                 */
    
    struct {
      __IOM uint32_t rxdata_dp  : 32;           /*!< [31..0] RSVD                                                              */
    } rxdata_dp_b;
  } ;
  
  union {
    __IOM uint32_t rxposr;                      /*!< (@ 0x00000060) RX Position Register                                       */
    
    struct {
      __IOM uint32_t rxpostc    : 5;            /*!< [4..0] RSVD                                                               */
            uint32_t            : 3;
      __IOM uint32_t rxposrst   : 5;            /*!< [12..8] RSVD                                                              */
            uint32_t            : 19;
    } rxposr_b;
  } ;
  
  union {
    __IOM uint32_t rxdatamask;                  /*!< (@ 0x00000064) RX Data Mask Register                                      */
    
    struct {
      __IOM uint32_t rxdatamask : 32;           /*!< [31..0] RSVD                                                              */
    } rxdatamask_b;
  } ;
  
  union {
    __IOM uint32_t muldata;                     /*!< (@ 0x00000068) Multiple Data Register                                     */
    
    struct {
      __IOM uint32_t muldata    : 32;           /*!< [31..0] RSVD                                                              */
    } muldata_b;
  } ;
  
  union {
    __IOM uint32_t muldata_dp;                  /*!< (@ 0x0000006C) Multiple Data Duplicate Register                           */
    
    struct {
      __IOM uint32_t muldata_dp : 32;           /*!< [31..0] RSVD                                                              */
    } muldata_dp_b;
  } ;
  
  union {
    __IOM uint32_t mulposr;                     /*!< (@ 0x00000070) Multiple Position Register                                 */
    
    struct {
      __IOM uint32_t mulpostc   : 5;            /*!< [4..0] RSVD                                                               */
            uint32_t            : 3;
      __IOM uint32_t mulposrst  : 5;            /*!< [12..8] RSVD                                                              */
            uint32_t            : 19;
    } mulposr_b;
  } ;
  
  union {
    __OM  uint32_t mulfdata;                    /*!< (@ 0x00000074) Multiple FIFO Data Register                                */
    
