Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __OM  uint32_t mulfdata   : 32;           /*!< [31..0] RSVD                                                              */
    } mulfdata_b;
  } ;
  
  union {
    __IOM uint32_t is;                          /*!< (@ 0x00000078) SGPIO Interrupt Status Register                            */
    
    struct {
      __IOM uint32_t rx_mr0i_is : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t rx_mr1i_is : 1;            /*!< [1..1] RSVD                                                               */
      __IOM uint32_t rx_mr2i_is : 1;            /*!< [2..2] RSVD                                                               */
      __IOM uint32_t mul_mr0i_is : 1;           /*!< [3..3] RSVD                                                               */
      __IOM uint32_t capi_is    : 1;            /*!< [4..4] RSVD                                                               */
      __IOM uint32_t rxsft_is   : 1;            /*!< [5..5] RSVD                                                               */
      __IOM uint32_t mulsft_is  : 1;            /*!< [6..6] RSVD                                                               */
      __IOM uint32_t rxload_is  : 1;            /*!< [7..7] RSVD                                                               */
      __IOM uint32_t mulload_is : 1;            /*!< [8..8] RSVD                                                               */
      __IOM uint32_t pattern_match_is : 1;      /*!< [9..9] RSVD                                                               */
      __IOM uint32_t mulmcnt_is : 1;            /*!< [10..10] RSVD                                                             */
      __IOM uint32_t mul_dma_unfl_is : 1;       /*!< [11..11] RSVD                                                             */
            uint32_t            : 20;
    } is_b;
  } ;
  
  union {
    __IOM uint32_t gf;                          /*!< (@ 0x0000007C) SGPIO Glitch Filter Register                               */
    
    struct {
      __IOM uint32_t gf         : 8;            /*!< [7..0] RSVD                                                               */
            uint32_t            : 24;
    } gf_b;
  } ;
  
  union {
    __IOM uint32_t output;                      /*!< (@ 0x00000080) SGPIO Output Register                                      */
    
    struct {
      __IOM uint32_t output     : 1;            /*!< [0..0] RSVD                                                               */
            uint32_t            : 31;
    } output_b;
  } ;
  
  union {
    __IOM uint32_t im;                          /*!< (@ 0x00000084) SGPIO Interrupt Mask Register                              */
    
    struct {
      __IOM uint32_t rx_mr0i_im : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t rx_mr1i_im : 1;            /*!< [1..1] RSVD                                                               */
      __IOM uint32_t rx_mr2i_im : 1;            /*!< [2..2] RSVD                                                               */
      __IOM uint32_t mul_mr0i_im : 1;           /*!< [3..3] RSVD                                                               */
      __IOM uint32_t capi_im    : 1;            /*!< [4..4] RSVD                                                               */
      __IOM uint32_t rxsft_im   : 1;            /*!< [5..5] RSVD                                                               */
      __IOM uint32_t mulsft_im  : 1;            /*!< [6..6] RSVD                                                               */
      __IOM uint32_t rxload_im  : 1;            /*!< [7..7] RSVD                                                               */
      __IOM uint32_t mulload_im : 1;            /*!< [8..8] RSVD                                                               */
      __IOM uint32_t pattern_match_im : 1;      /*!< [9..9] RSVD                                                               */
      __IOM uint32_t mulmcnt_im : 1;            /*!< [10..10] RSVD                                                             */
      __IOM uint32_t mul_dma_unfl_im : 1;       /*!< [11..11] RSVD                                                             */
            uint32_t            : 20;
    } im_b;
  } ;
} SGPIO_Type;                                   /*!< Size = 136 (0x88)                                                         */



/* =========================================================================================================================== */
/* ================                                         ETHERNET                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief ETHERNET - for Ethernet connectivity (ETHERNET)
  */

typedef struct {                                /*!< (@ 0x40054000) ETHERNET Structure                                         */
  
  union {
    __IOM uint32_t idr0;                        /*!< (@ 0x00000000) MAC ID Register 1                                          */
    
    struct {
      __IOM uint32_t idr3       : 8;            /*!< [7..0] 4th byte of MAC ID                                                 */
      __IOM uint32_t idr2       : 8;            /*!< [15..8] 3rd byte of MAC ID                                                */
      __IOM uint32_t idr1       : 8;            /*!< [23..16] 2nd byte of MAC ID                                               */
      __IOM uint32_t idr0       : 8;            /*!< [31..24] 1st byte of MAC ID                                               */
    } idr0_b;
  } ;
  
  union {
    __IOM uint32_t idr4;                        /*!< (@ 0x00000004) MAC ID Register 2                                          */
    
    struct {
            uint32_t            : 16;
      __IOM uint32_t idr5       : 8;            /*!< [23..16] 6th byte of MAC ID                                               */
      __IOM uint32_t idr4       : 8;            /*!< [31..24] 5th byte of MAC ID                                               */
    } idr4_b;
  } ;
  
  union {
    __IOM uint32_t mar0;                        /*!< (@ 0x00000008) Multicast Add Register 1                                   */
    
