Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t mar3       : 8;            /*!< [7..0] 4st byte of multicast address register                             */
      __IOM uint32_t mar2       : 8;            /*!< [15..8] 3st byte of multicast address register                            */
      __IOM uint32_t mar1       : 8;            /*!< [23..16] 2st byte of multicast address register                           */
      __IOM uint32_t mar0       : 8;            /*!< [31..24] 1st byte of multicast address register                           */
    } mar0_b;
  } ;
  
  union {
    __IOM uint32_t mar4;                        /*!< (@ 0x0000000C) Multicast Add Register 2                                   */
    
    struct {
      __IOM uint32_t mar7       : 8;            /*!< [7..0] 8st byte of multicast address register                             */
      __IOM uint32_t mar6       : 8;            /*!< [15..8] 7st byte of multicast address register                            */
      __IOM uint32_t mar5       : 8;            /*!< [23..16] 6st byte of multicast address register                           */
      __IOM uint32_t mar4       : 8;            /*!< [31..24] 5st byte of multicast address register                           */
    } mar4_b;
  } ;
  
  union {
    __IOM uint32_t txok_rxok;                   /*!< (@ 0x00000010) TxRx Ok Counter Register                                   */
    
    struct {
      __IOM uint32_t rxok       : 16;           /*!< [15..0] 16-bit counter of Rx Ok packets. Rolls over automatically.
                                                     Write to clear.                                                           */
      __IOM uint32_t txok       : 16;           /*!< [31..16] 16-bit counter of Tx Ok packets. Rolls over automatically.
                                                     Write to clear.                                                           */
    } txok_rxok_b;
  } ;
  
  union {
    __IOM uint32_t txerr_rxerr;                 /*!< (@ 0x00000014) TxRx Error Counter Register                                */
    
    struct {
      __IOM uint32_t rxerr      : 16;           /*!< [15..0] 16-bit counter of Rx error packets. Rolls over automatically.
                                                     Write to clear.                                                           */
      __IOM uint32_t txerr      : 16;           /*!< [31..16] 16-bit counter of Tx error packets. Rolls over automatically.
                                                     Write to clear.                                                           */
    } txerr_rxerr_b;
  } ;
  __IM  uint32_t  RESERVED[8];
  
  union {
    __IOM uint32_t com;                         /*!< (@ 0x00000038) Command Register                                           */
    
    struct {
      __IOM uint32_t rst        : 1;            /*!< [0..0] Reset: Setting to 1 forces the Ethernet module to a software
                                                     reset state which disables the transmitter and receiver,
                                                     reinitializes the FIFOs, triggers interrupt Swint for RISC
                                                     to reset the system buffer pointer to the initial value
                                                     Tx/Rx FDP. This bit is 1 during the reset operation, and
                                                     is cleared to 0 by the Ethernet Module when the reset operation
                                                     is complete.                                                              */
      __IOM uint32_t rxchksum   : 1;            /*!< [1..1] Receive checksum offload enable. 1: Enable. 0: Disable.            */
      __IOM uint32_t rxvlan     : 1;            /*!< [2..2] Receive VLAN de-tagging enable. 1: Enable. 0: Disable.             */
      __IOM uint32_t rxjumbo    : 1;            /*!< [3..3] 1: support jumbo packet receiving. The maximum packet
                                                     size is 16384 Bytes (0x4000).0: Does not support jumbo
                                                     packet receiving.                                                         */
            uint32_t            : 28;
    } com_b;
  } ;
  
  union {
    __IOM uint32_t isr_imr;                     /*!< (@ 0x0000003C) Interrupt Status & Interrupt Mask Register                 */
    
    struct {
      __IOM uint32_t isr_rok    : 1;            /*!< [0..0] Interrupt status of Rx ok. Write 1 to clear                        */
      __IOM uint32_t isr_cnt_wrap : 1;          /*!< [1..1] Interrupt status of Tx/Rx counter wrap interrupt. Write
                                                     1 to clear                                                                */
      __IOM uint32_t isr_rer_runt : 1;          /*!< [2..2] Interrupt status of Rx error caused by runt error characterized
                                                     by the frame length in bytes being less than 64 bytes.
                                                     Write 1 to clear                                                          */
            uint32_t            : 1;
      __IOM uint32_t isr_rer_ovf : 1;           /*!< [4..4] Interrupt status of Rx FIFO overflow. Write 1 to clear             */
      __IOM uint32_t isr_rdu    : 1;            /*!< [5..5] Interrupt status of Rx descriptor ring1 is unavailable.
                                                     Write 1 to clear                                                          */
      __IOM uint32_t isr_tok    : 1;            /*!< [6..6] Interrupt status of Tx ok. Write 1 to clear                        */
      __IOM uint32_t isr_ter    : 1;            /*!< [7..7] Interrupt status of Tx error. Write 1 to clear                     */
      __IOM uint32_t isr_linkchg : 1;           /*!< [8..8] Interrupt status of link change. Write 1 to clear                  */
      __IOM uint32_t isr_tdu    : 1;            /*!< [9..9] Interrupt status of Tx descriptor ring1 is unavailable.
                                                     Write 1 to clear                                                          */
      __IOM uint32_t isr_swint  : 1;            /*!< [10..10] Interrupt status of software interrupt pending. Write
                                                     1 to clear                                                                */
      __IOM uint32_t isr_rdu2   : 1;            /*!< [11..11] Interrupt status of Rx descriptor ring2 is unavailable.
                                                     Write 1 to clear                                                          */
      __IOM uint32_t isr_rdu3   : 1;            /*!< [12..12] Interrupt status of Rx descriptor ring3 is unavailable.
                                                     Write 1 to clear                                                          */
      __IOM uint32_t isr_rdu4   : 1;            /*!< [13..13] Interrupt status of Rx descriptor ring4 is unavailable.
                                                     Write 1 to clear                                                          */
      __IOM uint32_t isr_rdu5   : 1;            /*!< [14..14] Interrupt status of Rx descriptor ring5 is unavailable.
                                                     Write 1 to clear                                                          */
      __IOM uint32_t isr_rdu6   : 1;            /*!< [15..15] Interrupt status of Rx descriptor ring6 is unavailable.
                                                     Write 1 to clear                                                          */
      __IOM uint32_t imr_rok    : 1;            /*!< [16..16] Interrupt mask of Rx ok                                          */
      __IOM uint32_t imr_cnt_wrap : 1;          /*!< [17..17] Interrupt mask of Tx/Rx counter wrap interrupt                   */
      __IOM uint32_t imr_rer_runt : 1;          /*!< [18..18] Interrupt mask of Rx error caused by runt error characterized
                                                     by the frame length in bytes being less than 64 bytes                     */
            uint32_t            : 1;
      __IOM uint32_t imr_rer_ovf : 1;           /*!< [20..20] Interrupt mask of Rx FIFO overflow                               */
      __IOM uint32_t imr_rdu    : 1;            /*!< [21..21] Interrupt mask of Rx descriptor ring1 is unavailable             */
      __IOM uint32_t imr_tok    : 1;            /*!< [22..22] Interrupt mask of Tx ok                                          */
      __IOM uint32_t imr_ter    : 1;            /*!< [23..23] Interrupt mask of Tx error                                       */
      __IOM uint32_t imr_linkchg : 1;           /*!< [24..24] Interrupt mask of link change                                    */
      __IOM uint32_t imr_tdu    : 1;            /*!< [25..25] Interrupt mask of Tx descriptor ring1 is unavailable             */
      __IOM uint32_t imr_swint  : 1;            /*!< [26..26] Interrupt mask of software interrupt pending                     */
      __IOM uint32_t imr_rdu2   : 1;            /*!< [27..27] Interrupt mask of Rx descriptor ring2 is unavailable             */
      __IOM uint32_t imr_rdu3   : 1;            /*!< [28..28] Interrupt mask of Rx descriptor ring3 is unavailable             */
      __IOM uint32_t imr_rdu4   : 1;            /*!< [29..29] Interrupt mask of Rx descriptor ring4 is unavailable             */
      __IOM uint32_t imr_rdu5   : 1;            /*!< [30..30] Interrupt mask of Rx descriptor ring5 is unavailable             */
      __IOM uint32_t imr_rdu6   : 1;            /*!< [31..31] Interrupt mask of Rx descriptor ring6 is unavailable             */
    } isr_imr_b;
  } ;
  
  union {
    __IOM uint32_t tc;                          /*!< (@ 0x00000040) Transmit Configuration Register                            */
    
