Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t r_tx_nopadding : 1;        /*!< [0..0] 1: HW does not pad short packet (< 60B).0: HW pads short
                                                     packet to 64B.                                                            */
            uint32_t            : 7;
      __IOM uint32_t lbk        : 2;            /*!< [9..8] The loopback function must be independent of the link
                                                     state.2'b00: normal operation2'b01: Loopback mode_R2T (lbkmode_r2t)
                                                     :2'b10: Reserved2'b11: Loopback mode (lbk_mode).                          */
      __IOM uint32_t ifg        : 3;            /*!< [12..10] InterFrameGap Time: This field allows the user to adjust
                                                     the interframe gap time longer than the standard: 9.6 us
                                                     for 10Mbps, 960 ns for 100Mbps. The time can be programmed
                                                     from 9.6 us to 14.4 us (10Mbps) and 960ns to 1440ns (100Mbps)             */
            uint32_t            : 19;
    } tc_b;
  } ;
  
  union {
    __IOM uint32_t rc;                          /*!< (@ 0x00000044) Receive Configuration Register                             */
    
    struct {
      __IOM uint32_t aap        : 1;            /*!< [0..0] Set to 1 to accept all packets with physical destination
                                                     address, 0 to reject                                                      */
      __IOM uint32_t apm        : 1;            /*!< [1..1] Set to 1 to accept physical match packets, 0 to reject.            */
      __IOM uint32_t am         : 1;            /*!< [2..2] Set to 1 to accept multicast packets, 0 to reject.                 */
      __IOM uint32_t ab         : 1;            /*!< [3..3] Set to 1 to accept broadcast packets, 0 to reject                  */
      __IOM uint32_t ar         : 1;            /*!< [4..4] Accept Runt: This bit allows the receiver to accept packets
                                                     that are smaller than 64 bytes. The packet must be at least
                                                     8 bytes long to be accepted as a runt. Set to 1 to accept
                                                     runt packets.                                                             */
      __IOM uint32_t aer        : 1;            /*!< [5..5] Accept Error PacketWhen set to 1, all packets with CRC
                                                     error, alignment error, and/or collided fragments will
                                                     be accepted; When set to 0, all packets with CRC error,
                                                     alignment error, and/or collided fragments will be rejected.              */
      __IOM uint32_t aflow      : 1;            /*!< [6..6] Accept flow control : When set to 1, flow control packet
                                                     will also be received & DMA to rx buffer for debug. Default
                                                     is 0                                                                      */
            uint32_t            : 25;
    } rc_b;
  } ;
  __IM  uint32_t  RESERVED1[4];
  
  union {
    __IOM uint32_t ms;                          /*!< (@ 0x00000058) Media Status Register                                      */
    
    struct {
      __IOM uint32_t refclk_on  : 1;            /*!< [0..0] 1: REF_CLK on0: REF_CLK off                                        */
      __IOM uint32_t refclk_phase : 1;          /*!< [1..1] 1: TXEN/TXD are transitioned in the falling edge; RXD
                                                     are also sampled in the falling edge0: TXEN/TXD are transitioned
                                                     in the rising edge; RXD are also sampled in the rising
                                                     edge                                                                      */
            uint32_t            : 4;
      __IOM uint32_t gmac_md_mst : 1;           /*!< [6..6] 1: GMAC is used to be MDIO master.0: GMAC is used to
                                                     be MDIO slave.                                                            */
      __IOM uint32_t reg_rmii2mii_en : 1;       /*!< [7..7] 1: transfer MII signals to RMII signalsThis function
                                                     is only valid in MII mode.                                                */
            uint32_t            : 2;
      __IOM uint32_t force_spd_mode : 1;        /*!< [10..10] 1: gmac is in force speed mode.0: gmac speed status
                                                     is from md operation.                                                     */
      __IOM uint32_t rgmii_tx_encode_sts : 1;   /*!< [11..11] This bit is valid only in phy mode. 0: Does not support
                                                     rgmii in band status(link status, speed and duplex mode
                                                     of the PHY) by encoding txd.1: Supports rgmii in band status(link
                                                     status, speed and duplex mode of the PHY) by encoding txd.                */
      __IOM uint32_t rgmii_rx_decode_sts : 1;   /*!< [12..12] 0: Does not support rgmii in band status (link status,
                                                     speed and duplex mode of the PHY) by decoding rxd.1: Supports
                                                     rgmii in band status (link status, speed and duplex mode
                                                     of the PHY) by decoding rxd.                                              */
      __IOM uint32_t gmac_phy_mode : 1;         /*!< [13..13] 1: in phy mode.0: not in phy mode.                               */
            uint32_t            : 1;
      __IOM uint32_t gmac_sel_phyif_0 : 1;      /*!< [15..15] 1: phy interface 0.works.0: phy interface 1 works.               */
      __IOM uint32_t force_spd  : 2;            /*!< [17..16] Force gmac in 10/100/GIGA mode.2'b00: 100M2'b01: 10M2'b10:
                                                     GIGA2'b11: not force mode.                                                */
      __IOM uint32_t forcelink  : 1;            /*!< [18..18] Force gmac in link ok mode. 1'b1: force gmac in linkok.1'b0:
                                                     link status is from MDIO auto-polling.                                    */
      __IOM uint32_t forcedfulldup : 1;         /*!< [19..19] Force gmac operates at full duplex mode. 1'b1: force
                                                     gmac in full duplex mode.1'b0: duplex status is from MDIO
                                                     auto-polling. Not means gmac is in half duplex mode.                      */
      __IOM uint32_t sel_mii    : 1;            /*!< [20..20] Indicates in mii mode.                                           */
      __IOM uint32_t nwcomplete : 1;            /*!< [21..21] Nway complete                                                    */
      __IOM uint32_t fulldupreg : 1;            /*!< [22..22] Indicates Full duplex mode from mdio results.                    */
      __IOM uint32_t sel_rgmii  : 1;            /*!< [23..23] Selects RGMII interface                                          */
      __IOM uint32_t rxpf       : 1;            /*!< [24..24] Pause Flag1 = Ethernet module is in backoff state because
                                                     a pause packet received.0 = pause state is clear.                         */
      __IOM uint32_t txpf       : 1;            /*!< [25..25] Tx Pause frame1 = Ethernet module has sent a pause
                                                     packet.0 = the Ethernet module has sent a timer done packet.              */
      __IOM uint32_t linkb      : 1;            /*!< [26..26] Inverse of Link status. 0 = Link OK. 1 = Link Fail.              */
      __IOM uint32_t speed_10   : 1;            /*!< [27..27] {SPEED_1000, SPEED_10} 00: 100Mbps, 01: 10Mbps                   */
      __IOM uint32_t speed_1000 : 1;            /*!< [28..28] {SPEED_1000, SPEED_10} 10: 1000Mbps, 11: not allowed             */
      __IOM uint32_t txfce      : 1;            /*!< [29..29] Tx Flow Control Enable1 = tx flow control enabled.0
                                                     = tx flow control disabled.                                               */
      __IOM uint32_t rxfce      : 1;            /*!< [30..30] RX Flow control Enable: The flow control is enabled
                                                     in full-duplex mode only. Packets are dropped if buffer
                                                     is exhausted. Default is 0.1 = Rx Flow Control Enabled.0
                                                     = Rx Flow Control Disabled.                                               */
      __IOM uint32_t force_trxfce : 1;          /*!< [31..31] Force Tx/RX Flow Control:1 = enabled Flow control in
                                                     the absence of NWAY.0 = disables Flow control in the absence
                                                     of NWAY.                                                                  */
    } ms_b;
  } ;
  
  union {
    __IOM uint32_t miia;                        /*!< (@ 0x0000005C) MII Access Register                                        */
    
