Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t data       : 16;           /*!< [15..0] Defines the MII resgister data.                                   */
      __IOM uint32_t regaddr    : 5;            /*!< [20..16] Defines the MII register address.                                */
            uint32_t            : 1;
      __IOM uint32_t disable_auto_polling : 1;  /*!< [22..22] Disable auto polling feature of mdio operation.0: HW
                                                     auto polling PCS status. 1: HW does not auto polling PCS
                                                     status.                                                                   */
            uint32_t            : 3;
      __IOM uint32_t phyaddr    : 5;            /*!< [30..26] Defines the Phy address for the MII.                             */
      __IOM uint32_t flag       : 1;            /*!< [31..31] Flag bit, used to identify access to MII register1:
                                                     Write data to MII register. Turns to 0 automatically upon
                                                     completion of MAC writing to the specified MII register.0:
                                                     Read data from MII register. Turns to 1 automatically upon
                                                     completion of MAC reading the specified MII register.                     */
    } miia_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t vlan;                        /*!< (@ 0x00000064) VLAN Register                                              */
    
    struct {
            uint32_t            : 15;
      __IOM uint32_t tdsc_vlan_type : 1;        /*!< [15..15] 1: tx_vlan_action field in the Tx command descriptor
                                                     is for s-tag.0: tx_vlan_action field in the Tx command
                                                     descriptor is for c-tag.                                                  */
      __IOM uint32_t stag_pid   : 16;           /*!< [31..16] Set the s-tag protocol identifier.                               */
    } vlan_b;
  } ;
  __IM  uint32_t  RESERVED3[1190];
  
  union {
    __IOM uint32_t txfdp1;                      /*!< (@ 0x00001300) Tx 1st Descriptor Ring Address Register                    */
    
    struct {
      __IOM uint32_t txfdp1     : 32;           /*!< [31..0] Tx 1st priority Descriptor Pointer to the Tx Ring.                */
    } txfdp1_b;
  } ;
  
  union {
    __IOM uint32_t txcdo1;                      /*!< (@ 0x00001304) Tx 1st Current Descriptor Offset Register                  */
    
    struct {
      __IOM uint32_t txcdo1     : 12;           /*!< [11..0] Tx 1st priority current descriptor offset: FDP+CDO =
                                                     current descriptor pointer. CDO increments by 16 bytes
                                                     each time.                                                                */
            uint32_t            : 20;
    } txcdo1_b;
  } ;
  __IM  uint32_t  RESERVED4[58];
  
  union {
    __IOM uint32_t rxfdp1;                      /*!< (@ 0x000013F0) Rx 1st Descriptor Ring Address Register                    */
    
    struct {
      __IOM uint32_t rxfdp1     : 32;           /*!< [31..0] Rx 1st queue Descriptor Pointer to the Rx Ring.                   */
    } rxfdp1_b;
  } ;
  
  union {
    __IOM uint32_t rxrs1cdo1;                   /*!< (@ 0x000013F4) Rx 1st Descriptor Ring Size & 1st Current Descriptor
                                                                    Offset Register                                            */
    
    struct {
      __IOM uint32_t rxringsize_1_h : 4;        /*!< [3..0] This is the bit[11:8] of RxRingSize1.                              */
            uint32_t            : 4;
      __IOM uint32_t rxringsize_1_l : 8;        /*!< [15..8] This is the total number of descriptors in the Rx descriptor
                                                     rings of 1st queue. (bit[7:0] of RxRingSize1)Act as bit
                                                     mask, eg. RxRingSize [11:0]:0000_0000_1111: 16 descriptors0000_0001_1111:
                                                     32 descriptors0000_0011_1111: 64 descriptors0000_0111_1111:
                                                     128 descriptors0000_1111_1111: 256 descriptors0001_1111_1111:
                                                     512 descriptors0011_1111_1111: 1024 descriptors0111_1111_1111:
                                                     2048 descriptors1111_1111_1111: 4096 descriptors Any other
                                                     value in this register yields undefined resul                             */
      __IOM uint32_t rxcdo1     : 12;           /*!< [27..16] Rx Current Descriptor Offset of 1st queue: RxFDP +
                                                     RxCDO = current descriptor pointer. CDO increments by 16
                                                     each time (each increment is one byte).                                   */
            uint32_t            : 4;
    } rxrs1cdo1_b;
  } ;
  __IM  uint32_t  RESERVED5[13];
  
  union {
    __IOM uint32_t rx_pse_des_thres_1_h;        /*!< (@ 0x0000142C) PHY Mode Clock Phase Control Register                      */
    
    struct {
            uint32_t            : 5;
      __IOM uint32_t phy_mode_clk_phase_chg : 1;/*!< [5..5] Changes the clock phase in the PHY mode                            */
            uint32_t            : 26;
    } rx_pse_des_thres_1_h_b;
  } ;
  
  union {
    __IOM uint32_t etnrxcpu1;                   /*!< (@ 0x00001430) Rx Ring1 Threshold Register                                */
    
    struct {
      __IOM uint32_t etnrxcpu1  : 32;           /*!< [31..0] Rx ring1 threshold settings                                       */
    } etnrxcpu1_b;
  } ;
  
  union {
    __IOM uint32_t io_cmd;                      /*!< (@ 0x00001434) I/O Command Register 0                                     */
    
