Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
            uint32_t            : 8;
      __IOM uint32_t txfn5th    : 1;            /*!< [8..8] 5th Priority DMA-Ethernet Transmit enable.1: Enable.
                                                     0: Disable.                                                               */
            uint32_t            : 5;
      __IOM uint32_t Tx_hl_pri_se : 2;          /*!< [15..14] 2'b00: TX ring uses strict priority.2'b01: TX ring
                                                     uses high and low queue priority. Inside high queue, tx
                                                     ring is round robin. Inside low queue, tx ring is round
                                                     robin. Strict priority is used for high and low queue selection.2'b10
                                                     and 2'b11: Reserved.                                                      */
      __IOM uint32_t rxring1    : 1;            /*!< [16..16] Ethernet-DMA Receive Ring1 enable.1: Enable.0: Disable.          */
      __IOM uint32_t rxring2    : 1;            /*!< [17..17] Ethernet-DMA Receive Ring2 enable.1: Enable. 0: Disable.         */
      __IOM uint32_t rxring3    : 1;            /*!< [18..18] Ethernet-DMA Receive Ring3 enable.1: Enable. 0: Disable.         */
      __IOM uint32_t rxring4    : 1;            /*!< [19..19] Ethernet-DMA Receive Ring4 enable.1: Enable. 0: Disable.         */
      __IOM uint32_t rxring5    : 1;            /*!< [20..20] Ethernet-DMA Receive Ring5 enable.1: Enable. 0: Disable.         */
      __IOM uint32_t rxring6    : 1;            /*!< [21..21] Ethernet-DMA Receive Ring6 enable.1: Enable. 0: Disable.         */
            uint32_t            : 2;
      __IOM uint32_t en_1gb     : 1;            /*!< [24..24] 1: support 1GB addressing in lx master bus.0: Not support.       */
      __IOM uint32_t en_rx_mring : 1;           /*!< [25..25] Enable rx multiple rings.1: rx using multiple rings.
                                                     max: 6 rings (ring1 to ring6).0: rx using single ring (ring1
                                                     only).                                                                    */
      __IOM uint32_t rxokint_msk_128b : 1;      /*!< [26..26] 1: For ingress pkt which is short than 128B, RxOK interrupt
                                                     asserts after DMA completes (compatible issue).0: For ingress
                                                     pkt which is short than 128B, RxOK interrupt does not assert
                                                     after DMA completes.                                                      */
      __IOM uint32_t en_precise_dma : 1;        /*!< [27..27] 0: disable precise DMA transfer.1: enable precise DMA
                                                     transfer.                                                                 */
      __IOM uint32_t dsc_format_extra : 3;      /*!< [30..28] Extra descriptor format.SW should set this field before
                                                     set io_cmd.te or io_cmd.re to 1.                                          */
            uint32_t            : 1;
    } io_cmd1_b;
  } ;
} ETHERNET_Type;                                /*!< Size = 5180 (0x143c)                                                      */



/* =========================================================================================================================== */
/* ================                                           SDMMC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief SDMMC Host - for SD memory card storage (SDMMC)
  */

typedef struct {                                /*!< (@ 0x40058000) SDMMC Structure                                            */
  __IM  uint32_t  RESERVED[256];
  
  union {
    __IOM uint32_t sram_ctl;                    /*!< (@ 0x00000400) SRAM Control Register                                      */
    
    struct {
      __IOM uint32_t mem_region : 4;            /*!< [3..0] Set this bit to enable buffer SRAM direct access mode.             */
      __IOM uint32_t access_en  : 1;            /*!< [4..4] Set this bit to enable buffer SRAM direct access mode.             */
      __IOM uint32_t map_sel    : 1;            /*!< [5..5] 0: R-Bus = x01020304 => to flash 01, 02, 03, 04; 1: R-Bus
                                                     = x01020304 => to flash 04, 03, 02, 01                                    */
      __IOM uint32_t lx_burst_size : 2;         /*!< [7..6] Set the Lexra burst size.0: 64 Bytes; 1: 128 Bytes; 2:
                                                     256 Bytes; 3: 128 Bytes                                                   */
            uint32_t            : 24;
    } sram_ctl_b;
  } ;
  
  union {
    __IOM uint32_t dma_ctl1;                    /*!< (@ 0x00000404) DMA Control Register 1                                     */
    
    struct {
      __IOM uint32_t dram_sa    : 28;           /*!< [27..0] Dram start address for DMA transfer. This information
                                                     will be map to addcmd. (8 Bytes Unit, 1 means 8B)                         */
            uint32_t            : 4;
    } dma_ctl1_b;
  } ;
  
  union {
    __IOM uint32_t dma_ctl2;                    /*!< (@ 0x00000408) DMA Control Register 2                                     */
    
    struct {
      __IOM uint32_t dma_len    : 16;           /*!< [15..0] Transfer length for DMA transfer between DMA buffer
                                                     and DDR. (512B Unit, 1 means 512B)                                        */
            uint32_t            : 16;
    } dma_ctl2_b;
  } ;
  
  union {
    __IOM uint32_t dma_ctl3;                    /*!< (@ 0x0000040C) DMA Control Register 3                                     */
    
