Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t dma_xfer   : 1;            /*!< [0..0] Set this bit to transfer data between DRAM and DMA buffer.
                                                     Direction must be set at next bit. The transfer length
                                                     is reference to DMA_CTL2[15:0]. This bit will be auto clear
                                                     when transfer done.                                                       */
      __IOM uint32_t ddr_wr     : 1;            /*!< [1..1] 1: Move data from DMA buffer to DDR; 0: Move data from
                                                     DDR to DMA Buffer.                                                        */
            uint32_t            : 2;
      __IOM uint32_t rsp17_sel  : 1;            /*!< [4..4] For response is R2 case, reponse will transfer by dma
                                                     and not store in register.1: dma count to 16byte and send
                                                     sb1_req; 0: normal case.                                                  */
      __IOM uint32_t dat64_sel  : 1;            /*!< [5..5] For CMD6 case, read data length is 64byte (less than
                                                     256 byte)1: dma count to 64byte and send sb1_req; 0: normal
                                                     case.                                                                     */
            uint32_t            : 26;
    } dma_ctl3_b;
  } ;
  
  union {
    __IOM uint32_t sys_low_pwr;                 /*!< (@ 0x00000410) Low Power Control Register                                 */
    
    struct {
      __IOM uint32_t dma_sram_rdy_num : 4;      /*!< [3..0] DMA SRAM ready cycle (leave sleep mode)(N+1) * clk_sys
                                                     period                                                                    */
      __IOM uint32_t dma_sram_lp_ena : 1;       /*!< [4..4] DMA SRAM low power enable                                          */
            uint32_t            : 1;
      __IOM uint32_t sys_clk_gate_ena : 1;      /*!< [6..6] DMA clk_sys gating enable                                          */
            uint32_t            : 25;
    } sys_low_pwr_b;
  } ;
  __IM  uint32_t  RESERVED1[4];
  
  union {
    __IOM uint32_t sd_isr;                      /*!< (@ 0x00000424) SD Interrupt Status Register                               */
    
    struct {
      __IOM uint32_t write_data : 1;            /*!< [0..0] 1 to set, 0 to clear bit with 1.                                   */
      __IOM uint32_t int1       : 1;            /*!< [1..1] SD Int1. Card End.                                                 */
      __IOM uint32_t int2       : 1;            /*!< [2..2] SD Int2. Card Error.                                               */
            uint32_t            : 1;
      __IOM uint32_t int4       : 1;            /*!< [4..4] SD Int4. DMA transfer done INT.                                    */
            uint32_t            : 27;
    } sd_isr_b;
  } ;
  
  union {
    __IOM uint32_t sd_isren;                    /*!< (@ 0x00000428) SD Interrupt Enable Register                               */
    
    struct {
      __IOM uint32_t write_data : 1;            /*!< [0..0] 1 to set, 0 to clear bit with 1.                                   */
      __IOM uint32_t int1en     : 1;            /*!< [1..1] SD Int1 EnableCard End INT Enable.                                 */
      __IOM uint32_t int2en     : 1;            /*!< [2..2] SD Int2 EnableCard Error INT Enable.                               */
            uint32_t            : 1;
      __IOM uint32_t int4en     : 1;            /*!< [4..4] SD Int4 Enabledma_clr INT Enable.                                  */
            uint32_t            : 27;
    } sd_isren_b;
  } ;
  __IM  uint32_t  RESERVED2[18];
  
  union {
    __IOM uint32_t pad_ctl;                     /*!< (@ 0x00000474) Pad Control Register                                       */
    
    struct {
      __IOM uint32_t tune3318   : 1;            /*!< [0..0] Pad select 3.3v or 1.8v.1: 3.3v; 0: 1.8v                           */
            uint32_t            : 31;
    } pad_ctl_b;
  } ;
  
  union {
    __IOM uint32_t ckgen_ctl;                   /*!< (@ 0x00000478) Clock Generation Control Register                          */
    
    struct {
      __IOM uint32_t clk_div    : 3;            /*!< [2..0] 000: div1; 001: div2; 010: div4; 011: div8                         */
            uint32_t            : 1;
      __IOM uint32_t crc_clk_src : 2;           /*!< [5..4] 00: ssc_clk; 01: ssc_clk_vp0; 10: ssc_clk_vp1                      */
            uint32_t            : 2;
      __IOM uint32_t sd30_push_clk_src : 2;     /*!< [9..8] 00: ssc_clk; 01: ssc_clk_vp0; 10: ssc_clk_vp1                      */
            uint32_t            : 2;
      __IOM uint32_t sd30_sample_clk_src : 2;   /*!< [13..12] 00: ssc_clk; 01: ssc_clk_vp0; 10: ssc_clk_vp1                    */
            uint32_t            : 2;
      __IOM uint32_t crc_clk_change : 1;        /*!< [16..16] 0: from crc_clk_src; 1: clk4M                                    */
      __IOM uint32_t sd30_push_change : 1;      /*!< [17..17] 0: from sd30_push_clk_src; 1: clk4M                              */
      __IOM uint32_t sd30_sample_change : 1;    /*!< [18..18] 0: from sd30_sample_clk_src; 1: clk4M                            */
            uint32_t            : 13;
    } ckgen_ctl_b;
  } ;
  __IM  uint32_t  RESERVED3[33];
  __IM  uint16_t  RESERVED4;
  
  union {
    __IOM uint8_t card_drive_sel;               /*!< (@ 0x00000502) Card Driving Selection Register                            */
    
    struct {
      __IOM uint8_t cf_drive    : 2;            /*!< [1..0] CF Interface Drive.00: 4mA; 01: 8mA; 10: 12mA; 11: 12mA            */
      __IOM uint8_t xd_drive    : 2;            /*!< [3..2] XD Interface Drive.00: 4mA; 01: 8mA; 10: 12mA; 11: 12mA            */
      __IOM uint8_t sd_drive    : 2;            /*!< [5..4] SD DAT7~4 Interface Drive.00: 4mA; 01: 8mA; 10: 12mA;
                                                     11: 12mA                                                                  */
      __IOM uint8_t ms_drive    : 2;            /*!< [7..6] MS Interface Drive.00: 4mA; 01: 8mA; 10: 12mA; 11: 12mA            */
    } card_drive_sel_b;
  } ;
  
  union {
    __IOM uint8_t card_stop;                    /*!< (@ 0x00000503) Stop Transfer Register                                     */
    
