Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint8_t cf_module   : 1;            /*!< [0..0] Target module is CF/MD card module. If set this bit the
                                                     transfer will be stop and the state machine of transfer
                                                     will return idle state.                                                   */
      __IOM uint8_t sm_module   : 1;            /*!< [1..1] Target module is SM/XD card module. If set this bit the
                                                     transfer will be stop and the state machine of transfer
                                                     will return idle state.                                                   */
      __IOM uint8_t sd_module   : 1;            /*!< [2..2] Target module is SD/MMC card module (SD). If set this
                                                     bit the transfer will be stop and the state machine of
                                                     transfer will return idle state.                                          */
      __IOM uint8_t ms_module   : 1;            /*!< [3..3] Target module is MS/MS-Pro/HG card module (MS). If set
                                                     this bit the transfer will be stop and the state machine
                                                     of transfer will return idle state.                                       */
      __IOM uint8_t sd2_module  : 1;            /*!< [4..4] Target module is SD/MMC card module (SD2). If set this
                                                     bit the transfer will be stop and the state machine of
                                                     transfer will return idle state.                                          */
      __IOM uint8_t ms2_module  : 1;            /*!< [5..5] Target module is MS/MS-Pro/HG card module (MS2). If set
                                                     this bit the transfer will be stop and the state machine
                                                     of transfer will return idle state.                                       */
            uint8_t             : 2;
    } card_stop_b;
  } ;
  __IM  uint32_t  RESERVED5[2];
  __IM  uint16_t  RESERVED6;
  
  union {
    __IOM uint8_t card_select;                  /*!< (@ 0x0000050E) Card Type Select Register                                  */
    
    struct {
      __IOM uint8_t card_sel    : 3;            /*!< [2..0] Card Select. Specify the current active card module.000:
                                                     CF module001: XD module010: SD module011: MS module100:
                                                     I2C module101: Reserved110: SD2 module111: MS2 module                     */
            uint8_t             : 5;
    } card_select_b;
  } ;
  __IOM uint8_t   dummy1;                       /*!< (@ 0x0000050F) Dummy Register 1                                           */
  __IM  uint32_t  RESERVED7[3];
  __IM  uint16_t  RESERVED8;
  __IM  uint8_t   RESERVED9;
  
  union {
    __IOM uint8_t card_exist;                   /*!< (@ 0x0000051F) Card Detection Register                                    */
    
    struct {
      __IOM uint8_t cf_exist    : 1;            /*!< [0..0] CF Existence. If this bit is set it means CF/MD card
                                                     is in its socket.                                                         */
      __IOM uint8_t sm_exist    : 1;            /*!< [1..1] SM Existence. If this bit is set it means SM card is
                                                     in its socket.                                                            */
      __IOM uint8_t sd_exist    : 1;            /*!< [2..2] SD Existence. If this bit is set it means SD/MMC card
                                                     is in its socket.                                                         */
      __IOM uint8_t ms_exist    : 1;            /*!< [3..3] MS Existence. If this bit is set it means MS/MS-pro card
                                                     is in its socket.                                                         */
      __IOM uint8_t xd_exist    : 1;            /*!< [4..4] XD Existence. If this bit is set it means XD card is
                                                     in its socket.                                                            */
      __IOM uint8_t sd_wp       : 1;            /*!< [5..5] SD Write Protect. If this bit is set it means SD card
                                                     is mechanical write protected.                                            */
      __IOM uint8_t xd_wp       : 1;            /*!< [6..6] XD_WP Input. If the XD_WP pin is configure as input,
                                                     this bit reflect the level of XD_WP signal directly.                      */
            uint8_t             : 1;
    } card_exist_b;
  } ;
  
  union {
    __IOM uint8_t card_int_en;                  /*!< (@ 0x00000520) Card Interrupt Enable Register                             */
    
    struct {
      __IOM uint8_t cf_int_en   : 1;            /*!< [0..0] CF Card Interrupt Enable. If this bit is set it enables
                                                     the interrupt of CF card                                                  */
      __IOM uint8_t sm_int_en   : 1;            /*!< [1..1] SM Card Interrupt Enable. If this bit is set it enables
                                                     the interrupt of SM card                                                  */
      __IOM uint8_t sd_int_en   : 1;            /*!< [2..2] SD/MMC Interrupt Enable. If this bit is set it enables
                                                     the interrupt of SD/MMC card                                              */
      __IOM uint8_t ms_int_en   : 1;            /*!< [3..3] MS/MS-pro/HG card Interrupt Enable. If this bit is set
                                                     it enables the interrupt of MS/MS-pro card                                */
      __IOM uint8_t xd_int_en   : 1;            /*!< [4..4] XD Card Interrupt Enable. If this bit is set it enables
                                                     the interrupt of XD card                                                  */
      __IOM uint8_t sd2_int_en  : 1;            /*!< [5..5] SD/MMC (SD2) Interrupt Enable. If this bit is set it
                                                     enables the interrupt of SD/MMC card                                      */
      __IOM uint8_t ms2_int_en  : 1;            /*!< [6..6] MS/MS-pro/HG (MS2) card Interrupt Enable. If this bit
                                                     is set it enables the interrupt of MS/MS-pro card                         */
      __IOM uint8_t gpio_int_en : 1;            /*!< [7..7] GPIO[0] Interrupt Enable. If this bit is set it enables
                                                     the interrupt of GPIO0                                                    */
    } card_int_en_b;
  } ;
  
  union {
    __IOM uint8_t card_int_pend;                /*!< (@ 0x00000521) Card Interrupt Status Register                             */
    
