Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint8_t cf_int_pend : 1;            /*!< [0..0] CF Card Interrupt Pending. If this bit is set it means
                                                     the interrupt of CF card is pending and write '1' to this
                                                     bit to clear the interrupt flag to '0'                                    */
      __IOM uint8_t sm_int_pend : 1;            /*!< [1..1] SM Card Interrupt Pending. If this bit is set it means
                                                     the interrupt of SM card is pending and write '1' to this
                                                     bit to clear the interrupt flag to '0'                                    */
      __IOM uint8_t sd_int_pend : 1;            /*!< [2..2] SD/MMC Interrupt Pending. If this bit is set it means
                                                     the interrupt of SD/MMC card is pending and write '1' to
                                                     this bit to clear the interrupt flag to '0'                               */
      __IOM uint8_t ms_int_pend : 1;            /*!< [3..3] MS/MS-pro/HG card Interrupt Pending. If this bit is set
                                                     it means the interrupt of MS/MS-pro card is pending and
                                                     write '1' to this bit to clear the interrupt flag to '0'                  */
      __IOM uint8_t xd_int_pend : 1;            /*!< [4..4] XD Card Interrupt Pending. If this bit is set it means
                                                     the interrupt of XD card is pending and write '1' to this
                                                     bit to clear the interrupt flag to '0'                                    */
      __IOM uint8_t sd2_int_pend : 1;           /*!< [5..5] SD/MMC (SD2) Interrupt Pending. If this bit is set it
                                                     means the interrupt of SD/MMC card is pending and write
                                                     '1' to this bit to clear the interrupt flag to '0'                        */
      __IOM uint8_t ms2_int_pend : 1;           /*!< [6..6] MS/MS-pro/HG (MS2) card Interrupt Pending. If this bit
                                                     is set it means the interrupt of MS/MS-pro card is pending
                                                     and write '1' to this bit to clear the interrupt flag to
                                                     '0'                                                                       */
      __IOM uint8_t gpio_int_pend : 1;          /*!< [7..7] GPIO[0] Interrupt Pending. If this bit is set it means
                                                     the interrupt of GPIO0 is pending and write '1' to this
                                                     bit to clear the interrupt flag to '0'                                    */
    } card_int_pend_b;
  } ;
  __IM  uint16_t  RESERVED10;
  __IM  uint32_t  RESERVED11;
  __IM  uint8_t   RESERVED12;
  
  union {
    __IOM uint8_t card_clk_en_ctl;              /*!< (@ 0x00000529) Card Clock Enable Control Register                         */
    
    struct {
      __IOM uint8_t cf_clk_en   : 1;            /*!< [0..0] CF Card Module Clock Enable Control. Disable clock can
                                                     save power. 0: Disable; 1: Enable                                         */
      __IOM uint8_t xd_clk_en   : 1;            /*!< [1..1] XD Card Module Clock Enable Control. Disable clock can
                                                     save power.0: Disable; 1: Enable                                          */
      __IOM uint8_t sd_clk_en   : 1;            /*!< [2..2] SD Card Module Clock Enable Control. Disable clock can
                                                     save power. 0: Disable; 1: Enable                                         */
      __IOM uint8_t ms_clk_en   : 1;            /*!< [3..3] MS Card Module Clock Enable Control. Disable clock can
                                                     save power. 0: Disable; 1: Enable                                         */
      __IOM uint8_t sd2_clk_en  : 1;            /*!< [4..4] SD2 Card Module Clock Enable Control. Disable clock can
                                                     save power.0: Disable; 1: Enable                                          */
      __IOM uint8_t ms2_clk_en  : 1;            /*!< [5..5] MS2 Card Module Clock Enable Control. Disable clock can
                                                     save power. 0: Disable; 1: Enable                                         */
      __IOM uint8_t sw_clk_mode : 1;            /*!< [6..6] Switch Clock Mode. Clk_en use FW configuration of HW
                                                     setting.0: Clk_en use FW configure1: Clk_en use HW setting                */
      __IOM uint8_t auto_cbw    : 1;            /*!< [7..7] Auto CBW Mode. Used for card select option.0: Card select
                                                     is configured by FW.1: Card select is configured by HW.                   */
    } card_clk_en_ctl_b;
  } ;
  __IM  uint16_t  RESERVED13;
  __IM  uint32_t  RESERVED14;
  
  union {
    __IOM uint8_t clk_pad_drive;                /*!< (@ 0x00000530) Clock Pad Driving Register                                 */
    
    struct {
      __IOM uint8_t nmos_drive  : 3;            /*!< [2..0] SD_CLK PAD NMOS drive select 3V3: 1V8:000: x 10.1 x 1.93001:
                                                     x 13.5 x 3.85010,100: x 16.9 x 5.78011,101: x 20.2 x 7.73110:
                                                     x 23.5 x 9.65111: x 26.8 x 11.5                                           */
      __IOM uint8_t pmos_drive  : 3;            /*!< [5..3] SD_CLK PAD PMOS drive select 3V3: 1V8:000: x 7,07 x 2.27001:
                                                     x 14.2 x 4.61010,100: x 21 x 6.68011,101: x 27.9 x 9.14110:
                                                     x 34.9 x 11.5111: x 42.4 x 13.8                                           */
            uint8_t             : 2;
    } clk_pad_drive_b;
  } ;
  
  union {
    __IOM uint8_t cmd_pad_drive;                /*!< (@ 0x00000531) Command Pad Driving Register                               */
    
