Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint8_t nmos_drive  : 3;            /*!< [2..0] SD_CMD PAD NMOS drive select 3V3: 1V8:000: x 10.1 x 1.93001:
                                                     x 13.5 x 3.85010,100: x 16.9 x 5.78011,101: x 20.2 x 7.73110:
                                                     x 23.5 x 9.65111: x 26.8 x 11.5                                           */
      __IOM uint8_t pmos_drive  : 3;            /*!< [5..3] SD_CMD PAD PMOS drive select3V3: 1V8:000: x 7,07 x 2.27001:
                                                     x 14.2 x 4.61010,100: x 21 x 6.68011,101: x 27.9 x 9.14110:
                                                     x 34.9 x 11.5111: x 42.4 x 13.8                                           */
            uint8_t             : 2;
    } cmd_pad_drive_b;
  } ;
  
  union {
    __IOM uint8_t dat_pad_drive;                /*!< (@ 0x00000532) Data Pad Driving Register                                  */
    
    struct {
      __IOM uint8_t nmos_drive  : 3;            /*!< [2..0] SD_DAT[3:0] PAD NMOS drive select 3V3: 1V8:000: x 10.1
                                                     x 1.93001: x 13.5 x 3.85010,100: x 16.9 x 5.78011,101:
                                                     x 20.2 x 7.73110: x 23.5 x 9.65111: x 26.8 x 11.5                         */
      __IOM uint8_t pmos_drive  : 3;            /*!< [5..3] SD_DAT[3:0] PAD PMOS drive select3V3: 1V8:000: x 7,07
                                                     x 2.27001: x 14.2 x 4.61010,100: x 21 x 6.68011,101: x
                                                     27.9 x 9.14110: x 34.9 x 11.5111: x 42.4 x 13.8                           */
            uint8_t             : 2;
    } dat_pad_drive_b;
  } ;
  __IM  uint8_t   RESERVED15;
  __IM  uint32_t  RESERVED16[19];
  
  union {
    __IOM uint8_t sd_config1;                   /*!< (@ 0x00000580) SD Configuration Register 1                                */
    
    struct {
      __IOM uint8_t bus_width   : 2;            /*!< [1..0] 00: 1-bit bus01: 4-bit bus10: 8-bit bus11: Reserved                */
      __IOM uint8_t mode_sel    : 2;            /*!< [3..2] 00: SD20 mode (single data rate; internal clock frequency
                                                     is 2 times as SD_CLK)01: DDR mode (double data rate; internal
                                                     clock frequency is 2 times as SD_CLK)10: SD30 mode (single
                                                     data rate; internal clock frequency is the same as SD_CLK;
                                                     sampling point turning can only be used in this mode)11:
                                                     ReservedNote: When access SDR Card that needs to do sampling
                                                     turning, we must select SD30_mode; when access SDR Card
                                                     that needn't sampling turning, both SD20_mode and SD30_mode
                                                     is available.                                                             */
      __IOM uint8_t sd30_async_fifo_rst : 1;    /*!< [4..4] When SD30_mode is asserted, the input CMD/DAT will be
                                                     latched by an asynchronous FIFO. The write clock of FIFO
                                                     is sample clock; the read clock of FIFO is internal clock.Write
                                                     this bit to 1'b0 to reset write/read pointer of FIFO after
                                                     the frequency/phase of sample clock or internal clock is
                                                     changed.                                                                  */
            uint8_t             : 1;
      __IOM uint8_t clk_div     : 1;            /*!< [6..6] Clock Divider (only available when initial mode is set)0:
                                                     SDCLK is divided by 1281: SDCLK is divided by 256                         */
      __IOM uint8_t initial_mode : 1;           /*!< [7..7] Initial Mode (can not be used in SD30 mode)This bit is
                                                     used to control whether the SD clock will be divided by
                                                     clock divider0: The SD clock can not be divided1: The SD
                                                     clock will de divided by the value of Clock Divider                       */
    } sd_config1_b;
  } ;
  
  union {
    __IOM uint8_t sd_config2;                   /*!< (@ 0x00000581) SD Configuration Register 2                                */
    
    struct {
      __IOM uint8_t rsp_type    : 2;            /*!< [1..0] Response Type Configure.00: No response01: 6-byte response10:
                                                     17-byte response11: Reserved                                              */
      __IOM uint8_t crc7_chk    : 1;            /*!< [2..2] CRC7 Check Enable.0: Check CRC71: Not check CRC7                   */
      __IOM uint8_t wait_busy_end : 1;          /*!< [3..3] Wait busy End EnableIf this bit is set, hardware will
                                                     wait (with SD_CLK continually toggling) till SD card is
                                                     ready (SD_DAT0 is 1). This bit is only available when HW
                                                     executes SEND_CMD_GET_RSP command code0: .Not wait busy
                                                     end; HW will stop toggle SD clock after the command/response
                                                     transfer is completed, not concern about whether the SD_DAT0
                                                     is 1b or not1: Wait busy end; HW will continue to toggle
                                                     SD clock if SD_DAT0 is 0b                                                 */
      __IOM uint8_t ignore_crc_sts_err : 1;     /*!< [4..4] Ignore Write CRC Error Enable. Set this bit to ignore
                                                     the write error.0: Check whether CRC status returned by
                                                     card is correct1: Not check whether CRC status returned
                                                     by card is correct                                                        */
      __IOM uint8_t wait_crc_sts_timeout : 1;   /*!< [5..5] Wait Write CRC Status Time Out Enable If this bit is
                                                     set, HW will check whether the write CRC status is sent
                                                     by card in time.(In SD3.0 spec, card should send the CRC
                                                     status within 8 clocks, HW will wait 16 clocks actually)
                                                     0: HW will Check whether the write CRC status is time-out1:
                                                     HW will Not Check whether the write CRC status is time-out                */
      __IOM uint8_t crc16_chk   : 1;            /*!< [6..6] CRC16 Check Enable.0: Check CRC161: Not check CRC16                */
      __IOM uint8_t crc7_cal    : 1;            /*!< [7..7] CRC7 Calculation Enable.0: Calculate CRC71: No calculation         */
    } sd_config2_b;
  } ;
  
  union {
    __IOM uint8_t sd_config3;                   /*!< (@ 0x00000582) SD Configuration Register 3                                */
    
