Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint8_t rsp_timeout_en : 1;         /*!< [0..0] SD CMD Response Time Out Enable. If this bit is set,
                                                     HW will not check whether card's response to command is
                                                     time-out. It is considered to time-out if there is no SD
                                                     command response within 80 periods of SD_CLK after the
                                                     end bit of command is on the bus.0: Not check whether the
                                                     response to command is time-out1: Check whether the response
                                                     to command is time-out                                                    */
      __IOM uint8_t addr_mode   : 1;            /*!< [1..1] Address mode. 0: sector address mode SD start data address
                                                     set in SD read/write command argument(CMD18/CMD25) equal
                                                     to (the start sector address) which is set in SCSI command
                                                     read10/write10;1: byte mode SD start data address set in
                                                     SD read/write command argument(CMD18/CMD25) equal to (the
                                                     start sector address <<9)                                                 */
      __IOM uint8_t rsp_chk     : 1;            /*!< [2..2] SD CMD Response Check EnableWhen in Random auto mode,
                                                     If this bit is set, HW will check whether card's response
                                                     is received correctly or not. When not in random auto mode,
                                                     this bit is useless.0: No check whether the response of
                                                     command is correct1: Check whether the response to command
                                                     is correct                                                                */
      __IOM uint8_t sd20_clk_stop : 1;          /*!< [3..3] SD20 Clock Stop After Data Transfer Over Enable. (Default
                                                     Disable)In order to conform to eMMC spec(NAC minimum value
                                                     is 2 SD Clock cycle), when this bit is 1'b1 and data transfer
                                                     is over(Sector Count is 0), SD clock(SD20 mode) is stopped
                                                     immediately.0: Disable1: Enable                                           */
      __IOM uint8_t sd30_clk_stop : 1;          /*!< [4..4] SD30 Clock Stop After Data Transfer Over Enable. (Default
                                                     Disable)In order to conform to eMMC spec(NAC minimum value
                                                     is 2 SD Clock cycle), when this bit is 1'b1 and data transfer
                                                     is over(Sector Count is 0), SD clock(SD30 SDR and DDR mode)
                                                     is stopped immediately.0: Disable1: Enable                                */
      __IOM uint8_t wait_card_idle : 1;         /*!< [5..5] Data Phase Wait Card busy Enable.When this bit is set
                                                     , wait until SD card not busy, then set sd_end.0: No wait
                                                     SD card not busy, set sd_end immediately when data transfer
                                                     is over1: Wait until SD card is not busy, then set sd_end                 */
      __IOM uint8_t cmd_start_wait_card_idle : 1;/*!< [6..6] CMD Start Wait No Card busy.When this bit is set , no
                                                     wait card busy and send command immediately.0: Wait until
                                                     card is not busy, then send the pending command1: No wait
                                                     card busy and send command immediately                                    */
      __IOM uint8_t stop_cmd_start_wait_card_idle : 1;/*!< [7..7] STOP CMD Start No Wait Card busy.This bit is only valid
                                                     when the SD card controller is auto in random auto mode.In
                                                     random auto mode, SD card controller will auto send stop
                                                     cmd(CMD12) after read/write cmd(cmd18/cmd25), this bit
                                                     control whether HW wait busy end before send CMD12 When
                                                     this bit is set , no wait card busy and send stop command
                                                     (CMD12) immediately.0: Wait until card is not busy, then
                                                     send the stop command (CMD12)1: No wait card busy and send
                                                     stop command immediately                                                  */
    } sd_config3_b;
  } ;
  
  union {
    __IOM uint8_t sd_status1;                   /*!< (@ 0x00000583) SD Status Register 1                                       */
    
    struct {
      __IOM uint8_t tune_patrn_err : 1;         /*!< [0..0] SD Tuning Pattern Compare Error.This bit will be set
                                                     to 1'b1, if the tuning data sampled by HW is not correct.                 */
      __IOM uint8_t crc_sts_timeout_err : 1;    /*!< [1..1] Get Write CRC Status Time-out ErrorThis bit will be set
                                                     to 1'b1, if SD card doesn't return write CRC status bits
                                                     to host within 8 SD_CLK cycles after the end bit of data
                                                     packet is on the bus (actually, HW will wait 16 clocks).                  */
      __IOM uint8_t crc_sts_val : 3;            /*!< [4..2] Status Of Write CRC Status. This field reflects write
                                                     error bits returned from SD card. When card check CRC error,
                                                     it sends back CRC status (101); when card check CRC no
                                                     error, it sends back CRC status (010); when flash programming
                                                     error, CRC status read (111).                                             */
      __IOM uint8_t crc_sts_err : 1;            /*!< [5..5] Write CRC Error.This bit will be set to 1'b1, if the
                                                     write CRC status bits are not equal to 3'b010. (this means
                                                     Card detected CRC16 error in the data it received from
                                                     host).                                                                    */
      __IOM uint8_t crc16_err   : 1;            /*!< [6..6] CRC16 Error. This bit will be set to 1'b1, if there is
                                                     CRC16 check error in the data from SD card.                               */
      __IOM uint8_t crc7_err    : 1;            /*!< [7..7] CRC7 Error. This bit will be set to 1'b1, if there is
                                                     CRC7 check error in the response from SD card.                            */
    } sd_status1_b;
  } ;
  
  union {
    __IOM uint8_t sd_status2;                   /*!< (@ 0x00000584) SD Status Register 2                                       */
    
