Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint8_t rsp_timeout_err : 1;        /*!< [0..0] SD CMD Response Timeout Error.This bit will be set to
                                                     1'b1, if there is no response within 80 periods of SD_CLK
                                                     after the end bit of command is on the bus.                               */
      __IOM uint8_t rsp_invalid : 1;            /*!< [1..1] SD CMD Response Invalid.If SD_CONFIGURE3 bit[2] is set,
                                                     this bit will reflect when the response is correct or not.
                                                     If this bit is set, sd_end and sd_error (SD_TRANSFER bit[6]
                                                     and bit[4]) will also be set0: The response of command
                                                     is correct1: The response to command is not correct                       */
      __IOM uint8_t cbw_state   : 4;            /*!< [5..2] CBW State Machine.                                                 */
            uint8_t             : 2;
    } sd_status2_b;
  } ;
  
  union {
    __IOM uint8_t sd_bus_status;                /*!< (@ 0x00000585) SD Bus Status Register                                     */
    
    struct {
      __IOM uint8_t cmd         : 1;            /*!< [0..0] This bit reflect the level of pin SD_CMD.                          */
      __IOM uint8_t dat3_0      : 4;            /*!< [4..1] This bit reflect the level of pin SD_DAT3~SD_DAT0.                 */
            uint8_t             : 1;
      __IOM uint8_t stop_sdclk_when_no_xfer : 1;/*!< [6..6] Stop SD_CLK toggling when no cmd/data transfer (ignore
                                                     the level of SDDAT0)                                                      */
      __IOM uint8_t sdclk_toggle : 1;           /*!< [7..7] SD_CLK Toggle Enable. If this bit is set, host will generate
                                                     SDCLK toggle signal even when there is no signal transaction
                                                     on the CMD/DAT bus                                                        */
    } sd_bus_status_b;
  } ;
  __IM  uint16_t  RESERVED17;
  __IM  uint8_t   RESERVED18;
  
  union {
    __IOM uint8_t sd_cmd0;                      /*!< (@ 0x00000589) SD Command Register 0                                      */
    
    struct {
      __IOM uint8_t cmd         : 8;            /*!< [7..0] Command[47:40] or Response Data[47:40].                            */
    } sd_cmd0_b;
  } ;
  
  union {
    __IOM uint8_t sd_cmd1;                      /*!< (@ 0x0000058A) SD Command Register 1                                      */
    
    struct {
      __IOM uint8_t cmd         : 8;            /*!< [7..0] Command[39:32] or Response Data[39:32].                            */
    } sd_cmd1_b;
  } ;
  
  union {
    __IOM uint8_t sd_cmd2;                      /*!< (@ 0x0000058B) SD Command Register 2                                      */
    
    struct {
      __IOM uint8_t cmd         : 8;            /*!< [7..0] Command[31:24] or Response Data[31:24].                            */
    } sd_cmd2_b;
  } ;
  
  union {
    __IOM uint8_t sd_cmd3;                      /*!< (@ 0x0000058C) SD Command Register 3                                      */
    
    struct {
      __IOM uint8_t cmd         : 8;            /*!< [7..0] Command[23:16] or Response Data[23:16].                            */
    } sd_cmd3_b;
  } ;
  
  union {
    __IOM uint8_t sd_cmd4;                      /*!< (@ 0x0000058D) SD Command Register 4                                      */
    
    struct {
      __IOM uint8_t cmd         : 8;            /*!< [7..0] Command[15:8] or Response Data[15:8].                              */
    } sd_cmd4_b;
  } ;
  
  union {
    __IOM uint8_t sd_cmd5;                      /*!< (@ 0x0000058E) SD Command Register 5                                      */
    
    struct {
      __IOM uint8_t cmd         : 8;            /*!< [7..0] Command[7:0] or Response Data[7:0].                                */
    } sd_cmd5_b;
  } ;
  
  union {
    __IOM uint8_t sd_byte_cnt_l;                /*!< (@ 0x0000058F) Byte Count Register (Low Byte)                             */
    
    struct {
      __IOM uint8_t byte_cnt_l  : 8;            /*!< [7..0] Byte Count[7:0]. Byte count in one block transferred
                                                     from/to SD card.                                                          */
    } sd_byte_cnt_l_b;
  } ;
  
  union {
    __IOM uint8_t sd_byte_cnt_h;                /*!< (@ 0x00000590) Byte Count Register (High Byte)                            */
    
    struct {
      __IOM uint8_t byte_cnt_h  : 3;            /*!< [2..0] Byte Count[10:8]. Byte count in one block transferred
                                                     from/to SD card.                                                          */
            uint8_t             : 5;
    } sd_byte_cnt_h_b;
  } ;
  
  union {
    __IOM uint8_t sd_blk_cnt_l;                 /*!< (@ 0x00000591) Block Count Register (Low Byte)                            */
    
    struct {
      __IOM uint8_t blk_cnt_l   : 8;            /*!< [7..0] Block Count[7:0]. Block count transferred from/to SD
                                                     card.                                                                     */
    } sd_blk_cnt_l_b;
  } ;
  
  union {
    __IOM uint8_t sd_blk_cnt_h;                 /*!< (@ 0x00000592) Block Count Register (High Byte)                           */
    
    struct {
      __IOM uint8_t blk_cnt_h   : 7;            /*!< [6..0] Block Count[14:8]. Byte count transferred from/to SD
                                                     card.                                                                     */
            uint8_t             : 1;
    } sd_blk_cnt_h_b;
  } ;
  
  union {
    __IOM uint8_t sd_xfer;                      /*!< (@ 0x00000593) SD Transfer Control Register                               */
    
