Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint8_t cmd_code    : 4;            /*!< [3..0] Command Code. These bits encoded each working mode of
                                                     SD card control module.0000(NORMAL_WRITE): Write 1 or 2
                                                     bytes to SD card and the content are put into SD_CMD2 &
                                                     SD_CMD3 in advance. Hardware ignores write error returned
                                                     from SD card in this case.0001(AUTO_WRITE3): Hardware writes
                                                     data from Ring buffer to SD card and the data length is
                                                     (SD_BYTE_CNT * SD_BLOCK_CNT). Hardware can only write even
                                                     bytes (2, 4, 6, ..., 512) data from SRAM2 buffer to SD
                                                     card if data source is consigned to SRAM2 buffer in                       */
      __IOM uint8_t err         : 1;            /*!< [4..4] If this bit is set which means some error occurs detailed
                                                     error information is in register SD_STAT.                                 */
      __IOM uint8_t idle_ste    : 1;            /*!< [5..5] Status of SD card module state machineWhen this bit is
                                                     set 1, it means that the SD card module state machine is
                                                     in idle state.                                                            */
      __IOM uint8_t end         : 1;            /*!< [6..6] If transfer starts this bit will be clear automatically
                                                     by hardware. And if transfer completes this bit will be
                                                     set and keep 1 until the next Start is set.                               */
      __IOM uint8_t start       : 1;            /*!< [7..7] The transfer is launch if set this bit.                            */
    } sd_xfer_b;
  } ;
  __IM  uint8_t   RESERVED19;
  
  union {
    __IOM uint8_t sd_cmd_ste;                   /*!< (@ 0x00000595) SD Command State Register                                  */
    
    struct {
      __IOM uint8_t cmd_ste     : 4;            /*!< [3..0] CMD State Machine                                                  */
            uint8_t             : 3;
      __IOM uint8_t cmd_ste_is_idle : 1;        /*!< [7..7] CMD State Machine is idleWhen this bit is 1'b1, it indicates
                                                     IDLE state of CMD State Machine                                           */
    } sd_cmd_ste_b;
  } ;
  
  union {
    __IOM uint8_t sd_data_ste;                  /*!< (@ 0x00000596) SD Data State Register                                     */
    
    struct {
      __IOM uint8_t data_ste    : 5;            /*!< [4..0] DATA State Machine                                                 */
            uint8_t             : 2;
      __IOM uint8_t data_ste_is_idle : 1;       /*!< [7..7] DATA State Machine is idleWhen this bit is 1'b1, it indicates
                                                     IDLE state of DATA State Machine                                          */
    } sd_data_ste_b;
  } ;
  __IM  uint8_t   RESERVED20;
} SDMMC_Type;                                   /*!< Size = 1432 (0x598)                                                       */



/* =========================================================================================================================== */
/* ================                                         SDIOHOST                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief SDIO Host - for SDIO card (SDIOHOST)
  */

typedef struct {                                /*!< (@ 0x4005C000) SDIOHOST Structure                                         */
  
  union {
    __IOM uint32_t sdma_system_addr;            /*!< (@ 0x00000000) sdma system address                                        */
    
    struct {
      __IOM uint32_t sdma_system_addr : 32;     /*!< [31..0] sdma system address                                               */
    } sdma_system_addr_b;
  } ;
  __IM  uint32_t  RESERVED[62];
  __IM  uint16_t  RESERVED1;
  
  union {
    __IM  uint16_t HOST_CONTRL_VERSION;         /*!< (@ 0x000000FE) host control version                                       */
    
    struct {
      __IM  uint16_t specification_version : 8; /*!< [7..0] specification version number                                       */
      __IM  uint16_t vendor_version : 8;        /*!< [15..8] vendor version number                                             */
    } HOST_CONTRL_VERSION_b;
  } ;
} SDIOHOST_Type;                                /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                           GDMA0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief AXI-Central DMA Controller core that transfer data from a source address to a destination address over AXI bus. (GDMA0)
  */

/* =========================================================================================================================== */
/* ================                                         GDMA0_CH0                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief GDMA control registers for specific channels (GDMA0_CH0)
  */

/* =========================================================================================================================== */
/* ================                                           I2S0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter IC Sound (I2S0)
  */

