Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
typedef struct {                                /*!< (@ 0x40062000) I2S0 Structure                                             */
  
  union {
    __IOM uint32_t ctrl;                        /*!< (@ 0x00000000) I2S Control Register                                       */
    
    struct {
      __IOM uint32_t iis_en     : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t tx_act     : 2;            /*!< [2..1] RSVD                                                               */
      __IOM uint32_t audio_mono : 2;            /*!< [4..3] RSVD                                                               */
      __IOM uint32_t edge_sw    : 1;            /*!< [5..5] RSVD                                                               */
            uint32_t            : 1;
      __IOM uint32_t loop_back  : 1;            /*!< [7..7] RSVD                                                               */
      __IOM uint32_t format     : 2;            /*!< [9..8] RSVD                                                               */
      __IOM uint32_t lr_swap    : 1;            /*!< [10..10] RSVD                                                             */
      __IOM uint32_t sck_swap   : 1;            /*!< [11..11] RSVD                                                             */
      __IOM uint32_t byte_swap  : 1;            /*!< [12..12] RSVD                                                             */
            uint32_t            : 2;
      __IOM uint32_t debug_switch : 2;          /*!< [16..15] RSVD                                                             */
            uint32_t            : 1;
      __IOM uint32_t burst_size : 5;            /*!< [22..18] RSVD                                                             */
            uint32_t            : 4;
      __IOM uint32_t mute       : 1;            /*!< [27..27] RSVD                                                             */
      __IOM uint32_t slave_mode : 1;            /*!< [28..28] RSVD                                                             */
      __IOM uint32_t wl         : 2;            /*!< [30..29] RSVD                                                             */
      __IOM uint32_t sw_rstn    : 1;            /*!< [31..31] RSVD                                                             */
    } ctrl_b;
  } ;
  
  union {
    __IOM uint32_t page_ptr_tx;                 /*!< (@ 0x00000004) TX Page pointer Register                                   */
    
    struct {
            uint32_t            : 2;
      __IOM uint32_t page_ptr_tx : 30;          /*!< [31..2] RSVD                                                              */
    } page_ptr_tx_b;
  } ;
  
  union {
    __IOM uint32_t page_ptr_rx;                 /*!< (@ 0x00000008) RX Page pointer Register                                   */
    
    struct {
            uint32_t            : 2;
      __IOM uint32_t page_ptr_rx : 30;          /*!< [31..2] RSVD                                                              */
    } page_ptr_rx_b;
  } ;
  
  union {
    __IOM uint32_t page_size_rate;              /*!< (@ 0x0000000C) Page Size and Sample Rate Register                         */
    
    struct {
      __IOM uint32_t page_size  : 12;           /*!< [11..0] RSVD                                                              */
      __IOM uint32_t page_num   : 2;            /*!< [13..12] RSVD                                                             */
      __IOM uint32_t sr         : 4;            /*!< [17..14] RSVD                                                             */
      __IOM uint32_t clk_switch : 1;            /*!< [18..18] RSVD                                                             */
            uint32_t            : 13;
    } page_size_rate_b;
  } ;
  
  union {
    __IOM uint32_t tx_isr_en;                   /*!< (@ 0x00000010) TX Interrupt Enable Register                               */
    
    struct {
      __IOM uint32_t p0okie_tx  : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t p1okie_tx  : 1;            /*!< [1..1] RSVD                                                               */
      __IOM uint32_t p2okie_tx  : 1;            /*!< [2..2] RSVD                                                               */
      __IOM uint32_t p3okie_tx  : 1;            /*!< [3..3] RSVD                                                               */
      __IOM uint32_t page0unava_ie_tx : 1;      /*!< [4..4] RSVD                                                               */
      __IOM uint32_t page1unava_ie_tx : 1;      /*!< [5..5] RSVD                                                               */
      __IOM uint32_t page2unava_ie_tx : 1;      /*!< [6..6] RSVD                                                               */
      __IOM uint32_t page3unava_ie_tx : 1;      /*!< [7..7] RSVD                                                               */
      __IOM uint32_t fifo_empty_ie_tx : 1;      /*!< [8..8] RSVD                                                               */
            uint32_t            : 23;
    } tx_isr_en_b;
  } ;
  
  union {
    __IOM uint32_t tx_isr_status;               /*!< (@ 0x00000014) TX Interrupt Status Register                               */
    
    struct {
      __IOM uint32_t p0okip_tx  : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t p1okip_tx  : 1;            /*!< [1..1] RSVD                                                               */
      __IOM uint32_t p2okip_tx  : 1;            /*!< [2..2] RSVD                                                               */
      __IOM uint32_t p3okip_tx  : 1;            /*!< [3..3] RSVD                                                               */
      __IOM uint32_t page0unava_ip_tx : 1;      /*!< [4..4] RSVD                                                               */
      __IOM uint32_t page1unava_ip_tx : 1;      /*!< [5..5] RSVD                                                               */
      __IOM uint32_t page2unava_ip_tx : 1;      /*!< [6..6] RSVD                                                               */
      __IOM uint32_t page3unava_ip_tx : 1;      /*!< [7..7] RSVD                                                               */
      __IOM uint32_t fifo_empty_ip_tx : 1;      /*!< [8..8] RSVD                                                               */
            uint32_t            : 23;
    } tx_isr_status_b;
  } ;
  
  union {
    __IOM uint32_t rx_isr_en;                   /*!< (@ 0x00000018) RX Interrupt Enable Register                               */
    
