Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t p0okie_rx  : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t p1okie_rx  : 1;            /*!< [1..1] RSVD                                                               */
      __IOM uint32_t p2okie_rx  : 1;            /*!< [2..2] RSVD                                                               */
      __IOM uint32_t p3okie_rx  : 1;            /*!< [3..3] RSVD                                                               */
      __IOM uint32_t page0unava_ie_rx : 1;      /*!< [4..4] RSVD                                                               */
      __IOM uint32_t page1unava_ie_rx : 1;      /*!< [5..5] RSVD                                                               */
      __IOM uint32_t page2unava_ie_rx : 1;      /*!< [6..6] RSVD                                                               */
      __IOM uint32_t page3unava_ie_rx : 1;      /*!< [7..7] RSVD                                                               */
      __IOM uint32_t fifo_full_ie_rx : 1;       /*!< [8..8] RSVD                                                               */
            uint32_t            : 23;
    } rx_isr_en_b;
  } ;
  
  union {
    __IOM uint32_t rx_isr_status;               /*!< (@ 0x0000001C) RX Interrupt Status Register                               */
    
    struct {
      __IOM uint32_t p0okip_rx  : 1;            /*!< [0..0] RSVD                                                               */
      __IOM uint32_t p1okip_rx  : 1;            /*!< [1..1] RSVD                                                               */
      __IOM uint32_t p2okip_rx  : 1;            /*!< [2..2] RSVD                                                               */
      __IOM uint32_t p3okip_rx  : 1;            /*!< [3..3] RSVD                                                               */
      __IOM uint32_t page0unava_ip_rx : 1;      /*!< [4..4] RSVD                                                               */
      __IOM uint32_t page1unava_ip_rx : 1;      /*!< [5..5] RSVD                                                               */
      __IOM uint32_t page2unava_ip_rx : 1;      /*!< [6..6] RSVD                                                               */
      __IOM uint32_t page3unava_ip_rx : 1;      /*!< [7..7] RSVD                                                               */
      __IOM uint32_t fifo_full_ip_rx : 1;       /*!< [8..8] RSVD                                                               */
            uint32_t            : 23;
    } rx_isr_status_b;
  } ;
  
  union {
    __IOM uint32_t tx_page0_own;                /*!< (@ 0x00000020) TX Page0 Own Bit Register                                  */
    
    struct {
            uint32_t            : 31;
      __IOM uint32_t p0own_tx   : 1;            /*!< [31..31] RSVD                                                             */
    } tx_page0_own_b;
  } ;
  
  union {
    __IOM uint32_t tx_page1_own;                /*!< (@ 0x00000024) TX Page1 Own Bit Register                                  */
    
    struct {
            uint32_t            : 31;
      __IOM uint32_t p1own_tx   : 1;            /*!< [31..31] RSVD                                                             */
    } tx_page1_own_b;
  } ;
  
  union {
    __IOM uint32_t tx_page2_own;                /*!< (@ 0x00000028) TX Page2 Own Bit Register                                  */
    
    struct {
            uint32_t            : 31;
      __IOM uint32_t p2own_tx   : 1;            /*!< [31..31] RSVD                                                             */
    } tx_page2_own_b;
  } ;
  
  union {
    __IOM uint32_t tx_page3_own;                /*!< (@ 0x0000002C) TX Page3 Own Bit Register                                  */
    
    struct {
            uint32_t            : 31;
      __IOM uint32_t p3own_tx   : 1;            /*!< [31..31] RSVD                                                             */
    } tx_page3_own_b;
  } ;
  
  union {
    __IOM uint32_t rx_page0_own;                /*!< (@ 0x00000030) RX Page0 Own Bit Register                                  */
    
    struct {
            uint32_t            : 31;
      __IOM uint32_t p0own_rx   : 1;            /*!< [31..31] RSVD                                                             */
    } rx_page0_own_b;
  } ;
  
  union {
    __IOM uint32_t rx_page1_own;                /*!< (@ 0x00000034) RX Page1 Own Bit Register                                  */
    
    struct {
            uint32_t            : 31;
      __IOM uint32_t p1own_rx   : 1;            /*!< [31..31] RSVD                                                             */
    } rx_page1_own_b;
  } ;
  
  union {
    __IOM uint32_t rx_page2_own;                /*!< (@ 0x00000038) RX Page2 Own Bit Register                                  */
    
    struct {
            uint32_t            : 31;
      __IOM uint32_t p2own_rx   : 1;            /*!< [31..31] RSVD                                                             */
    } rx_page2_own_b;
  } ;
  
  union {
    __IOM uint32_t rx_page3_own;                /*!< (@ 0x0000003C) RX Page3 Own Bit Register                                  */
    
    struct {
            uint32_t            : 31;
      __IOM uint32_t p3own_rx   : 1;            /*!< [31..31] RSVD                                                             */
    } rx_page3_own_b;
  } ;
  
  union {
    __IM  uint32_t version_id;                  /*!< (@ 0x00000040) Version id                                                 */
    
    struct {
      __IM  uint32_t version_id : 32;           /*!< [31..0] RSVD                                                              */
    } version_id_b;
  } ;
} I2S_Type;                                    /*!< Size = 68 (0x44)                                                          */



/* =========================================================================================================================== */
/* ================                                          CRYPTO                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Crypto in Secure (CRYPTO)
  */

