Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
typedef struct {                                /*!< (@ 0x50070000) CRYPTO Structure                                           */
  
  union {
    __IOM uint32_t srcdesc_status_reg;          /*!< (@ 0x00000000) Source Descriptor FIFO status Register                     */
    
    struct {
      __IM  uint32_t fifo_empty_cnt : 8;        /*!< [7..0] Source Descriptor FIFO empty counter                               */
      __IM  uint32_t swptr      : 8;            /*!< [15..8] Source Descriptor FIFO write pointer                              */
      __IM  uint32_t srptr      : 8;            /*!< [23..16] Source Descriptor FIFO read pointer                              */
      __IOM uint32_t src_fail   : 1;            /*!< [24..24] Source Descriptor fail interrupt                                 */
      __IM  uint32_t src_fail_status : 2;       /*!< [26..25] Source Descriptor fail status                                    */
      __IOM uint32_t src_fail_m : 1;            /*!< [27..27] Source Descriptor fail interrupt mask                            */
            uint32_t            : 2;
      __IOM uint32_t pk_up      : 1;            /*!< [30..30] packet base update wptr to engine                                */
      __IOM uint32_t src_rst    : 1;            /*!< [31..31] Source Descriptor reset                                          */
    } srcdesc_status_reg_b;
  } ;
  
  union {
    __IOM uint32_t sdfw_reg;                    /*!< (@ 0x00000004) IPSec Source Descriptor first word                         */
    
    struct {
      __IOM uint32_t sdfw       : 32;           /*!< [31..0] IPSec Source Descriptor first word                                */
    } sdfw_reg_b;
  } ;
  
  union {
    __IOM uint32_t sdsw_reg;                    /*!< (@ 0x00000008) IPSec Source Descriptor second word                        */
    
    struct {
      __IOM uint32_t sdsw       : 32;           /*!< [31..0] IPSec Source Descriptor second word                               */
    } sdsw_reg_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t ipscsr_reset_isr_conf_reg;   /*!< (@ 0x00000010) IPSec Command/Status Register, for reset / isr
                                                                    poll status                                                */
    
    struct {
      __OM  uint32_t soft_rst   : 1;            /*!< [0..0] Software Resetwrite 1 to reset                                     */
            uint32_t            : 2;
      __IM  uint32_t dma_busy   : 1;            /*!< [3..3] Ipsec dma busy                                                     */
      __IOM uint32_t cmd_ok     : 1;            /*!< [4..4] Command OK interrupt                                               */
            uint32_t            : 2;
      __IOM uint32_t intr_mode  : 1;            /*!< [7..7] Select ok interrupt mode                                           */
      __IM  uint32_t ok_intr_cnt : 8;           /*!< [15..8] OK interrupt counter                                              */
      __IOM uint32_t clear_ok_intr_num : 8;     /*!< [23..16] Clear OK interrupt number                                        */
            uint32_t            : 7;
      __OM  uint32_t ipsec_rst  : 1;            /*!< [31..31] Ipsec engine ResetWrite 1 to reset the crypto engine
                                                     and DMA engine                                                            */
    } ipscsr_reset_isr_conf_reg_b;
  } ;
  
  union {
    __IOM uint32_t ipscsr_int_mask_reg;         /*!< (@ 0x00000014) IPSec Command/Status Register, for interrupt
                                                                    mask                                                       */
    
    struct {
      __IOM uint32_t cmd_ok_m   : 1;            /*!< [0..0] Command OK interrupt Mask1: Mask Enable0: Mask Disable             */
            uint32_t            : 2;
      __IOM uint32_t src_err0_m : 1;            /*!< [3..3] Source Descriptor Error 0 Interrupt Mask1: Mask Enable0:
                                                     Mask Disable                                                              */
      __IOM uint32_t src_err1_m : 1;            /*!< [4..4] Source Descriptor Error 1 Interrupt Mask1: Mask Enable0:
                                                     Mask Disable                                                              */
      __IOM uint32_t src_err2_m : 1;            /*!< [5..5] Source Descriptor Error 2 Interrupt Mask1: Mask Enable0:
                                                     Mask Disable                                                              */
      __IOM uint32_t src_err3_m : 1;            /*!< [6..6] Source Descriptor Error 3 Interrupt Mask1: Mask Enable0:
                                                     Mask Disable                                                              */
      __IOM uint32_t src_err4_m : 1;            /*!< [7..7] Source Descriptor Error 4 Interrupt Mask1: Mask Enable0:
                                                     Mask Disable                                                              */
      __IOM uint32_t src_err5_m : 1;            /*!< [8..8] Source Descriptor Error 5 Interrupt Mask1: Mask Enable0:
                                                     Mask Disable                                                              */
      __IOM uint32_t src_err6_m : 1;            /*!< [9..9] Source Descriptor Error 6 Interrupt Mask1: Mask Enable0:
                                                     Mask Disable                                                              */
      __IOM uint32_t src_err7_m : 1;            /*!< [10..10] Source Descriptor Error 7 Interrupt Mask1: Mask Enable0:
                                                     Mask Disable                                                              */
      __IOM uint32_t src_err8_m : 1;            /*!< [11..11] Source Descriptor Error 8 Interrupt Mask1: Mask Enable0:
                                                     Mask Disable                                                              */
      __IOM uint32_t src_err9_m : 1;            /*!< [12..12] Source Descriptor Error 9 Interrupt Mask1: Mask Enable0:
                                                     Mask Disable                                                              */
      __IOM uint32_t dst_err1_m : 1;            /*!< [13..13] Destination Descriptor Error 1 Interrupt Mask1: Mask
                                                     Enable0: Mask Disable                                                     */
      __IOM uint32_t dst_err2_m : 1;            /*!< [14..14] Destination Descriptor Error 2 Interrupt Mask1: Mask
                                                     Enable0: Mask Disable                                                     */
      __IOM uint32_t dst_err3_m : 1;            /*!< [15..15] Destination Descriptor Error 3 Interrupt Mask1: Mask
                                                     Enable0: Mask Disable                                                     */
      __IOM uint32_t dst_err4_m : 1;            /*!< [16..16] Destination Descriptor Error 4 Interrupt Mask1: Mask
                                                     Enable0: Mask Disable                                                     */
      __IOM uint32_t dst_err5_m : 1;            /*!< [17..17] Destination Descriptor Error 5 Interrupt Mask1: Mask
                                                     Enable0: Mask Disable                                                     */
      __IOM uint32_t dst_err6_m : 1;            /*!< [18..18] Destination Descriptor Error 6 Interrupt Mask1: Mask
                                                     Enable0: Mask Disable                                                     */
            uint32_t            : 13;
    } ipscsr_int_mask_reg_b;
  } ;
  
  union {
    __IOM uint32_t ipscsr_debug_reg;            /*!< (@ 0x00000018) IPSec Command/Status Register, for debug                   */
    
