Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t set_swap   : 1;            /*!< [0..0] Byte swap for command setting data1: Enable0: Disable              */
      __IOM uint32_t key_iv_swap : 1;           /*!< [1..1] Byte swap for key and iv1: Enable0: Disable                        */
      __IOM uint32_t key_pad_swap : 1;          /*!< [2..2] Byte swap for hmac key1: Enable0: Disable                          */
      __IOM uint32_t hash_inital_value_swap : 1;/*!< [3..3] Byte swap for sequential hash initial value1: Enable0:
                                                     Disable                                                                   */
      __IOM uint32_t dma_in_little_endian : 1;  /*!< [4..4] Input data is little endian1: little endian0: big endian           */
            uint32_t            : 3;
      __IOM uint32_t tx_byte_swap : 1;          /*!< [8..8] Byte swap for dma_tx engine input data1: Enable0: Disable          */
      __IOM uint32_t data_out_little_endian : 1;/*!< [9..9] Output data is little endian1: little endian0: big endian          */
      __IOM uint32_t mac_out_little_endian : 1; /*!< [10..10] Output mac is little endian1: little endian0: big endian         */
      __IOM uint32_t rx_wd_swap : 1;            /*!< [11..11] Word swap for dma_rx engine input data1: Enable0: Disable        */
      __IOM uint32_t tx_wd_swap : 1;            /*!< [12..12] Word swap for dma_tx engine input data1: Enable0: Disable        */
            uint32_t            : 3;
      __IOM uint32_t dma_burst_length : 6;      /*!< [21..16] dma burst lengthMax : 32 Min: 1                                  */
            uint32_t            : 10;
    } ipscsr_swap_burst_reg_b;
  } ;
  __IM  uint32_t  RESERVED3[51];
  
  union {
    __OM  uint32_t crc_rst_reg;                 /*!< (@ 0x00000100) crc reset                                                  */
    
    struct {
      __OM  uint32_t rst        : 1;            /*!< [0..0] reset CRC engine                                                   */
            uint32_t            : 31;
    } crc_rst_reg_b;
  } ;
  
  union {
    __IOM uint32_t crc_op_reg;                  /*!< (@ 0x00000104) crc operation                                              */
    
    struct {
      __IOM uint32_t crc_iswap  : 3;            /*!< [2..0] swap input data                                                    */
      __IOM uint32_t crc_oswap  : 1;            /*!< [3..3] swap output data                                                   */
      __IOM uint32_t crc_sel    : 3;            /*!< [6..4] crc sel                                                            */
      __IOM uint32_t crc_dma    : 1;            /*!< [7..7] DMA mode                                                           */
      __IOM uint32_t crc_be     : 2;            /*!< [9..8] big endian                                                         */
            uint32_t            : 2;
      __IOM uint32_t crc_last   : 1;            /*!< [12..12] crc last                                                         */
            uint32_t            : 3;
      __IOM uint32_t crc_length : 16;           /*!< [31..16] length                                                           */
    } crc_op_reg_b;
  } ;
  
  union {
    __IOM uint32_t crc_poly_reg;                /*!< (@ 0x00000108) CRC polynomia register                                     */
    
    struct {
      __IOM uint32_t crc_poly   : 32;           /*!< [31..0] crc polynomial coefficients                                       */
    } crc_poly_reg_b;
  } ;
  
  union {
    __IOM uint32_t crc_iv_reg;                  /*!< (@ 0x0000010C) CRC initial value register                                 */
    
    struct {
      __IOM uint32_t crc_init   : 32;           /*!< [31..0] crc init value                                                    */
    } crc_iv_reg_b;
  } ;
  
  union {
    __IOM uint32_t crc_oxor_reg;                /*!< (@ 0x00000110) CRC initial value register                                 */
    
    struct {
      __IOM uint32_t crc_oxor   : 32;           /*!< [31..0] if output xor mode                                                */
    } crc_oxor_reg_b;
  } ;
  
  union {
    __IOM uint32_t crc_data_reg;                /*!< (@ 0x00000114) CRC data register                                          */
    
    struct {
      __IOM uint32_t crc_data   : 32;           /*!< [31..0] din - Command mode : DMA==1'b0SDBP - Source Data Buffer
                                                     Pointer : DMA==1'b1                                                       */
    } crc_data_reg_b;
  } ;
  
  union {
    __IOM uint32_t crc_stat_reg;                /*!< (@ 0x00000118) CRC status register                                        */
    
    struct {
      __IM  uint32_t busy       : 1;            /*!< [0..0] still busy in previous execution                                   */
      __IOM uint32_t crc_ok     : 1;            /*!< [1..1] finish execution                                                   */
      __IOM uint32_t crc_intr_mask : 1;         /*!< [2..2] interrupt mask                                                     */
      __OM  uint32_t crc_little_endian : 1;     /*!< [3..3] little endian                                                      */
            uint32_t            : 28;
    } crc_stat_reg_b;
  } ;
  
  union {
    __IM  uint32_t crc_result_reg;              /*!< (@ 0x0000011C) CRC result register                                        */
    
    struct {
      __IM  uint32_t crc_out    : 32;           /*!< [31..0] output result                                                     */
    } crc_result_reg_b;
  } ;
  
  union {
    __IM  uint32_t crc_count_reg;               /*!< (@ 0x00000120) CRC count register                                         */
    
    struct {
      __IM  uint32_t crc_cnt    : 16;           /*!< [15..0] count number in bytes                                             */
            uint32_t            : 16;
    } crc_count_reg_b;
  } ;
  __IM  uint32_t  RESERVED4[951];
  
  union {
    __IOM uint32_t dstdesc_status_reg;          /*!< (@ 0x00001000) destination descriptor status                              */
    
