Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IM  uint32_t fifo_empty_cnt : 8;        /*!< [7..0] Destination Descriptor FIFO empty counter                          */
      __IM  uint32_t dwptr      : 8;            /*!< [15..8] Destination Descriptor FIFO write pointer                         */
      __IM  uint32_t drptr      : 8;            /*!< [23..16] Destination Descriptor FIFO read pointer                         */
      __IOM uint32_t dst_fail   : 1;            /*!< [24..24] Destination Descriptor fail interrupt                            */
      __IM  uint32_t dst_fail_status : 2;       /*!< [26..25] Destination Descriptor fail status                               */
      __IOM uint32_t dst_fail_m : 1;            /*!< [27..27] Destination Descriptor fail interrupt mask                       */
            uint32_t            : 3;
      __IOM uint32_t dst_rst    : 1;            /*!< [31..31] Destination Descriptor reset                                     */
    } dstdesc_status_reg_b;
  } ;
  
  union {
    __IOM uint32_t ddfw_reg;                    /*!< (@ 0x00001004) destination descriptor first word                          */
    
    struct {
      __IOM uint32_t ddfw       : 32;           /*!< [31..0] IPSec Destination Descriptor first word                           */
    } ddfw_reg_b;
  } ;
  
  union {
    __IOM uint32_t ddsw_reg;                    /*!< (@ 0x00001008) destination descriptor second word                         */
    
    struct {
      __IOM uint32_t ddsw       : 32;           /*!< [31..0] IPSec Destination Descriptor second word                          */
    } ddsw_reg_b;
  } ;
  
  union {
    __IOM uint32_t desc_pkt_conf_reg;           /*!< (@ 0x0000100C) descriptor packet setting                                  */
    
    struct {
      __IOM uint32_t dbg_sptr   : 8;            /*!< [7..0] Source Descriptor FIFO empty counter                               */
      __IOM uint32_t dbg_dptr   : 8;            /*!< [15..8] Destination Descriptor FIFO write pointer                         */
      __IM  uint32_t pk_arbiter : 2;            /*!< [17..16] Packet arbiter 2'd0 : bus1, 2'd1 : bus2, 2'd2 : bus3             */
            uint32_t            : 6;
      __IOM uint32_t bus1_priority_th : 2;      /*!< [25..24] Bus1 priority threshold                                          */
      __IOM uint32_t bus2_priority_th : 2;      /*!< [27..26] Bus2 priority threshold                                          */
      __IOM uint32_t bus3_priority_th : 2;      /*!< [29..28] Bus3 priority threshold                                          */
      __IOM uint32_t pk_arbiter_mode : 2;       /*!< [31..30] Packet arbiter mode                                              */
    } desc_pkt_conf_reg_b;
  } ;
} CRYPTO_Type;                                  /*!< Size = 4112 (0x1010)                                                      */



/* =========================================================================================================================== */
/* ================                                           EDDSA                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief EdDSA offload engine (EDDSA)
  */

typedef struct {                                /*!< (@ 0x40046800) EDDSA Structure                                            */
  
  union {
    __IOM uint32_t eng_init_reg;                /*!< (@ 0x00000000) EdDSA Engine Initial Setting Register                      */
    
    struct {
      __IOM uint32_t eng_rst    : 1;            /*!< [0..0] Engine synchronize reset                                           */
            uint32_t            : 7;
      __IOM uint32_t swptr      : 1;            /*!< [8..8] eng_clk_enable                                                     */
            uint32_t            : 23;
    } eng_init_reg_b;
  } ;
  __IOM uint32_t  eng_resv0_reg;                /*!< (@ 0x00000004) EdDSA Engine reserved0 Register                            */
  
  union {
    __IOM uint32_t eng_conf_int_reg;            /*!< (@ 0x00000008) EdDSA Engine Configure Interrupt Register                  */
    
    struct {
      __IOM uint32_t eng_start  : 1;            /*!< [0..0] Start for EdDSA function. It's almost for all EdDSA function,
                                                     except some auto-flow settings. When programer set this
                                                     bit to 1'b1, it means that input values of the engine mode
                                                     are ready, so engine can process the mode. Usually it won't
                                                     be set with HASH_OK.                                                      */
            uint32_t            : 1;
      __IOM uint32_t hash_ok    : 1;            /*!< [2..2] When Hash digest input value is ready, put hask_ok to
                                                     high.Only use this bit in some auto-flow setting. When
                                                     programer set this bit to 1'b1, it means that hash digest
                                                     input value is ready, engine can contiune processing next
                                                     auto-flow step.                                                           */
            uint32_t            : 1;
      __IM  uint32_t eng_idle   : 1;            /*!< [4..4] When engine is busy, this bit will be put high.                    */
            uint32_t            : 3;
      __IOM uint32_t mode0_finish : 1;          /*!< [8..8] Engine mode0 interrupt. Put high to clear mode0 interrupt.         */
      __IOM uint32_t mode1_finish : 1;          /*!< [9..9] Engine mode1 interrupt. Put high to clear mode1 interrupt.         */
      __IOM uint32_t mode2_finish : 1;          /*!< [10..10] Engine mode2 interrupt. Put high to clear mode2 interrupt.       */
      __IOM uint32_t mode3_finish : 1;          /*!< [11..11] Engine mode3 interrupt. Put high to clear mode3 interrupt.       */
      __IOM uint32_t eng_decode_fail : 1;       /*!< [12..12] Engine decode fail interrupt. Put high to clear fail
                                                     interrupt.                                                                */
            uint32_t            : 19;
    } eng_conf_int_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_ctrl_reg;                /*!< (@ 0x0000000C) EdDSA Engine Contol Register                               */
    
