Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t mod_sel    : 2;            /*!< [1..0] EdDSA engine mode select.2'd0 : mode02'd1 : mode12'd2
                                                     : mode22'd3 : mode3                                                       */
      __IOM uint32_t fun_sel    : 2;            /*!< [3..2] EdDSA engine function select.2'd0 : Decode point/ add
                                                     point/ sub mod [It depends on bit ecover_x_en and bit ap_en.]2'd1
                                                     : Div mod2'd2 : Add mod2'd3 : Mult mod/ Hash mod #modular1/
                                                     Hash mod #modular2 [It depends on bit h512_en and bit mod_q]              */
      __IOM uint32_t ap_en      : 1;            /*!< [4..4] Add point enable control. It is only used in mode3.1:
                                                     enable0: disable                                                          */
      __IOM uint32_t auto_sp    : 1;            /*!< [5..5] Auto-flow step enable control. Basically, it is used
                                                     to open one pass flow in mode0/mode1 flow. It won't be
                                                     set in mode2/ mode3.                                                      */
      __IOM uint32_t byp_h512   : 1;            /*!< [6..6] SHA512 hash bypass mode control.1: Bypass SHA5120: Without
                                                     bypass SHA512                                                             */
      __IOM uint32_t h512_en    : 1;            /*!< [7..7] SHA512 hash enable control.1: enable using sha5120: disable
                                                     using sha512                                                              */
      __IOM uint32_t mod_q      : 1;            /*!< [8..8] Select modular1 or 2 for Hash mod. Ref. Function Step
                                                     chapter.#modular1 : hash[511:0] modular (2^255 - 19)#modular2
                                                     : hash[511:0] modular (2^252+ 27742317777372353535851937790883648493)     */
      __IOM uint32_t sub_point  : 1;            /*!< [9..9] Point subtraction enable control in mode2.                         */
      __IOM uint32_t recover_x_en : 1;          /*!< [10..10] Reocver(decode) point enable contrl. When this bit
                                                     is set to 1'b1, it means that enable decoding mode.                       */
      __IOM uint32_t eng_decode_fail_mask : 1;  /*!< [11..11] Mask decoding fail interrupt.                                    */
      __IOM uint32_t mode0_f_mask : 1;          /*!< [12..12] Mask mode0 finish interrupt.                                     */
      __IOM uint32_t mode1_f_mask : 1;          /*!< [13..13] Mask mode1 finish interrupt.                                     */
      __IOM uint32_t mode2_f_mask : 1;          /*!< [14..14] Mask mode2 finish interrupt.                                     */
      __IOM uint32_t mode3_f_mask : 1;          /*!< [15..15] Mask mode3 finish interrupt.                                     */
      __IOM uint32_t x1_byte_swap : 1;          /*!< [16..16] x1 byte swap enable control.                                     */
      __IOM uint32_t x1_word_swap : 1;          /*!< [17..17] x1 word swap enable control.                                     */
      __IOM uint32_t y1_byte_swap : 1;          /*!< [18..18] y1 byte swap enable control.                                     */
      __IOM uint32_t y1_word_swap : 1;          /*!< [19..19] y1 word swap enable control.                                     */
      __IOM uint32_t x2_byte_swap : 1;          /*!< [20..20] x2 byte swap enable control.                                     */
      __IOM uint32_t x2_word_swap : 1;          /*!< [21..21] x2 word swap enable control.                                     */
      __IOM uint32_t y2_byte_swap : 1;          /*!< [22..22] y2 byte swap enable control.                                     */
      __IOM uint32_t y2_word_swap : 1;          /*!< [23..23] y2 word swap enable control.                                     */
      __IOM uint32_t xo1_byte_swap : 1;         /*!< [24..24] xo1 byte swap enable control.                                    */
      __IOM uint32_t xo1_word_swap : 1;         /*!< [25..25] xo1 word swap enable control.                                    */
      __IOM uint32_t yo1_byte_swap : 1;         /*!< [26..26] yo1 byte swap enable control.                                    */
      __IOM uint32_t yo1_word_swap : 1;         /*!< [27..27] yo1 word swap enable control.                                    */
      __IOM uint32_t xo2_byte_swap : 1;         /*!< [28..28] xo2 byte swap enable control.                                    */
      __IOM uint32_t xo2_word_swap : 1;         /*!< [29..29] xo2 word swap enable control.                                    */
      __IOM uint32_t yo2_byte_swap : 1;         /*!< [30..30] yo2 byte swap enable control.                                    */
      __IOM uint32_t yo2_word_swap : 1;         /*!< [31..31] yo2 word swap enable control.                                    */
    } eng_ctrl_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x1_p0_reg;               /*!< (@ 0x00000010) EdDSA Engine X1 Point [31:0] Registers                     */
    
    struct {
      __IOM uint32_t eng_x1_p0  : 32;           /*!< [31..0] X1 value [31:0] of an input point.                                */
    } eng_x1_p0_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x1_p1_reg;               /*!< (@ 0x00000014) EdDSA Engine X1 Point [63:32] Registers                    */
    
    struct {
      __IOM uint32_t eng_x1_p1  : 32;           /*!< [31..0] X1 value [63:32] of a input point.                                */
    } eng_x1_p1_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x1_p2_reg;               /*!< (@ 0x00000018) EdDSA Engine X1 Point [95:64] Registers                    */
    
