Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t eng_x1_p2  : 32;           /*!< [31..0] X1 value [95:64] of an input point.                               */
    } eng_x1_p2_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x1_p3_reg;               /*!< (@ 0x0000001C) EdDSA Engine X1 Point [127:96] Registers                   */
    
    struct {
      __IOM uint32_t eng_x1_p3  : 32;           /*!< [31..0] X1 value [127:96] of a input point.                               */
    } eng_x1_p3_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x1_p4_reg;               /*!< (@ 0x00000020) EdDSA Engine X1 Point [159:128] Registers                  */
    
    struct {
      __IOM uint32_t eng_x1_p4  : 32;           /*!< [31..0] X1 value [159:128] of an input point.                             */
    } eng_x1_p4_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x1_p5_reg;               /*!< (@ 0x00000024) EdDSA Engine X1 Point [191:160] Registers                  */
    
    struct {
      __IOM uint32_t eng_x1_p5  : 32;           /*!< [31..0] X1 value [191:160] of a input point.                              */
    } eng_x1_p5_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x1_p6_reg;               /*!< (@ 0x00000028) EdDSA Engine X1 Point [223:192] Registers                  */
    
    struct {
      __IOM uint32_t eng_x1_p6  : 32;           /*!< [31..0] X1 value [223:192] of an input point.                             */
    } eng_x1_p6_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x1_p7_reg;               /*!< (@ 0x0000002C) EdDSA Engine X1 Point [255:224] Registers                  */
    
    struct {
      __IOM uint32_t eng_x1_p7  : 32;           /*!< [31..0] X1 value [255:224] of a input point.                              */
    } eng_x1_p7_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y1_p0_reg;               /*!< (@ 0x00000030) EdDSA Engine Y1 Point [31:0] Registers                     */
    
    struct {
      __IOM uint32_t eng_y1_p0  : 32;           /*!< [31..0] Y1 value [31:0] of an input point.                                */
    } eng_y1_p0_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y1_p1_reg;               /*!< (@ 0x00000034) EdDSA Engine Y1 Point [63:32] Registers                    */
    
    struct {
      __IOM uint32_t eng_y1_p1  : 32;           /*!< [31..0] Y1 value [63:32] of a input point.                                */
    } eng_y1_p1_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y1_p2_reg;               /*!< (@ 0x00000038) EdDSA Engine Y1 Point [95:64] Registers                    */
    
    struct {
      __IOM uint32_t eng_y1_p2  : 32;           /*!< [31..0] Y1 value [95:64] of an input point.                               */
    } eng_y1_p2_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y1_p3_reg;               /*!< (@ 0x0000003C) EdDSA Engine Y1 Point [127:96] Registers                   */
    
    struct {
      __IOM uint32_t eng_y1_p3  : 32;           /*!< [31..0] Y1 value [127:96] of a input point.                               */
    } eng_y1_p3_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y1_p4_reg;               /*!< (@ 0x00000040) EdDSA Engine Y1 Point [159:128] Registers                  */
    
    struct {
      __IOM uint32_t eng_y1_p4  : 32;           /*!< [31..0] Y1 value [159:128] of an input point.                             */
    } eng_y1_p4_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y1_p5_reg;               /*!< (@ 0x00000044) EdDSA Engine Y1 Point [191:160] Registers                  */
    
    struct {
      __IOM uint32_t eng_y1_p5  : 32;           /*!< [31..0] Y1 value [191:160] of a input point.                              */
    } eng_y1_p5_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y1_p6_reg;               /*!< (@ 0x00000048) EdDSA Engine Y1 Point [223:192] Registers                  */
    
    struct {
      __IOM uint32_t eng_y1_p6  : 32;           /*!< [31..0] Y1 value [223:192] of an input point.                             */
    } eng_y1_p6_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y1_p7_reg;               /*!< (@ 0x0000004C) EdDSA Engine Y1 Point [255:224] Registers                  */
    
    struct {
      __IOM uint32_t eng_y1_p7  : 32;           /*!< [31..0] Y1 value [255:224] of a input point.                              */
    } eng_y1_p7_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x2_p0_reg;               /*!< (@ 0x00000050) EdDSA Engine X2 Point [31:0] Registers                     */
    
    struct {
      __IOM uint32_t eng_x2_p0  : 32;           /*!< [31..0] X2 value [31:0] of an input point.                                */
    } eng_x2_p0_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x2_p1_reg;               /*!< (@ 0x00000054) EdDSA Engine X2 Point [63:32] Registers                    */
    
    struct {
      __IOM uint32_t eng_x2_p1  : 32;           /*!< [31..0] X2 value [63:32] of a input point.                                */
    } eng_x2_p1_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x2_p2_reg;               /*!< (@ 0x00000058) EdDSA Engine X2 Point [95:64] Registers                    */
    
    struct {
      __IOM uint32_t eng_x2_p2  : 32;           /*!< [31..0] X2 value [95:64] of an input point.                               */
    } eng_x2_p2_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x2_p3_reg;               /*!< (@ 0x0000005C) EdDSA Engine X2 Point [127:96] Registers                   */
    
    struct {
      __IOM uint32_t eng_x2_p3  : 32;           /*!< [31..0] X2 value [127:96] of a input point.                               */
    } eng_x2_p3_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x2_p4_reg;               /*!< (@ 0x00000060) EdDSA Engine X2 Point [159:128] Registers                  */
    
    struct {
      __IOM uint32_t eng_x2_p4  : 32;           /*!< [31..0] X2 value [159:128] of an input point.                             */
    } eng_x2_p4_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x2_p5_reg;               /*!< (@ 0x00000064) EdDSA Engine X2 Point [191:160] Registers                  */
    
