Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t eng_x2_p5  : 32;           /*!< [31..0] X2 value [191:160] of a input point.                              */
    } eng_x2_p5_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x2_p6_reg;               /*!< (@ 0x00000068) EdDSA Engine X2 Point [223:192] Registers                  */
    
    struct {
      __IOM uint32_t eng_x2_p6  : 32;           /*!< [31..0] X2 value [223:192] of an input point.                             */
    } eng_x2_p6_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_x2_p7_reg;               /*!< (@ 0x0000006C) EdDSA Engine X2 Point [255:224] Registers                  */
    
    struct {
      __IOM uint32_t eng_x2_p7  : 32;           /*!< [31..0] X2 value [255:224] of a input point.                              */
    } eng_x2_p7_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y2_p0_reg;               /*!< (@ 0x00000070) EdDSA Engine Y2 Point [31:0] Registers                     */
    
    struct {
      __IOM uint32_t eng_y2_p0  : 32;           /*!< [31..0] Y2 value [31:0] of an input point.                                */
    } eng_y2_p0_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y2_p1_reg;               /*!< (@ 0x00000074) EdDSA Engine Y2 Point [63:32] Registers                    */
    
    struct {
      __IOM uint32_t eng_y2_p1  : 32;           /*!< [31..0] Y2 value [63:32] of a input point.                                */
    } eng_y2_p1_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y2_p2_reg;               /*!< (@ 0x00000078) EdDSA Engine Y2 Point [95:64] Registers                    */
    
    struct {
      __IOM uint32_t eng_y2_p2  : 32;           /*!< [31..0] Y2 value [95:64] of an input point.                               */
    } eng_y2_p2_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y2_p3_reg;               /*!< (@ 0x0000007C) EdDSA Engine Y2 Point [127:96] Registers                   */
    
    struct {
      __IOM uint32_t eng_y2_p3  : 32;           /*!< [31..0] Y2 value [127:96] of a input point.                               */
    } eng_y2_p3_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y2_p4_reg;               /*!< (@ 0x00000080) EdDSA Engine Y2 Point [159:128] Registers                  */
    
    struct {
      __IOM uint32_t eng_y2_p4  : 32;           /*!< [31..0] Y2 value [159:128] of an input point.                             */
    } eng_y2_p4_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y2_p5_reg;               /*!< (@ 0x00000084) EdDSA Engine Y2 Point [191:160] Registers                  */
    
    struct {
      __IOM uint32_t eng_y2_p5  : 32;           /*!< [31..0] Y2 value [191:160] of a input point.                              */
    } eng_y2_p5_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y2_p6_reg;               /*!< (@ 0x00000088) EdDSA Engine Y2 Point [223:192] Registers                  */
    
    struct {
      __IOM uint32_t eng_y2_p6  : 32;           /*!< [31..0] Y2 value [223:192] of an input point.                             */
    } eng_y2_p6_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_y2_p7_reg;               /*!< (@ 0x0000008C) EdDSA Engine Y2 Point [255:224] Registers                  */
    
    struct {
      __IOM uint32_t eng_y2_p7  : 32;           /*!< [31..0] Y2 value [255:224] of a input point.                              */
    } eng_y2_p7_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo1_p0_reg;              /*!< (@ 0x00000090) EdDSA Engine X1 Output Point [31:0] Registers              */
    
    struct {
      __IOM uint32_t eng_xo1_p0 : 32;           /*!< [31..0] X1 value [31:0] of an output point.                               */
    } eng_xo1_p0_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo1_p1_reg;              /*!< (@ 0x00000094) EdDSA Engine X1 Output Point [63:32] Registers             */
    
    struct {
      __IOM uint32_t eng_xo1_p1 : 32;           /*!< [31..0] X1 value [63:32] of a output point.                               */
    } eng_xo1_p1_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo1_p2_reg;              /*!< (@ 0x00000098) EdDSA Engine X1 Output Point [95:64] Registers             */
    
    struct {
      __IOM uint32_t eng_xo1_p2 : 32;           /*!< [31..0] X1 value [95:64] of an output point.                              */
    } eng_xo1_p2_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo1_p3_reg;              /*!< (@ 0x0000009C) EdDSA Engine X1 Output Point [127:96] Registers            */
    
    struct {
      __IOM uint32_t eng_xo1_p3 : 32;           /*!< [31..0] X1 value [127:96] of a output point.                              */
    } eng_xo1_p3_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo1_p4_reg;              /*!< (@ 0x000000A0) EdDSA Engine X1 Output Point [159:128] Registers           */
    
    struct {
      __IOM uint32_t eng_xo1_p4 : 32;           /*!< [31..0] X1 value [159:128] of an output point.                            */
    } eng_xo1_p4_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo1_p5_reg;              /*!< (@ 0x000000A4) EdDSA Engine X1 Ouput Point [191:160] Registers            */
    
    struct {
      __IOM uint32_t eng_xo1_p5 : 32;           /*!< [31..0] X1 value [191:160] of a output point.                             */
    } eng_xo1_p5_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo1_p6_reg;              /*!< (@ 0x000000A8) EdDSA Engine X1 Output Point [223:192] Registers           */
    
    struct {
      __IOM uint32_t eng_xo1_p6 : 32;           /*!< [31..0] X1 value [223:192] of an output point.                            */
    } eng_xo1_p6_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo1_p7_reg;              /*!< (@ 0x000000AC) EdDSA Engine X1 Output Point [255:224] Registers           */
    
    struct {
      __IOM uint32_t eng_xo1_p7 : 32;           /*!< [31..0] X1 value [255:224] of a output point.                             */
    } eng_xo1_p7_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo1_p0_reg;              /*!< (@ 0x000000B0) EdDSA Engine Y1 Output Point [31:0] Registers              */
    
