Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t eng_yo1_p0 : 32;           /*!< [31..0] Y1 value [31:0] of an output point.                               */
    } eng_yo1_p0_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo1_p1_reg;              /*!< (@ 0x000000B4) EdDSA Engine Y1 Output Point [63:32] Registers             */
    
    struct {
      __IOM uint32_t eng_yo1_p1 : 32;           /*!< [31..0] Y1 value [63:32] of a output point.                               */
    } eng_yo1_p1_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo1_p2_reg;              /*!< (@ 0x000000B8) EdDSA Engine Y1 Output Point [95:64] Registers             */
    
    struct {
      __IOM uint32_t eng_yo1_p2 : 32;           /*!< [31..0] Y1 value [95:64] of an output point.                              */
    } eng_yo1_p2_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo1_p3_reg;              /*!< (@ 0x000000BC) EdDSA Engine Y1 Output Point [127:96] Registers            */
    
    struct {
      __IOM uint32_t eng_yo1_p3 : 32;           /*!< [31..0] Y1 value [127:96] of a output point.                              */
    } eng_yo1_p3_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo1_p4_reg;              /*!< (@ 0x000000C0) EdDSA Engine Y1 Output Point [159:128] Registers           */
    
    struct {
      __IOM uint32_t eng_yo1_p4 : 32;           /*!< [31..0] Y1 value [159:128] of an output point.                            */
    } eng_yo1_p4_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo1_p5_reg;              /*!< (@ 0x000000C4) EdDSA Engine Y1 Ouput Point [191:160] Registers            */
    
    struct {
      __IOM uint32_t eng_yo1_p5 : 32;           /*!< [31..0] Y1 value [191:160] of a output point.                             */
    } eng_yo1_p5_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo1_p6_reg;              /*!< (@ 0x000000C8) EdDSA Engine Y1 Output Point [223:192] Registers           */
    
    struct {
      __IOM uint32_t eng_yo1_p6 : 32;           /*!< [31..0] Y1 value [223:192] of an output point.                            */
    } eng_yo1_p6_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo1_p7_reg;              /*!< (@ 0x000000CC) EdDSA Engine Y1 Output Point [255:224] Registers           */
    
    struct {
      __IOM uint32_t eng_yo1_p7 : 32;           /*!< [31..0] Y1 value [255:224] of a output point.                             */
    } eng_yo1_p7_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo2_p0_reg;              /*!< (@ 0x000000D0) EdDSA Engine X2 Output Point [31:0] Registers              */
    
    struct {
      __IOM uint32_t eng_xo2_p0 : 32;           /*!< [31..0] X2 value [31:0] of an output point.                               */
    } eng_xo2_p0_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo2_p1_reg;              /*!< (@ 0x000000D4) EdDSA Engine X2 Output Point [63:32] Registers             */
    
    struct {
      __IOM uint32_t eng_xo2_p1 : 32;           /*!< [31..0] X2 value [63:32] of a output point.                               */
    } eng_xo2_p1_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo2_p2_reg;              /*!< (@ 0x000000D8) EdDSA Engine X2 Output Point [95:64] Registers             */
    
    struct {
      __IOM uint32_t eng_xo2_p2 : 32;           /*!< [31..0] X2 value [95:64] of an output point.                              */
    } eng_xo2_p2_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo2_p3_reg;              /*!< (@ 0x000000DC) EdDSA Engine X2 Output Point [127:96] Registers            */
    
    struct {
      __IOM uint32_t eng_xo2_p3 : 32;           /*!< [31..0] X2 value [127:96] of a output point.                              */
    } eng_xo2_p3_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo2_p4_reg;              /*!< (@ 0x000000E0) EdDSA Engine X2 Output Point [159:128] Registers           */
    
    struct {
      __IOM uint32_t eng_xo2_p4 : 32;           /*!< [31..0] X2 value [159:128] of an output point.                            */
    } eng_xo2_p4_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo2_p5_reg;              /*!< (@ 0x000000E4) EdDSA Engine X2 Ouput Point [191:160] Registers            */
    
    struct {
      __IOM uint32_t eng_xo2_p5 : 32;           /*!< [31..0] X2 value [191:160] of a output point.                             */
    } eng_xo2_p5_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo2_p6_reg;              /*!< (@ 0x000000E8) EdDSA Engine X2 Output Point [223:192] Registers           */
    
    struct {
      __IOM uint32_t eng_xo2_p6 : 32;           /*!< [31..0] X2 value [223:192] of an output point.                            */
    } eng_xo2_p6_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_xo2_p7_reg;              /*!< (@ 0x000000EC) EdDSA Engine X2 Output Point [255:224] Registers           */
    
    struct {
      __IOM uint32_t eng_xo2_p7 : 32;           /*!< [31..0] X2 value [255:224] of a output point.                             */
    } eng_xo2_p7_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo2_p0_reg;              /*!< (@ 0x000000F0) EdDSA Engine Y2 Output Point [31:0] Registers              */
    
    struct {
      __IOM uint32_t eng_yo2_p0 : 32;           /*!< [31..0] Y2 value [31:0] of an output point.                               */
    } eng_yo2_p0_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo2_p1_reg;              /*!< (@ 0x000000F4) EdDSA Engine Y2 Output Point [63:32] Registers             */
    
    struct {
      __IOM uint32_t eng_yo2_p1 : 32;           /*!< [31..0] Y2 value [63:32] of a output point.                               */
    } eng_yo2_p1_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo2_p2_reg;              /*!< (@ 0x000000F8) EdDSA Engine Y2 Output Point [95:64] Registers             */
    
    struct {
      __IOM uint32_t eng_yo2_p2 : 32;           /*!< [31..0] Y2 value [95:64] of an output point.                              */
    } eng_yo2_p2_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo2_p3_reg;              /*!< (@ 0x000000FC) EdDSA Engine Y2 Output Point [127:96] Registers            */
    
