Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t eng_yo2_p3 : 32;           /*!< [31..0] Y2 value [127:96] of a output point.                              */
    } eng_yo2_p3_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo2_p4_reg;              /*!< (@ 0x00000100) EdDSA Engine Y2 Output Point [159:128] Registers           */
    
    struct {
      __IOM uint32_t eng_yo2_p4 : 32;           /*!< [31..0] Y2 value [159:128] of an output point.                            */
    } eng_yo2_p4_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo2_p5_reg;              /*!< (@ 0x00000104) EdDSA Engine Y2 Ouput Point [191:160] Registers            */
    
    struct {
      __IOM uint32_t eng_yo2_p5 : 32;           /*!< [31..0] Y2 value [191:160] of a output point.                             */
    } eng_yo2_p5_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo2_p6_reg;              /*!< (@ 0x00000108) EdDSA Engine Y2 Output Point [223:192] Registers           */
    
    struct {
      __IOM uint32_t eng_yo2_p6 : 32;           /*!< [31..0] Y2 value [223:192] of an output point.                            */
    } eng_yo2_p6_reg_b;
  } ;
  
  union {
    __IOM uint32_t eng_yo2_p7_reg;              /*!< (@ 0x0000010C) EdDSA Engine Y2 Output Point [255:224] Registers           */
    
    struct {
      __IOM uint32_t eng_yo2_p7 : 32;           /*!< [31..0] Y2 value [255:224] of a output point.                             */
    } eng_yo2_p7_reg_b;
  } ;
  __IM  uint32_t  RESERVED[60];
  
  union {
    __IM  uint32_t eng_dbg_output_reg;          /*!< (@ 0x00000200) EdDSA Engine Debug Output Register                         */
    
    struct {
      __IM  uint32_t dbg_add_2_inv_2_finish : 1;/*!< [0..0] inv module finish signal in add_2 module                           */
      __IM  uint32_t dbg_add_2_inv_1_finish : 1;/*!< [1..1] inv module finish signal in add_2 module                           */
      __IM  uint32_t dbg_add_2_mul_2_finish : 1;/*!< [2..2] mul finish signal in add_2 module                                  */
      __IM  uint32_t dbg_add_2_mul_1_finish : 1;/*!< [3..3] mul finish signal in add_2 module                                  */
      __IM  uint32_t dbg_add_2_curr_state : 4;  /*!< [7..4] fsm signal in add_2 module                                         */
      __IM  uint32_t dbg_add_1_inv_2_finish : 1;/*!< [8..8] inv module finish signal in add_1 module                           */
      __IM  uint32_t dbg_add_1_inv_1_finish : 1;/*!< [9..9] inv module finish signal in add_1 module                           */
      __IM  uint32_t dbg_add_1_mul_2_finish : 1;/*!< [10..10] mul finish signal in add_1 module                                */
      __IM  uint32_t dbg_add_1_mul_1_finish : 1;/*!< [11..11] mul finish signal in add_1 module                                */
      __IM  uint32_t dbg_add_1_curr_state : 4;  /*!< [15..12] fsm signal in add_1module                                        */
      __IM  uint32_t dbg_add_2_finish : 1;      /*!< [16..16] finish signal in add_2 module                                    */
      __IM  uint32_t dbg_add_1_finish : 1;      /*!< [17..17] finish signal in add_1 module                                    */
      __IM  uint32_t dbg_curr_state : 4;        /*!< [21..18] fsm signal in top module                                         */
      __IM  uint32_t dbg_func_curr_state : 4;   /*!< [25..22] function fsm signal in top module                                */
      __IM  uint32_t dbg_eng_finish : 1;        /*!< [26..26] fsm signal in top module                                         */
      __IM  uint32_t dbg_reg_eng_rst : 1;       /*!< [27..27] reset signal in top module                                       */
      __IM  uint32_t dbg_decomp_curr_state : 4; /*!< [31..28] fsm signal in decoding module                                    */
    } eng_dbg_output_reg_b;
  } ;
} EDDSA_Type;                                   /*!< Size = 516 (0x204)                                                        */



/* =========================================================================================================================== */
/* ================                                           WLAN                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Wireless LAN (WLAN)
  */
/* =========================================================================================================================== */
/* ================                                           TRNG                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief TRNG real random number generator
  */

typedef struct {                                /*!< (@ 0x4000A400) RTC Structure                                              */
  
  union {
    __IOM uint32_t cmd;                         /*!< (@ 0x00000000) REG_AON_LSFIF_CMD                                          */
    
    struct {
      __IOM uint32_t lsfif_ad   : 16;           /*!< [15..0] BIT_AON_LSFIF_AD[15:8]=8'h00: RTC register base address           */
            uint32_t            : 8;
      __IOM uint32_t lsfif_we   : 4;            /*!< [27..24] LSF register byte write enable. This field is valid
                                                     during LSF register write transfer, and is ignored during
                                                     LSF register read transfer                                                */
      __IOM uint32_t lsfif_wr   : 1;            /*!< [28..28] LSF register write transfer indicator. 1: LSF register
                                                     write transfer, 0: LSF register read transfer                             */
            uint32_t            : 2;
      __IOM uint32_t lsfif_poll : 1;            /*!< [31..31] Set this bit to do LSF register read or write transfer
                                                     depend on BIT_AON_LSFIF_WR. When transfer done, this bit
                                                     will be clear by HW                                                       */
    } cmd_b;
  } ;
  
  union {
    __IOM uint32_t lsfif_rwd;                   /*!< (@ 0x00000004) REG_AON_LSFIF_RWD                                          */
    
