Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
    struct {
      __IOM uint32_t lsfif_rwd  : 32;           /*!< [31..0] LSF(low speed function) write                                     */
    } lsfif_rwd_b;
  } ;
  
  union {
    __IOM uint32_t imr;                         /*!< (@ 0x00000008) REG_AON_RTC_IMR                                            */
    
    struct {
      __IOM uint32_t cnt_sec_imr : 1;           /*!< [0..0] Interrupt mask of RTC seconds counter                              */
      __IOM uint32_t cnt_min_imr : 1;           /*!< [1..1] Interrupt mask of RTC minutes counter                              */
      __IOM uint32_t cnt_hrs_imr : 1;           /*!< [2..2] Interrupt mask of RTC hours counter                                */
      __IOM uint32_t cnt_dow_imr : 1;           /*!< [3..3] Interrupt mask of RTC day of week counter                          */
      __IOM uint32_t cnt_dom_imr : 1;           /*!< [4..4] Interrupt mask of RTC day of month counter                         */
      __IOM uint32_t cnt_mth_imr : 1;           /*!< [5..5] Interrupt mask of RTC month counter                                */
      __IOM uint32_t cnt_yrs_imr : 1;           /*!< [6..6] Interrupt mask of RTC years counter                                */
      __IOM uint32_t cnt_doy_imr : 1;           /*!< [7..7] Interrupt mask of RTC day of year counter                          */
      __IOM uint32_t alrm_sec_imr : 1;          /*!< [8..8] Interrupt mask of RTC second alarm                                 */
      __IOM uint32_t alrm_min_imr : 1;          /*!< [9..9] Interrupt mask of RTC minute alarm                                 */
      __IOM uint32_t alrm_hrs_imr : 1;          /*!< [10..10] Interrupt mask of RTC hour alarm                                 */
      __IOM uint32_t alrm_dow_imr : 1;          /*!< [11..11] Interrupt mask of RTC day of week alarm                          */
      __IOM uint32_t alrm_dom_imr : 1;          /*!< [12..12] Interrupt mask of RTC day of month alarm                         */
      __IOM uint32_t alrm_mth_imr : 1;          /*!< [13..13] Interrupt mask of RTC month alarm                                */
      __IOM uint32_t alrm_yrs_imr : 1;          /*!< [14..14] Interrupt mask of RTC year alarm                                 */
      __IOM uint32_t alrm_doy_imr : 1;          /*!< [15..15] Interrupt mask of RTC day of year alarm                          */
      __IOM uint32_t alrm_imr   : 1;            /*!< [16..16] Interrupt mask of RTC alarm                                      */
            uint32_t            : 15;
    } imr_b;
  } ;
  
  union {
    __IOM uint32_t isr;                         /*!< (@ 0x0000000C) REG_AON_RTC_ISR                                            */
    
    struct {
      __IOM uint32_t cnt_sec_isr : 1;           /*!< [0..0] Indicate increment of the second timer                             */
      __IOM uint32_t cnt_min_isr : 1;           /*!< [1..1] Indicate increment of the minute timer                             */
      __IOM uint32_t cnt_hrs_isr : 1;           /*!< [2..2] Indicate increment of the hour timer                               */
      __IOM uint32_t cnt_dow_isr : 1;           /*!< [3..3] Indicate increment of the day-of-week timer                        */
      __IOM uint32_t cnt_dom_isr : 1;           /*!< [4..4] Indicate increment of the day-of-month timer                       */
      __IOM uint32_t cnt_mth_isr : 1;           /*!< [5..5] Indicate increment of the month timer                              */
      __IOM uint32_t cnt_yrs_isr : 1;           /*!< [6..6] Indicate increment of the year timer                               */
      __IOM uint32_t cnt_doy_isr : 1;           /*!< [7..7] Indicate increment of the Day-of-year timer                        */
      __IOM uint32_t alrm_sec_isr : 1;          /*!< [8..8] Indicate Second timer value match ALRM_SEC                         */
      __IOM uint32_t alrm_min_isr : 1;          /*!< [9..9] Indicate Minute timer value match ALRM_MIN                         */
      __IOM uint32_t alrm_hrs_isr : 1;          /*!< [10..10] Indicate Hour timer value match ALRM_HRS                         */
      __IOM uint32_t alrm_dow_isr : 1;          /*!< [11..11] Indicate DOW timer value match ALRM_DOW                          */
      __IOM uint32_t alrm_dom_isr : 1;          /*!< [12..12] Indicate DOM timer value match ALRM_DOM                          */
      __IOM uint32_t alrm_mth_isr : 1;          /*!< [13..13] Indicate MTH timer value match ALRM_MTH                          */
      __IOM uint32_t alrm_yrs_isr : 1;          /*!< [14..14] Indicate Year timer value match ALRM_YRS                         */
      __IOM uint32_t alrm_doy_isr : 1;          /*!< [15..15] Indicate DOY timer value match ALRM_DOY                          */
      __IOM uint32_t alrm_isr   : 1;            /*!< [16..16] Indicate ALL timer value match ALRM value                        */
            uint32_t            : 15;
    } isr_b;
  } ;
} TRNG_Type;                                     /*!< Size = 16 (0x10)                                                          */




/* =========================================================================================================================== */
/* ================                                            USB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief USB OTG (USB)
  */

/* =========================================================================================================================== */
/* ================                                           USB_S                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief USB OTG_S (USB_S)
  */

/* =========================================================================================================================== */
/* ================                                            ISP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ISP (ISP)
  */

/* =========================================================================================================================== */
/* ================                                            VOE                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Video Offload Engine (VOE)
  */

/* =========================================================================================================================== */
/* ================                                          H265Enc                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief H.265 Encoder Engine (H265Enc)
  */

/* =========================================================================================================================== */
/* ================                                            AON                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PON Control Register (AON)
  */

/* =========================================================================================================================== */
/* ================                                            PON                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PON Control Register (PON)
  */

/* =========================================================================================================================== */
/* ================                                           VNDR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief VNDR Control Register (VNDR)
  */

/* =========================================================================================================================== */
/* ================                                          VNDR_S                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief VNDR_S Control Register (VNDR_S)
  */

/* =========================================================================================================================== */
/* ================                                            NN                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief Nual Network Engine (NN)
  */

/* =========================================================================================================================== */
/* ================                                           DDR2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DDR2 Controller (DDR2)
  */

/* =========================================================================================================================== */
/* ================                                           ECDSA                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief ECDSA offload engine (ECDSA)
  */

/* =========================================================================================================================== */
/* ================                                         FLASH_SEC                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief Flash SEC engine (FLASH_SEC)
  */

/* =========================================================================================================================== */
/* ================                                            RSA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief RSA (RSA)
  */

/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


