Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define SYSON_BASE                  0x40000000UL
#define SYSON_S_BASE                0x50000800UL
#define GPIO_BASE                   0x40001000UL
#define GPIO_S_BASE                 0x50001000UL
#define COMP_BASE                   0x4000AC00UL
#define COMP_S_BASE                 0x5000AC00UL
#define TG0_BASE                    0x40002000UL
#define TG0_S_BASE                  0x50002000UL
#define TM0_BASE                    0x40002040UL
#define TM0_S_BASE                  0x50002040UL
#define TM1_BASE                    0x40002080UL
#define TM1_S_BASE                  0x50002080UL
#define TM2_BASE                    0x400020C0UL
#define TM2_S_BASE                  0x500020C0UL
#define TM3_BASE                    0x40002100UL
#define TM3_S_BASE                  0x50002100UL
#define TM4_BASE                    0x40002140UL
#define TM4_S_BASE                  0x50002140UL
#define TM5_BASE                    0x40002180UL
#define TM5_S_BASE                  0x50002180UL
#define TM6_BASE                    0x400021C0UL
#define TM6_S_BASE                  0x500021C0UL
#define TM7_BASE                    0x40002200UL
#define TM7_S_BASE                  0x50002200UL
#define TG1_BASE                    0x4000B400UL
#define TG1_S_BASE                  0x5000B400UL
#define TM8_BASE                    0x4000B440UL
#define TM8_S_BASE                  0x5000B440UL
#define TG2_BASE                    0x4000B800UL
#define TG2_S_BASE                  0x5000B800UL
#define TM9_BASE                    0x4000B840UL
#define TM9_S_BASE                  0x5000B840UL
#define TM10_BASE                   0x4000B880UL
#define TM10_S_BASE                 0x5000B880UL
#define TM11_BASE                   0x4000B8C0UL
#define TM11_S_BASE                 0x5000B8C0UL
#define TM12_BASE                   0x4000B900UL
#define TM12_S_BASE                 0x5000B900UL
#define TM13_BASE                   0x4000B940UL
#define TM13_S_BASE                 0x5000B940UL
#define TM14_BASE                   0x4000B980UL
#define TM14_S_BASE                 0x5000B980UL
#define TM15_BASE                   0x4000B9C0UL
#define TM15_S_BASE                 0x5000B9C0UL
#define TM16_BASE                   0x4000BA00UL
#define TM16_S_BASE                 0x5000BA00UL
#define TG3_BASE                    0x4000BC00UL
#define TG3_S_BASE                  0x5000BC00UL
#define TM17_BASE                   0x4000BC40UL
#define TM17_S_BASE                 0x5000BC40UL
#define RTC_BASE                    0x4000A400UL
#define RTC_S_BASE                  0x5000A400UL
#define PWM_COMM_BASE               0x40045000UL
#define PWM_COMM_S_BASE             0x50045000UL
#define PWM0_BASE                   0x40045020UL
#define PWM0_S_BASE                 0x50045020UL
#define PWM1_BASE                   0x40045040UL
#define PWM1_S_BASE                 0x50045040UL
#define PWM2_BASE                   0x40045060UL
#define PWM2_S_BASE                 0x50045060UL
#define PWM3_BASE                   0x40045080UL
#define PWM3_S_BASE                 0x50045080UL
#define PWM4_BASE                   0x400450A0UL
#define PWM4_S_BASE                 0x500450A0UL
#define PWM5_BASE                   0x400450C0UL
#define PWM5_S_BASE                 0x500450C0UL
#define PWM6_BASE                   0x400450E0UL
#define PWM6_S_BASE                 0x500450E0UL
#define PWM7_BASE                   0x40045100UL
#define PWM7_S_BASE                 0x50045100UL
#define PWM8_BASE                   0x40045120UL
#define PWM8_S_BASE                 0x50045120UL
#define PWM9_BASE                   0x40045140UL
#define PWM9_S_BASE                 0x50045140UL
#define PWM10_BASE                  0x40045160UL
#define PWM10_S_BASE                0x50045160UL
#define PWM11_BASE                  0x40045180UL
#define PWM11_S_BASE                0x50045180UL
#define SPIC_BASE                   0x40006000UL
#define SPIC_S_BASE                 0x50006000UL
#define SNAFC_BASE                  0x4005D000UL
#define SNAFC_S_BASE                0x5005D000UL
#define ADC_BASE                    0x40010000UL
#define ADC_S_BASE                  0x50010000UL
#define UART0_BASE                  0x40040000UL
#define UART0_S_BASE                0x50040000UL
#define UART1_BASE                  0x40040400UL
#define UART1_S_BASE                0x50040400UL
#define UART2_BASE                  0x40040800UL
#define UART2_S_BASE                0x50040800UL
#define UART3_BASE                  0x40040C00UL
#define UART3_S_BASE                0x50040C00UL
#define UART4_BASE                  0x40041000UL
#define UART4_S_BASE                0x50041000UL
#define SSI0_BASE                   0x40042800UL
#define SSI0_S_BASE                 0x50042800UL
#define SSI1_BASE                   0x40042C00UL
#define SSI1_S_BASE                 0x50042C00UL
#define SSI2_BASE                   0x40074000UL
#define SSI2_S_BASE                 0x50074000UL
#define SSI3_BASE                   0x40074400UL
#define SSI3_S_BASE                 0x50074400UL
#define I2C0_BASE                   0x40044000UL
#define I2C0_S_BASE                 0x50044000UL
#define I2C1_BASE                   0x40044400UL
#define I2C1_S_BASE                 0x50044400UL
#define I2C2_BASE                   0x40003400UL
#define I2C2_S_BASE                 0x50003400UL
#define I2C3_BASE                   0x40044C00UL
#define I2C3_S_BASE                 0x50044C00UL
#define SI_BASE                     0x40013000UL
#define SPORT_BASE                  0x40066000UL
#define SPORT_S_BASE                0x50066000UL
#define SGPIO_BASE                  0x40046000UL
#define SGPIO_S_BASE                0x50046000UL
#define ETHERNET_BASE               0x40054000UL
#define ETHERNET_S_BASE             0x50054000UL
#define SDMMC_BASE                  0x40058000UL
#define SDMMC_S_BASE                0x50058000UL
#define SDIOHOST_BASE               0x4005C000UL
#define SDIOHOST_S_BASE             0x5005C000UL
#define GDMA0_BASE                  0x400612C0UL
#define SGDMA0_BASE                 0x500612C0UL
#define GDMA0_CH0_BASE              0x40061000UL
#define SGDMA0_CH0_BASE             0x50061000UL
#define GDMA0_CH1_BASE              0x40061058UL
#define SGDMA0_CH1_BASE             0x50061058UL
#define GDMA0_CH2_BASE              0x400610B0UL
#define SGDMA0_CH2_BASE             0x500610B0UL
#define GDMA0_CH3_BASE              0x40061108UL
#define SGDMA0_CH3_BASE             0x50061108UL
#define GDMA0_CH4_BASE              0x40061160UL
#define SGDMA0_CH4_BASE             0x50061160UL
#define GDMA0_CH5_BASE              0x400611B8UL
#define SGDMA0_CH5_BASE             0x500611B8UL
#define GDMA1_BASE                  0x400602C0UL
#define SGDMA1_BASE                 0x500602C0UL
#define GDMA1_CH0_BASE              0x40060000UL
#define SGDMA1_CH0_BASE             0x50060000UL
#define GDMA1_CH1_BASE              0x40060058UL
#define SGDMA1_CH1_BASE             0x50060058UL
#define GDMA1_CH2_BASE              0x400600B0UL
#define SGDMA1_CH2_BASE             0x500600B0UL
#define GDMA1_CH3_BASE              0x40060108UL
#define SGDMA1_CH3_BASE             0x50060108UL
#define GDMA1_CH4_BASE              0x40060160UL
#define SGDMA1_CH4_BASE             0x50060160UL
#define GDMA1_CH5_BASE              0x400601B8UL
#define SGDMA1_CH5_BASE             0x500601B8UL
#define I2S0_BASE                   0x40062000UL
#define I2S0_S_BASE                 0x50062000UL
#define I2S1_BASE                   0x40063000UL
#define I2S1_S_BASE                 0x50063000UL
#define CRYPTO_BASE                 0x50070000UL
#define CRYPTO_NS_BASE              0x40070000UL
#define EDDSA_BASE                  0x40046800UL
#define EDDSA_S_BASE                0x50046800UL
#define WLAN_BASE                   0x40080000UL
#define USB_BASE                    0x400C0000UL
#define USB_S_BASE                  0x500C0000UL
#define ISP_BASE                    0x40300000UL
#define VOE_BASE                    0x40492000UL
#define H265Enc_BASE                0x40500000UL
#define AON_BASE                    0x40009000UL
#define PON_BASE                    0x40009800UL
#define VNDR_BASE                   0x40002800UL
#define VNDR_S_BASE                 0x50002C00UL
#define NN_BASE                     0x40580000UL
#define DDR2_BASE                   0x40601000UL
#define ECDSA_BASE                  0x40046400UL
#define ECDSA_S_BASE                0x50046400UL
#define FLASH_SEC_BASE              0x5000B600UL
#define RSA_BASE                    0x40067F00UL
#define RSA_S_BASE                  0x50067F00UL
#define TRNG_BASE                   0x4000B000UL


/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define SYSON                       ((SYSON_TypeDef*)             SYSON_BASE)
#define SYSON_S                     ((SYSON_S_TypeDef*)           SYSON_S_BASE)
#define GPIO                        ((GPIO_TypeDef*)              GPIO_BASE)
#define GPIO_S                      ((GPIO_TypeDef*)              GPIO_S_BASE)
#define COMP                        ((COMP_TypeDef*)              COMP_BASE)
#define COMP_S                      ((COMP_TypeDef*)              COMP_S_BASE)
#define TG0                         ((TG_TypeDef*)               TG0_BASE)
#define TG0_S                       ((TG_TypeDef*)               TG0_S_BASE)
#define TM0                         ((TM_TypeDef*)               TM0_BASE)
#define TM0_S                       ((TM_TypeDef*)               TM0_S_BASE)
#define TM1                         ((TM_TypeDef*)               TM1_BASE)
#define TM1_S                       ((TM_TypeDef*)               TM1_S_BASE)
#define TM2                         ((TM_TypeDef*)               TM2_BASE)
#define TM2_S                       ((TM_TypeDef*)               TM2_S_BASE)
#define TM3                         ((TM_TypeDef*)               TM3_BASE)
#define TM3_S                       ((TM_TypeDef*)               TM3_S_BASE)
#define TM4                         ((TM_TypeDef*)               TM4_BASE)
#define TM4_S                       ((TM_TypeDef*)               TM4_S_BASE)
#define TM5                         ((TM_TypeDef*)               TM5_BASE)
#define TM5_S                       ((TM_TypeDef*)               TM5_S_BASE)
#define TM6                         ((TM_TypeDef*)               TM6_BASE)
#define TM6_S                       ((TM_TypeDef*)               TM6_S_BASE)
#define TM7                         ((TM_TypeDef*)               TM7_BASE)
#define TM7_S                       ((TM_TypeDef*)               TM7_S_BASE)
#define TG1                         ((TG_TypeDef*)               TG1_BASE)
#define TG1_S                       ((TG_TypeDef*)               TG1_S_BASE)
#define TM8                         ((TM_TypeDef*)               TM8_BASE)
#define TM8_S                       ((TM_TypeDef*)               TM8_S_BASE)
#define TG2                         ((TG_TypeDef*)               TG2_BASE)
#define TG2_S                       ((TG_TypeDef*)               TG2_S_BASE)
#define TM9                         ((TM_TypeDef*)               TM9_BASE)
#define TM9_S                       ((TM_TypeDef*)               TM9_S_BASE)
#define TM10                        ((TM_TypeDef*)               TM10_BASE)
#define TM10_S                      ((TM_TypeDef*)               TM10_S_BASE)
#define TM11                        ((TM_TypeDef*)               TM11_BASE)
#define TM11_S                      ((TM_TypeDef*)               TM11_S_BASE)
#define TM12                        ((TM_TypeDef*)               TM12_BASE)
#define TM12_S                      ((TM_TypeDef*)               TM12_S_BASE)
#define TM13                        ((TM_TypeDef*)               TM13_BASE)
#define TM13_S                      ((TM_TypeDef*)               TM13_S_BASE)
#define TM14                        ((TM_TypeDef*)               TM14_BASE)
#define TM14_S                      ((TM_TypeDef*)               TM14_S_BASE)
#define TM15                        ((TM_TypeDef*)               TM15_BASE)
#define TM15_S                      ((TM_TypeDef*)               TM15_S_BASE)
#define TM16                        ((TM_TypeDef*)               TM16_BASE)
#define TM16_S                      ((TM_TypeDef*)               TM16_S_BASE)
#define TG3                         ((TG_TypeDef*)               TG3_BASE)
#define TG3_S                       ((TG_TypeDef*)               TG3_S_BASE)
#define TM17                        ((TM_TypeDef*)               TM17_BASE)
#define TM17_S                      ((TM_TypeDef*)               TM17_S_BASE)
#define RTC                         ((RTC_TypeDef*)               RTC_BASE)
#define RTC_S                       ((RTC_TypeDef*)               RTC_S_BASE)
#define PWM_COMM                    ((PWM_COMM_TypeDef*)          PWM_COMM_BASE)
#define PWM_COMM_S                  ((PWM_COMM_TypeDef*)          PWM_COMM_S_BASE)
#define PWM0                        ((PWM_TypeDef*)              PWM0_BASE)
#define PWM0_S                      ((PWM_TypeDef*)              PWM0_S_BASE)
#define PWM1                        ((PWM_TypeDef*)              PWM1_BASE)
#define PWM1_S                      ((PWM_TypeDef*)              PWM1_S_BASE)
#define PWM2                        ((PWM_TypeDef*)              PWM2_BASE)
#define PWM2_S                      ((PWM_TypeDef*)              PWM2_S_BASE)
#define PWM3                        ((PWM_TypeDef*)              PWM3_BASE)
#define PWM3_S                      ((PWM_TypeDef*)              PWM3_S_BASE)
#define PWM4                        ((PWM_TypeDef*)              PWM4_BASE)
#define PWM4_S                      ((PWM_TypeDef*)              PWM4_S_BASE)
#define PWM5                        ((PWM_TypeDef*)              PWM5_BASE)
#define PWM5_S                      ((PWM_TypeDef*)              PWM5_S_BASE)
#define PWM6                        ((PWM_TypeDef*)              PWM6_BASE)
#define PWM6_S                      ((PWM_TypeDef*)              PWM6_S_BASE)
#define PWM7                        ((PWM_TypeDef*)              PWM7_BASE)
#define PWM7_S                      ((PWM_TypeDef*)              PWM7_S_BASE)
#define PWM8                        ((PWM_TypeDef*)              PWM8_BASE)
#define PWM8_S                      ((PWM_TypeDef*)              PWM8_S_BASE)
#define PWM9                        ((PWM_TypeDef*)              PWM9_BASE)
#define PWM9_S                      ((PWM_TypeDef*)              PWM9_S_BASE)
#define PWM10                       ((PWM_TypeDef*)              PWM10_BASE)
#define PWM10_S                     ((PWM_TypeDef*)              PWM10_S_BASE)
#define PWM11                       ((PWM_TypeDef*)              PWM11_BASE)
#define PWM11_S                     ((PWM_TypeDef*)              PWM11_S_BASE)
#define SPIC                        ((SPIC_TypeDef*)              SPIC_BASE)
#define SPIC_S                      ((SPIC_TypeDef*)              SPIC_S_BASE)
#define SNAFC                       ((SNAFC_TypeDef*)             SNAFC_BASE)
#define SNAFC_S                     ((SNAFC_TypeDef*)             SNAFC_S_BASE)
#define ADC                         ((ADC_TypeDef*)               ADC_BASE)
#define ADC_S                       ((ADC_TypeDef*)               ADC_S_BASE)
#define UART0                       ((UART_TypeDef*)             UART0_BASE)
#define UART0_S                     ((UART_TypeDef*)             UART0_S_BASE)
#define UART1                       ((UART_TypeDef*)             UART1_BASE)
#define UART1_S                     ((UART_TypeDef*)             UART1_S_BASE)
#define UART2                       ((UART_TypeDef*)             UART2_BASE)
#define UART2_S                     ((UART_TypeDef*)             UART2_S_BASE)
#define UART3                       ((UART_TypeDef*)             UART3_BASE)
#define UART3_S                     ((UART_TypeDef*)             UART3_S_BASE)
#define UART4                       ((UART_TypeDef*)             UART4_BASE)
#define UART4_S                     ((UART_TypeDef*)             UART4_S_BASE)
#define SSI0                        ((SSI_TypeDef*)              SSI0_BASE)
#define SSI0_S                      ((SSI_TypeDef*)              SSI0_S_BASE)
#define SSI1                        ((SSI_TypeDef*)              SSI1_BASE)
#define SSI1_S                      ((SSI_TypeDef*)              SSI1_S_BASE)
#define SSI2                        ((SSI_TypeDef*)              SSI2_BASE)
#define SSI2_S                      ((SSI_TypeDef*)              SSI2_S_BASE)
#define SSI3                        ((SSI_TypeDef*)              SSI3_BASE)
#define SSI3_S                      ((SSI_TypeDef*)              SSI3_S_BASE)
#define I2C0                        ((I2C_TypeDef*)              I2C0_BASE)
#define I2C0_S                      ((I2C_TypeDef*)              I2C0_S_BASE)
#define I2C1                        ((I2C_TypeDef*)              I2C1_BASE)
#define I2C1_S                      ((I2C_TypeDef*)              I2C1_S_BASE)
#define I2C2                        ((I2C_TypeDef*)              I2C2_BASE)
#define I2C2_S                      ((I2C_TypeDef*)              I2C2_S_BASE)
#define I2C3                        ((I2C_TypeDef*)              I2C3_BASE)
#define I2C3_S                      ((I2C_TypeDef*)              I2C3_S_BASE)
#define SI                          ((SI_TypeDef*)                SI_BASE)
#define SPORT                       ((SPORT_TypeDef*)             SPORT_BASE)
#define SPORT_S                     ((SPORT_TypeDef*)             SPORT_S_BASE)
#define SGPIO                       ((SGPIO_TypeDef*)             SGPIO_BASE)
#define SGPIO_S                     ((SGPIO_TypeDef*)             SGPIO_S_BASE)
#define ETHERNET                    ((ETHERNET_TypeDef*)          ETHERNET_BASE)
#define ETHERNET_S                  ((ETHERNET_TypeDef*)          ETHERNET_S_BASE)
#define SDMMC                       ((SDMMC_TypeDef*)             SDMMC_BASE)
#define SDMMC_S                     ((SDMMC_TypeDef*)             SDMMC_S_BASE)
#define SDIOHOST                    ((SDIOHOST_TypeDef*)          SDIOHOST_BASE)
#define SDIOHOST_S                  ((SDIOHOST_TypeDef*)          SDIOHOST_S_BASE)
#define GDMA0                       ((GDMA_TypeDef*)             GDMA0_BASE)
#define SGDMA0                      ((GDMA_TypeDef*)             SGDMA0_BASE)
#define GDMA0_CH0                   ((GDMA_CH_TypeDef*)         GDMA0_CH0_BASE)
#define SGDMA0_CH0                  ((GDMA_CH_TypeDef*)         SGDMA0_CH0_BASE)
#define GDMA0_CH1                   ((GDMA_CH_TypeDef*)         GDMA0_CH1_BASE)
#define SGDMA0_CH1                  ((GDMA_CH_TypeDef*)         SGDMA0_CH1_BASE)
#define GDMA0_CH2                   ((GDMA_CH_TypeDef*)         GDMA0_CH2_BASE)
#define SGDMA0_CH2                  ((GDMA_CH_TypeDef*)         SGDMA0_CH2_BASE)
#define GDMA0_CH3                   ((GDMA_CH_TypeDef*)         GDMA0_CH3_BASE)
#define SGDMA0_CH3                  ((GDMA_CH_TypeDef*)         SGDMA0_CH3_BASE)
#define GDMA0_CH4                   ((GDMA_CH_TypeDef*)         GDMA0_CH4_BASE)
#define SGDMA0_CH4                  ((GDMA_CH_TypeDef*)         SGDMA0_CH4_BASE)
#define GDMA0_CH5                   ((GDMA_CH_TypeDef*)         GDMA0_CH5_BASE)
#define SGDMA0_CH5                  ((GDMA_CH_TypeDef*)         SGDMA0_CH5_BASE)
#define GDMA1                       ((GDMA_TypeDef*)             GDMA1_BASE)
#define SGDMA1                      ((GDMA_TypeDef*)             SGDMA1_BASE)
#define GDMA1_CH0                   ((GDMA_CH_TypeDef*)         GDMA1_CH0_BASE)
#define SGDMA1_CH0                  ((GDMA_CH_TypeDef*)         SGDMA1_CH0_BASE)
#define GDMA1_CH1                   ((GDMA_CH_TypeDef*)         GDMA1_CH1_BASE)
#define SGDMA1_CH1                  ((GDMA_CH_TypeDef*)         SGDMA1_CH1_BASE)
#define GDMA1_CH2                   ((GDMA_CH_TypeDef*)         GDMA1_CH2_BASE)
#define SGDMA1_CH2                  ((GDMA_CH_TypeDef*)         SGDMA1_CH2_BASE)
#define GDMA1_CH3                   ((GDMA_CH_TypeDef*)         GDMA1_CH3_BASE)
#define SGDMA1_CH3                  ((GDMA_CH_TypeDef*)         SGDMA1_CH3_BASE)
#define GDMA1_CH4                   ((GDMA_CH_TypeDef*)         GDMA1_CH4_BASE)
#define SGDMA1_CH4                  ((GDMA_CH_TypeDef*)         SGDMA1_CH4_BASE)
#define GDMA1_CH5                   ((GDMA_CH_TypeDef*)         GDMA1_CH5_BASE)
#define SGDMA1_CH5                  ((GDMA_CH_TypeDef*)         SGDMA1_CH5_BASE)
#define I2S0                        ((I2S_TypeDef*)              I2S0_BASE)
#define I2S0_S                      ((I2S_TypeDef*)              I2S0_S_BASE)
#define I2S1                        ((I2S_TypeDef*)              I2S1_BASE)
#define I2S1_S                      ((I2S_TypeDef*)              I2S1_S_BASE)
#define CRYPTO                      ((CRYPTO_TypeDef*)            CRYPTO_BASE)
#define CRYPTO_NS                   ((CRYPTO_TypeDef*)            CRYPTO_NS_BASE)
#define EDDSA                       ((EDDSA_TypeDef*)             EDDSA_BASE)
#define EDDSA_S                     ((EDDSA_TypeDef*)             EDDSA_S_BASE)
#define WLAN                        ((WLAN_TypeDef*)              WLAN_BASE)
#define USB                         ((USB_TypeDef*)               USB_BASE)
#define USB_S                       ((USB_S_TypeDef*)             USB_S_BASE)
#define ISP                         ((ISP_TypeDef*)               ISP_BASE)
#define VOE                         ((VOE_TypeDef*)               VOE_BASE)
#define H265Enc                     ((H265Enc_TypeDef*)           H265Enc_BASE)
#define AON                         ((AON_TypeDef*)               AON_BASE)
#define PON                         ((PON_TypeDef*)               PON_BASE)
#define VNDR                        ((VNDR_TypeDef*)              VNDR_BASE)
#define VNDR_S                      ((VNDR_S_TypeDef*)            VNDR_S_BASE)
#define NN                          ((NN_TypeDef*)                NN_BASE)
#define DDR2                        ((DDR2_TypeDef*)              DDR2_BASE)
#define ECDSA                       ((ECDSA_TypeDef*)             ECDSA_BASE)
#define ECDSA_S                     ((ECDSA_TypeDef*)             ECDSA_S_BASE)
#define FLASH_SEC                   ((FLASH_SEC_TypeDef*)         FLASH_SEC_BASE)
#define RSA                         ((RSA_TypeDef*)               RSA_BASE)
#define RSA_S                       ((RSA_TypeDef*)               RSA_S_BASE)
//#define TRNG   						  ((TRNG_TYPE_TypeDef*)        TRNG_BASE )

