Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/cmsis/voe/include/rtl8735b_voe.h
/** @} */ /* End of group Device_Peripheral_declaration */


/******************************************************************************/
/*          CoreSight and other Peripheral memory map                         */
/******************************************************************************/
/* CoreSight Components */
#define TPIU_BASE                 0xE0040000UL
#define ETM_BASE                  0xE0041000UL
#define CTI_BASE                  0xE0042000UL
#define FPB_BASE                  0xE0002000UL

#define DWT_CTRL_SYNCTAP24        1 << 10
#define DWT_CTRL_SYNCTAP26        2 << 10
#define DWT_CTRL_SYNCTAP28        3 << 10

#define DWT_FUNC_SAMP_PC          0x1
#define DWT_FUNC_SAMP_DATA        0x2
#define DWT_FUNC_SAMP_PC_DATA     0x3
#define DWT_FUNC_PC_WPT           0x4
#define DWT_FUNC_TRIG_PC          0x8
#define DWT_FUNC_TRIG_RD          0x9
#define DWT_FUNC_TRIG_WR          0xA
#define DWT_FUNC_TRIG_RW          0xB

#define DWT_CTRL_POSTPRESET_10    0xA

#define ITM_TER_STIM0             1 << 0
#define ITM_TER_STIM1             1 << 1
#define ITM_TER_STIM2             1 << 2

#define ITM_TCR_TS_GLOBAL_128     0x01 << ITM_TCR_GTSFREQ_Pos
#define ITM_TCR_TS_GLOBAL_8192    0x10 << ITM_TCR_GTSFREQ_Pos
#define ITM_TCR_TS_GLOBAL_ALL     0x11 << ITM_TCR_GTSFREQ_Pos

/* Peripheral and SRAM base address */

//#define SRAM_BASE                 0x20000000UL
//#define PERIPH_BASE               0x40000000UL



/******************************************************************************/
/*                         Declaration                                        */
/******************************************************************************/
#define ETM                       ((ETM_Type     *) ETM_BASE)
#define TPIU                      ((TPIU_Type    *) TPIU_BASE)
#define CTI                       ((CTI_Type     *) CTI_BASE)

#define GPIO0		          ((GPIO_TypeDef *) GPIO0_BASE)
#define GPIO1		          ((GPIO_TypeDef *) GPIO1_BASE)
#define GPIO2		          ((GPIO_TypeDef *) GPIO2_BASE)

#endif
